000100240517pgm
000200240517
000201240517STRPCO *no
000202240517MonMsg cpf0000
000203240517
000204240517/* STRPCCMD PCCMD('START COPY C:\JOHNTEST2\*.CSV C:\JOHNTEST3\*.CSV') + */
000205240517/* pause(*no) */
000206240517
000207240517STRPCCMD PCCMD('START c:\johntest\cpy.bat') +
000208240517pause(*no)
000209240517
000210240517
000300240517endpgm
