000100990526     F******************************************************************
000300001106     F*  ABR070     GROUP BENEFIT SERVICES SOFTWARE                    *
000400990526     F*                                                                *
000500990526     F*            WRITTEN BY - DAVID KETTERMAN                        *
000600001106     F*            DATE - 11/06/00                                     *
000700990526     F*                                                                *
000800001106     F*  DESCRIPTION - THIS PROGRAM WILL LIST manual adjustments not   *
000900001106     F*                in the abr because the ssn/plan/ct/group #      *
001000001106     F*                was not entered.                                *
001001001106     F*                                                                *
001002150611     F* 06/11/15 dlk - increase total fields                           *
001100990526     F******************************************************************
001200990526     FHIST      IP   E             DISK
001501001107     Fcodes     IF   E           K DISK
001600940803     FQSYSPRT   O    F  132        PRINTER OFLIND(*INOF)
001603990527     Dcovmdy           s                   like(covtdt)
001604001107     Dtrdmdy           s                   like(trdate)
001611001106     D DIGITS          C                   CONST('0123456789')
001700990526     D                 DS
001800990526     D  CK#NOT                 1     30
001900001106     D  hssn1                  2      4
001901001106     D  hssn2                  6      7
001902001106     D  hssn3                  9     12
001903001106     D  hplan                 17     20
001904001106     D  hct                   23     24
0019050011060169 D                 DS
001906001106     D  HSSN                   1      9  0
001907001106     D  HSSNC                  1      9
001908001106     D  HSSN11                 1      3
001909001106     D  HSSN12                 4      5
001910001106     D  HSSN13                 6      9
001911001106     D                 DS
001912001106     D  hkey                   1     10
001913001106     D  pos1                   1      1
001914001107     D  ss#                    2     10  0
001915001107     D  t                      1      3
001916001107     D  s                      4      6
001917001107     D  a                      7     10
002000990526     D                UDS
002100990526     D  LFY                    1      4  0
002200990526     D  LFMD                   5      8  0
002300990526     D  LTY                    9     12  0
002400990526     D  LTMD                  13     16  0
002500990527     D  LTRUST                17     19
002600990527     D  LSUB                  20     22
002700990527     D  LACC                  23     26
002800981214     D  CONAME               201    240
002900981214     D  LTIME                242    247  0
003102001106     C*
003103001106     C* CHECK NOTE FIELD FOR A VAILD SSN
003104001106     C*
003105001106     C                   MOVE      HSSN1         HSSN11
003106001106     C                   MOVE      HSSN2         HSSN12
003107001106     C                   MOVE      HSSN3         HSSN13
003108001106     C                   MOVE      'Y'           SSNYN             1
003112001106     C*
003113001106     C     DIGITS        CHECK     HSSNC                                  99
003114001106     C   99              MOVE      'N'           SSNYN
003115001106
003116001106     c                   if        ssnyn = 'Y'
003117001106     c                   goto      #end
003118001106     c                   end
003119001106
003120001106
004401001107     c                   movel     trcode        type              1
004402001107     c                   move      trcode        t2                2
004403001107     C     codkey        CHAIN     codes
004404001107     c                   if        %found(codes)
004405001107     c                   move      ldescr        desout           30
004406001107     c                   else
004407001107     c                   move      *blanks       desout
004408001107     c                   end
004409990527     C*
004600990526     C*
005301990527     C                   eval      @datin = trdate
005302990527     C                   exsr      #datym
005303990527     C                   eval      trdmdy = @datou
0054009905260111 C*
005701990527     C                   eval      @datin = covtdt
005702990527     C                   exsr      #datym
005703990527     C                   eval      covmdy = @datou
008200990526     C*
008233990528     C*
008234001107     c                   if        pos1 = ' '
008235001107     c                   eval      *in10 = *on
008236001107     c                   else
008237001107     c                   eval      *in10 = *off
008238001107     c                   end
008239001107
008241150611     c                   add       1             tottr             8 0
008242150611     c                   add       tramt         tottramt         12 2
008300990526     C                   EXCEPT    PRT
008800990526     C*
008801001107     c     #end          tag
008802001107     C*
008900990526     C     *INZSR        BEGSR
009000990526     C*
009401001107     c     codkey        klist
009402001107     c                   kfld                    type
009403001107     c                   kfld                    t2
009404001107
009800990526     C                   ENDSR
009900990526     C*
010000990527   01C*
010100990527   01C*****************************************************
010200990527   01C*   CONVERT FIELD FROM YYYYMMDD TO MMDDYYYY         *
010300990527   01C*****************************************************
010400990527   01C*
010500990527   01C*   DATE IN  = @DATIN (8.0) YYYYMMDD
010600990527   01C*   DATE OUT = @DATOU (8.0) MMDDYYYY
010700990527   01C*
010800990527   01C     #DATYM        BEGSR
010902990527   01C                   MOVE      @DATIN        @MD               4 0
011000990527   01C                   MOVEL     @DATIN        @Y                4 0
011100990527   01C                   MOVEL     @MD           @DATOU            8 0
011200990527   01C                   MOVE      @Y            @DATOU
011300990527   01C                   MOVE      *ZEROS        @DATIN            8 0
011400990527   01C                   ENDSR
011500981214     OQSYSPRT   H    1P                     2 03
011600981214     O         OR    OF
011800981214     O                       CONAME              85
012000981214     O          H    1P                     1
012100981214     O         OR    OF
012200001107     O                                           73 'MANUAL ADJUSTMENTS NOT IN '
012300001107     O                                           76 'ABR'
012400981214     O          H    1P                     1
012500981214     O         OR    OF
012600001106     O                                           20 'PROGRAM NAME: ABR070'
012700981231     O                                           56 'DATE RANGE:'
012800990527   01O                       LFMD                62 '  /  '
012900990527   01O                                           63 '/'
013000990527   01O                       LFY                 67
013100990526     O                                           69 '-'
013200001107   01O                       LTMD                75 '  /  '
013300001107   01O                                           76 '/'
013400001107   01O                       LTY                 80
013500981214     O                                          122 'PAGE :'
013600981214     O                       PAGE          Z    131
013700981214     O          H    1P                     1
013800981214     O         OR    OF
013900981214     O                                            9 'RUN DATE:'
014000990526     O                       *DATE         Y     20
014100990527     O                                           52 'TRUST:'
014200990527     O                       LTRUST              56
014300990527     O                                           62 'SUB:'
014400990527     O                       LSUB                66
014500990527     O                                           72 'ACC:'
014600990527     O                       LACC                77
014700981214     O                                          122 'TIME :'
014800981214     O                       LTIME              132 '  :  :  '
014900981214     O          H    1P                     1
015000981214     O         OR    OF
015100981214     O                                           24 '""""""""""""""""""""""""'
015200981214     O                                           48 '""""""""""""""""""""""""'
015300981214     O                                           72 '""""""""""""""""""""""""'
015400981214     O                                           96 '""""""""""""""""""""""""'
015500981214     O                                          120 '""""""""""""""""""""""""'
015600981214     O                                          132 '""""""""""""'
016200990526     O          H    1P                     1
016300990526     O         OR    OF
016400001107     O                                           10 'ACCOUNT #'
016500001107     O                                           18 'TRANS'
016600001107     O                                           31 'DESCRIPTION'
016700001107     O                                           58 'NOTE 1'
016800001107     O                                           94 'TRANS'
016900001107     O                                          106 'EFFECTIVE'
016901001107     O                                          119 'AMOUNT'
017200981214     O          H    1P                     1
017300981214     O         OR    OF
017400001107     O                                           10 'OR SSN   '
017500001107     O                                           18 'CODE '
017600001107     O                                           94 'DATE'
017800001107     O                                          106 'DATE'
018100981214     O          H    1P                     2
018200981214     O         OR    OF
018300981214     O                                           24 '""""""""""""""""""""""""'
018400981214     O                                           48 '""""""""""""""""""""""""'
018500981214     O                                           72 '""""""""""""""""""""""""'
018600981214     O                                           96 '""""""""""""""""""""""""'
018700981214     O                                          120 '""""""""""""""""""""""""'
018800981214     O                                          132 '""""""""""""'
018900981214     O          E            PRT            1
018901001107     O               10      SS#                 12 '0   -  -    '
019000001107     O              n10      t                    3
019100001107     O              n10                           4 '-'
019200001107     O              n10      s                    7
019300001107     O              n10                           8 '-'
019301001107     O              n10      a                   12
019400001107     O                       t2                  18
019500001107     O                       desout              50
019600001107     O                       ck#not              82
019700001107     O                       TRDMDY        Y     94
019800001107     O                       covmdy        y    106
020000001107     O                       TRAMT         M    119
020300001107     O          t    lr                  1  1
020400001107     O                                           19 'TOTAL TRANSACTIONS:'
020402150611     O                       TOTTR         1     30
020500150611     O                                           39 'AMOUNT:'
020600150611     O                       TOTTRAMT      j     +2
