000100140409     H DFTACTGRP(*NO) ACTGRP(*CALLER) BNDDIR('ALLSRVPGMN')
000200131205     H ALWNULL(*USRCTL)
000300131205   X***X
000400140409   X***X JUST FOR EASY USE WHEN BNDDIR STUFF IS ONLY NEEDED FOR THIS ONE FUNCTION
000500140409   X***X
000600140409   X***X SSK 04/09/2014
000700140409   X***X
000800140409     D @1              S              1A   INZ
000900131206    ***
001000140409     D                 DS
001100140409     D  T                      1      3S 0
001200140409     D  S                      4      6S 0
001300140409     D  P                      7     10A
001400140409     D  R                     11     11A
001500140409     D  PARM@                  1     11A
001600140409    ***
001700131205   X***X
001800131213      /DEFINE CHK_ACA_PLAN_PR
001900131213      /DEFINE CHK_ACA_PLAN_FIELDS
002000140409      /COPY QCPYSRC,ACASRVPGMP
002100131213      /UNDEFINE CHK_ACA_PLAN_PR
002200131213      /UNDEFINE CHK_ACA_PLAN_FIELDS
002300131210   X***X
002400140409    ***
002500140409     C     *ENTRY        PLIST
002600140409     C                   PARM                    @11              11
002700140409    ***
002800140409     C                   EVAL      PARM@ = @11
002900140409    ***
003000140409     C                   EVAL      R = #CHK_ACA_PLAN(T:S:P)
003100140409    ***
003200140409     C                   EVAL      @11 = PARM@
003300140409    ***
003400140409     C                   RETURN
