000100160203      *=========================================================================
000200160203     H option(*noDebugIo)
000300160203      *=========================================================================
000400160203
000500160330     Faet080wfl uf a e           k disk    rename(aet080wflr:newFile)
000600160203
000700160330     Faet080wf  uf a e             disk    rename(aet080wf:medFile)
000800160330     F                                     prefix(m_)
000900160203
001000160330     Faet080wfv uf a e             disk    rename(aet080wf:visFile)
001100160330     F                                     prefix(v_)
001200160330
001300160203      *=========================================================================
001400160203
001500160208     d seq             S              7  0
001600160203
001700160203      *=========================================================================
001800160203
001900160330       setll 1 medFile;
002000160330       read medFile;
002100160203
002200160203       dow not %eof;
002300160203
002400160330        @dataf = m_aet080wf;
002500160330        @seq# = @seq# + 10;
002600160330
002700160330        write newFile;
002800160330
002900160330       read medFile;
003000160203       enddo;
003100160203
003200160330       exsr insert;
003300160330       exsr reCreate;
003400160330
003500160203       *inlr = *on;
003600160203       return;
003700160203
003800160203       //=========================================
003900160330       // insert
004000160203       //=========================================
004100160203
004200160330       begsr insert;
004300160330
004400160330       setll 1 visFile;
004500160330       read visFile;
004600160330
004700160330       dow not %eof;
004800160330
004900160330        setll *loval newFile;
005000160330        read newfile;
005100160330
005200160330        dow not %eof;
005300160330
005400160330        if @dataf = v_aet080wf;
005500160330         delete visFile;
005600160330          setll 1 visFile;
005700160330          read visFile;
005800160330           @dataf = v_aet080wf;
005900160330           @seq# = @seq# + 1;
006000160330           write newfile;
006100160330          delete visFile;
006200160330         leave;
006300160330        endif;
006400160330
006500160330        read newfile;
006600160330        enddo;
006700160330
006800160330       read visFile;
006900160330       enddo;
007000160330
007100160330       endsr;
007200160204
007300160330       //=========================================
007400160330       // reCreate
007500160330       //=========================================
007600160330
007700160330       begsr reCreate;
007800160330
007900160330       setll 1 medFile;
008000160330       read medFile;
008100160330
008200160330       dow not %eof;
008300160330
008400160330       delete medFile;
008500160330
008600160330       read medFile;
008700160330       enddo;
008800160330
008900160330       setll *loval newFile;
009000160330       read newFile;
009100160330
009200160330       dow not %eof;
009300160330
009400160330       m_aet080wf = @dataF;
009500160330       write medFile;
009600160330
009700160330       read newFile;
009800160330       enddo;
009900160330
010000160330       endsr;
010100160330
010200160203       //=========================================
