000101210325      *===========================================================================
000102210325     h option(*noDebugIo)
000104210325      *===========================================================================
000105210325      * AET513R -  Aetna State Specific Audit V3.0
000106210325      *===========================================================================
000107210325      * Date        Int   Description
000108210325      * ----------  ---   --------------------------------------------------------
000109210325      * 02/29/2012  ssk   Original creation
000110210325      * 01/23/2013  SSK   ADD STIERSTS TO AUDIT REPORT
000111210325      * 04/03/2013  SSK   ADD SEPARATE COLUMN FOR AA TO AUDIT REPORT
000112210325      * 03/24/2021  jt    Check that tranmission is on
000113210325      *===========================================================================
000600170425
000700210325     faet004wf  if   e           k disk    rename(aef04:mainFile)
000701210325
000800121130     FCARPLNQ   IF   E           K DISK
000801210325
000802210325     fcaraccp   if   e           k disk    rename(caraccr:setupFile)
000803210325
000900120229     FMCOVAPSE  IF   E           K DISK
000901210325
001000120229     FMEMBER    IF   E           K DISK
001001210325
001100121016     FACMUNIQUE IF   E           K DISK
001101210325
001200121016     FCARRSCANAAIF   E           K DISK
001201210325
001300121130     FPLNUNIQUE IF   E           K DISK
001301210325
001400120229     FT2000     O  A F 2000        DISK
001401210325
001500121130     FT500      O  A F  500        DISK
001501210325
001700170425      *=========================================================================
001800170425
002300120229     D @NAME           S             60A
002400121016     D HDG@            S             90A
002500120229     D S50@            S            100A
002600121129     D S50H            S            100A
002601210325     d x               s              3  0
002602210325     d qz              s              3  0
002800121130     D @T5             S            500A
002900120229     D @T              S           2000A
003000210325
003001210325     d @st             s              2
003002210325     d cnt             s              3  0
003003210325     d count           s              2  0
003004210325     d count2          s              2  0
003005210325     d ndx             s              3  0
003006210325     d @@states        s            300
003007210325     d carr#ctl        s             10
003008210325
005600210325      //==========================================================================
005601210325      // mainline
005602210325      //===========================================================================
005603210325
005604210325       exsr init;
005605210325       exsr main;
005606210325       exsr exit;
005607210325
005608210325      //==========================================================================
005609210325      // main
005610210325      //===========================================================================
005611210325
005612210325       begsr main;
005613210325
005614210325        setll *loval mainFile;
005615210325        read mainFile;
005616210325
005617210325        dow not %eof;
005619210325
005620210325         if ae4map = 'STATETIER' or ae4map = 'STSTATE' or ae4map = 'JUSTSTATE'
005621210325          or ae4map = 'STIERSTS';
005624210325          exsr process;
005625210325         endif;
005626210325
005627210325        read mainFile;
005628210325        enddo;
005629210325
005632210325       endsr;
005633210325
005634210325      //==========================================================================
005635210325      // process
005636210325      //===========================================================================
005637210325
005638210325       begsr process;
005639210325
005640210325        cnt = 0;
005641210325        ndx = 0;
005642210325        s50h = ' ';
005643210325
005644210325        setll (carr#ctl: ae4trs : ae4sub : ae4pln : ae4acc) carplnr;
005645210325        dou %eof;
005646210325        reade (carr#ctl: ae4trs : ae4sub : ae4pln : ae4acc) carplnr;
005647210325        if not %eof(CARPLNQ);
005648210325
005649210325         if ae4map = 'STATETIER' or ae4map = 'STSTATE' or
005650210325          ae4map = 'JUSTSTATE';
005651210325          @st = cpcctr;
005652210325         else;
005653210325          @st = %subst(cpcctr:2:2);
005654210325         endif;
005655210325
005656210325         ndx = 0;
005657210325
005658210325         if cnt = 0;
005659210325          cnt = 1;
005660210325           s50h = @st;
005661210325          iter;
005662210325         endif;
009200170425
009300121129     C                   DO        CNT
009400121129     C                   ADD       2             NDX
009401210325     C     NDX           SUB       1             PTR               3 0
009500210325         if %subst(s50h:ptr:2) = @st;
009501210325          ndx = 999;
009502210325          leave;
009503210325         endif;
009504210325     C                   ENDDO
009505210325
009506210325         if ndx <> 999;
009507210325          cnt = cnt + 1;
009508210325           ptr = (cnt * 2) - 1;
009509210325          %subst(s50h:ptr:2) = @st;
009510210325         endif;
009511210325
009512210325        endif;
009513210325        enddo;
009514210325
009515210325        s50@ = s50h;
009516210325
009517210325        exsr whoseit;
009518210325
009519210325        exsr compare;
009520210325
009521210325       endsr;
009522210325
018200210325      //==========================================================================
018201210325      // compare
018202210325      //===========================================================================
018203210325
018204210325       begsr compare;
018400210325
018816210325        setll (ae4trs : ae4sub : ae4acc : ae4pln) mcovr;
018817210325        reade (ae4trs : ae4sub : ae4acc : ae4pln) mcovr;
018818210325        dow not %eof;
018819210325
018820210325         if candt = 0;
018821210325          chain mcssno membr;
018822210325
018823210325          if %found;
018824210325           exsr verify;
018825210325          endif;
018826210325
018827210325        endif;
018828210325
018829210325        reade (ae4trs : ae4sub : ae4acc : ae4pln) mcovr;
018830210325        enddo;
018831210325
018832210325
018833210325       endsr;
018834210325
018863210325      //==========================================================================
018864210325      // verify
018865210325      //==========================================================================
018866210325
018867210325       begsr verify;
018868210325
018869210325        x = -1;
018870210325        count2 = 1;
018871210325
018872210325        dou (count2 = 50);
018873210325
018874210325         x = x + 2;
018875210325
018876210325         if %subst(s50@:x:2) = ' ';
018877210325          leave;
018878210325         endif;
018879210325
018880210325         if %subst(s50@:x:2) = state;
018881210325          leavesr;
018882210325         endif;
018883210325
018884210325         count2 += 1;
018885210325
018886210325        enddo;
018887210325
018888210325        exsr output;
022100210325
022101210325       endsr;
022102210325
023600210325      //===========================================================================
023601210325      // whose it
023602210325      //===========================================================================
023603210325
023604210325       begsr whoseit;
023605210325
023900210325        chain (ae4trs : ae4sub : ae4acc) accmsr;
024000210325         if atrmdt <> 0;
024001210325          leavesr;
024002210325         endif;
024003210325
024004210325        chain aacode aacodr;
024500210325        chain (ae4trs : ae4sub : ae4pln) plnmsr;
024600210325
024601210325        qz = -1;
024602210325        @@states = ' ';
024603210325
024604210325        count = 1;
024605210325
025000210325        dou (count = 50);
025001210325         qz = qz + 2;
025002210325         if %subst(s50@:qz:2) <> ' ';
025003210325          @@states = %trim(@@states) + '"' + %SUBST(S50@:QZ:2) + '",' ;
025004210325         endif;
025005210325
025006210325         count += 1;
025007210325        enddo;
025700210325
025800210325        if @@states <> ' ';
025801210325         @t5 = '"ACCOUNT: ' + %trim(acnam1) + '","' +  'AA:' + %trim(afnam) +
025802210325               ' ' +  %trim(alnam) + '","TSAP:' +  %editc(ae4trs:'X') + '-' +
025803210325               %editc(ae4sub:'X') + '-' + %editc(ae4acc:'X') + '-' + ae4pln +
025804210325               '","DESC: ' + %trim(pdescr) + '","STATES:",' + %trim(@@states);
025805210325         except outf5;
025806210325        endif;
025807210325
025808210325       endsr;
025809210325
027101210325      //===========================================================================
027102210325      // output
027103210325      //===========================================================================
027104210325
027200210325       begsr output;
027201210325
027202210325        chain (ae4trs : ae4sub : ae4acc) accmsr;
027203210325        chain aacode aacodr;
027204210325
027205210325        chain (carr#ctl: ae4trs : ae4sub : ae4acc) setupfile;
027206210325         if castatus = 'Y';
027207210325          hdg@ = %trim(acnam1) + '","AA:' + %trim(afnam) + ' ' + %trim(alnam);
027208210325
027209210325          @name =  %trim(mlname) + ', ' +  %trim(mfname) + ' ' + %trim(mmi);
027210210325
027211210325          @t = '"ACCOUNT: ' + %trim(hdg@) + '","TSAP:' + %editc(ae4trs:'X') +
027212210325                '-' + %editc(ae4sub:'X') + '-' + %editc(ae4acc:'X') + '-' +
027213210325                ae4pln + '-' + %trim(pdescr) +  '","MEMBER: ' + %trim(@name) +
027214210325                '(' +  %editw(mbssno:'   -  -    ') + ')","STATE: ' + state +
027215210325                ' IS NOT SETUP"';
027216210325         except outf;
027217210325        endif;
027218210325
027219210325       endsr;
027220210325
029501210325      //==========================================================================
029502210325      // exit;
029503210325      //===========================================================================
029504210325
029505210325       begsr exit;
029506210325
029507210325        *inlr = '1';
029508210325        return;
029509210325
029510210325       endsr;
029511210325
029512210325      //==========================================================================
029513210325      // init;
029514210325      //===========================================================================
029515210325
029516210325       begsr init;
029517210325
029518210325        @t5 = '"MAPPED STATES BY ACCOUNT & PLAN"';
029519210325        except outf5;
029520210325
029521210325        @t5 = ',';
029522210325        except outf5;
029523210325
029524210325        @t5 = ',';
029525210325        except outf5;
029526210325
029527210325        carr#ctl = '0000000127';
029528210325       endsr;
029529210325
029530210325      //===========================================================================
029531210325
029700120229     OT2000     EADD         OUTF
029800120229     O                       @T             B  2000
029900121130     OT500      EADD         OUTF5
030000121130     O                       @T5            B   500
