000100160616      *=================================================================================
000200160314     H option(*noDebugIo)
000300160314      *=================================================================================
0004001711160003  * AETEXTRF - Aetna Extract (convert to a less fields)
000500171114      *=========================================================================
000600171114      *  Date        Int  Description
000700171114      *  ----------  ---  ------------------------------------------------------
000800171116      *  11/14/2017  jt   Original Creation
000900160314
001000160314      *=================================================================================
001100160314
001200180926     Faetrecf   uf   e             disk    rename(aetrecfr:todaysFile)
001300171114
001400171114     Faetrecf2  o    e             disk    rename(aetrecf2r:outFile)
001500171114
001600171114      //========================================================================
001700171114      // Mainline
001800171114      //========================================================================
001900171114
002000171114       exsr init;
002100171114       exsr main;
002200171114       exsr exit;
002300171114
002400171114      //========================================================================
002500171114      // Main
002600171114      //========================================================================
002700171114
002800171114       begsr main;
002900171114
003000180926        exsr fixelr;
003100180926
003200171114        setll 1 todaysFile;
003300171114        read todaysfile;
003400171114
003500171114        dow not %eof;
003600171114
003700171114         write outFile;
003800171114
003900171114        read todaysfile;
004000171114        enddo;
004100171114
004200171114       endsr;
004300171114
004400180926      //========================================================================
004500180926      // fix elr
004600180926      //========================================================================
004700180926
004800180926       begsr fixelr;
004900180926
005000180926        setll 1 todaysFile;
005100180926        read todaysFile;
005200180926
005300180926        dow not %eof;
005400180926
005500180926         select;
005600180926          when xlincd = 'HLT';
005700180926           xelr = '001';
005800180926
005900180926          when xlincd = 'EPO';
006000180926           xelr = '001';
006100180926
006200180926          when xlincd = 'DEN';
006300180926           xelr = '002';
006400180926
006500180926          when xlincd = 'AH';
006600180926           xelr = '003';
006700180926
006800180926          when xlincd = 'VIS';
006900180926           xelr = '004';
007000180926
007100180926          endsl;
007200180926
007300180926         update todaysFile;
007400180926
007500180926        read todaysFile;
007600180926        enddo;
007700180926
007800180926       endsr;
007900180926
008000171114      //========================================================================
008100171114      // Exit
008200171114      //========================================================================
008300171114
008400171114       begsr exit;
008500171114
008600171114        *inlr = *on;
008700171114        return;
008800171114
008900171114       endsr;
009000171114
009100171114      //========================================================================
009200171114      // Init
009300171114      //========================================================================
009400171114
009500171114       begsr init;
009600171114
009700171114       endsr;
009800171114
009900171114      //========================================================================
