000100190401      *========================================================================
000102190401       Ctl-opt option(*noDebugIo) dftactgrp(*no);
000103190401      *========================================================================
000104200317      * AETLGCRTR - Aetna - Create mapping - Largl groups
000105190401      *========================================================================
000106190401      * Date         Int  Description
000107190401      * ---------    ---  -----------------------------------------------------
000108200317      * 03/17/2020   jt   Original Creation
000109201208      * 12/08/2020   jt   Checked for code MED (should be MEA).
000110210311      * 03/11/2021   jt   Hod wrong main file
000111190401      *========================================================================
000112200317
000113210311     faetlg     if a e             disk    rename(aetlr:mainFile)
000114200317
000115221006     f*carplnz   uf a e           k disk    rename(carplnr:planFile)
000116200317
000117221006     fcarplnl   uf a e           k disk    rename(carplnr:planFile)
000118221006
000119200317     fcaraccp   uf a e           k disk    rename(caraccr:acctFile)
000120200317
000121200317     faet004wf1 uf a e           k disk    rename(aef04:methodLG)
000122200317
000124190401      *========================================================================
000125190401
000135190401     d psds           sds
000136190401     d proc_name         *proc
000137190401     d user                  254    263
000144190401
000145190401      //======================================================================
000146190401      // mainline
000147190401      //======================================================================
000148190401
000149190401       exsr init;
000150190401       exsr main;
000151190401       exsr exit;
000152190401
000153190401      //======================================================================
000154190401      // moin
000155190401      //======================================================================
000156190401
000157190401       begsr main;
000158190401
000159200317        setll 1 mainFile;
000160200317        read mainFile;
000161200317
000162200317        dow not %eof;
000163200317
000164200317         exsr process;
000165200317         exsr groupUpdate;
000166200317
000175200317         read mainFile;
000176190401        enddo;
000177190401
000178190401       endsr;
000179190401
000180200317      //======================================================================
000181200317      // process
000182200317      //======================================================================
000183200317
000184200317       begsr process;
000185200317
000187200701        chain  ('0000000127' : %dec(trst:3:0) : %dec(sub:3:0) : %dec(acct:4:0))
000188200317         acctFile;
000189200317         if not %found;
000190200317          cauniq = '0000000127';
000191200317           catrst = %dec(trst:3:0);
000192200317            casub# = %dec(sub:3:0);
000193220929             caacct = %dec(acct:4:0);
000194220929              cacid5 = %editc(%dec(control#:7:0):'X');
000195220929              cacid8 = %editc(%dec(control#:7:0):'X');
000196220929             cacid7 = %editc(%dec(control#:7:0):'X');
000197220929            cacid4 = %editc(%dec(control#:7:0):'X');
000199200317           castatus = 'N';
000200200317          write acctFile;
000201200317         endif;
000202200317
000203221006        //chain
000204221006        // ('0000000127' : %dec(trst:3:0) : %dec(sub:3:0) : %dec(acct:4:0) : plan)
000205221006        //   planFile;
000206221006        chain
000207221006         ('0000000011' : %dec(trst:3:0) : %dec(sub:3:0) : plan : %dec(acct:4:0):
000208221006           mapvalue)
000209221006           planFile;
000211200317        if not %found;
000212200317         cpuniq = '9000000127';
000213200317         cptrst = %dec(trst:3:0);
000214200317         cpsub# = %dec(sub:3:0);
000215200701         cpacct = %dec(acct:4:0);
000216200317         cpplan = plan;
000217200317         cpcctr = mapvalue;
000218200317
000219200317         chain
000220200701          (%dec(trst:3:0) : %dec(sub:3:0) : %dec(acct:4:0) : plan : mapmethod)
000221200317           methodLG;
000222200317          if not %found;
000223200317           ae4trs = %dec(trst:3:0);
000224200317            ae4sub = %dec(sub:3:0);
000225200701             ae4acc = %dec(acct:4:0);
000226200317             ae4pln = plan;
000227200317            ae4map = mapmethod;
000228200317           write methodLG;
000229200317          endif;
000230200317
000231200317          cpcid1 = covtype;
000232201208          if covtype = 'MED';
000233201208           cpcid1 = 'MEA';
000234201208          endif;
000235201208
000236200701          cpcid2 = %editc(%dec(elr:3:0):'X');
000237200701          cpcid3 = %editc(%dec(suffix:3:0):'X');
000238200701          cpcid4 = %editc(%dec(account:5:0):'X');
000239200701          cpcid5 = %editc(%dec(planid:3:0):'X');
000240200701          cpcid6 = %editc(%dec(claimoff:3:0):'X');
000241200317          write planFile;
000242200317        endif;
000243200317
000244221006        if %found (carplnl);
000245200701         //cpplan = plan;
000246200317          cpcctr = mapvalue;
000247201208
000248200317           cpcid1 = covtype;
000249201208           if covtype = 'MED';
000250201208            cpcid1 = 'MEA';
000251201208           endif;
000252201208
000253200701            cpcid2 = %editc(%dec(elr:3:0):'X');
000254200701             cpcid3 = %editc(%dec(suffix:3:0):'X');
000255200701             cpcid4 = %editc(%dec(account:5:0):'X');
000256200701            cpcid5 = %editc(%dec(planid:3:0):'X');
000257200701           cpcid6 = %editc(%dec(claimoff:3:0):'X');
000258200317          update planFile;
000259200317        endif;
000260200317
000261200317       endsr;
000262200317
000263200317      //======================================================================
000264200317      // process
000265200317      //======================================================================
000266200317
000267200317       begsr groupUpdate;
000268200317
000269200317        chain
000270200701         ('0000000127':%dec(trst:3:0):%dec(sub:3:0):%dec(acct:4:0)) acctFile;
000271200317        if %found;
000272220929         cacid5 = %editc(%dec(control#:7:0):'X');
000273220929          cacid8 = %editc(%dec(control#:7:0):'X');
000274200701           cacid7 = %editc(%dec(control#:7:0):'X');
000277220929          cacid4 = %editc(%dec(control#:7:0):'X');
000280200317         update acctFile;
000281200317        endif;
000282200317
000283200317       endsr;
000284200317
000285190401      //======================================================================
000286190401      // exit
000287190401      //======================================================================
000288190401
000289190401       begsr exit;
000290190401
000291190401        *inlr = '1';
000292190401        return;
000293190401
000294190401       endsr;
000295190401
000296190401      //======================================================================
000297190401      // init
000298190401      //======================================================================
000299190401
000300190401       begsr init;
000301190401
000302190401       endsr;
000303190401
000304190401      //======================================================================
