000100190401      *========================================================================
000102190401       Ctl-opt option(*noDebugIo) dftactgrp(*no);
000103190401      *========================================================================
000104200316      * AETLGUPDR - Aetna - File Upload - Large groups
000105190401      *========================================================================
000106190401      * Date         Int  Description
000107190401      * ---------    ---  -----------------------------------------------------
000108200316      * 03/16/2020   jt   Original Creation
000109190401      *========================================================================
000110190401
000116200316       Dcl-f aetlgupdd WorkStn Handler('PROFOUNDUI(HANDLER)');
000123190401
000124190401      *========================================================================
000125190401
000126190401       dcl-ds UploadFile Qualified;
000128190401         NumFiles Zoned(3);
000129190401         Directory Char(256);
000130190401         Files Char(256);
000131190401       End-Ds;
000132190401
000133190401       dcl-s myFileName Char(256) ;
000134190401
000135190401     d psds           sds
000136190401     d proc_name         *proc
000137190401     d user                  254    263
000138190401
000139200316     d aetlgupdc       pr                  ExtPgm('AETLGUPDC')
000140200316     d
000141200316
000145190401      //======================================================================
000146190401      // mainline
000147190401      //======================================================================
000148190401
000149190401       exsr init;
000150190401       exsr main;
000151190401       exsr exit;
000152190401
000153190401      //======================================================================
000154190401      // moin
000155190401      //======================================================================
000156190401
000157190401       begsr main;
000158190401
000161190401        Dow btnExit = '0';
000162200316
000163190401         Exfmt Screen1;
000164190401
000165200316         if btnAccept = '1';
000166200316          exsr uploadRecords;
000167200316         endif;
000168200316
000169200316         if btnAccept2 = '1';
000170200316          exfmt msgWindow2;
000171200316          btnAccept2 = '0';
000172200316         endif;
000173200316
000182190401        enddo;
000183190401
000184190401       endsr;
000185190401
000186200316      //======================================================================
000187200316      // upload records;
000188200316      //======================================================================
000189200316
000190200316       begsr uploadRecords;
000191200316
000192200316        btnCancel = '0';
000193200316        btnAccept2 = '0';
000194200316
000195200316        dow btnCancel = '0';
000196200316
000197200316         exfmt msgWindow;
000198200316
000199200316         if btnAccept2 = '1';
000200200316          myFileName = UploadFile.Files;
000201200316           aetlgupdc();
000202200316          btnCancel = '1';
000204200316         endif;
000205200316
000206200316        enddo;
000207200316
000208200316       endsr;
000209200316
000210190401      //======================================================================
000211190401      // exit
000212190401      //======================================================================
000213190401
000214190401       begsr exit;
000215190401
000216190401        *inlr = '1';
000217190401        return;
000218190401
000219190401       endsr;
000220190401
000221190401      //======================================================================
000222190401      // init
000223190401      //======================================================================
000224190401
000225190401       begsr init;
000226190401
000227200316        btnExit = '0';
000228200316        btnCancel = '0';
000229200316        btnAccept = '0';
000230200316        btnAccept2 = '0';
000231200316
000232190401        pgmname = proc_name;
000233200316        title = 'Aetna Large Groups Upload File';
000234190401        btnExit = '0';
000236190401
000237190401       endsr;
000238190401
000239190401      //======================================================================
