000100190401      *========================================================================
000102190401       Ctl-opt option(*noDebugIo) dftactgrp(*no);
000103190401      *========================================================================
000104200317      * AETSMCRTR - Aetna - Create mapping - Small groups
000105190401      *========================================================================
000106190401      * Date         Int  Description
000107190401      * ---------    ---  -----------------------------------------------------
000108200317      * 03/17/2020   jt   Original Creation
000109201208      * 12/08/2020   jt   Checked for code MED (should be MEA).
000110190401      *========================================================================
000111200317
000112200317     faetsm     if a e             disk    rename(aetsr:mainFile)
000113200317
000114221006     fcarplnl   uf a e           k disk    rename(carplnr:planFile)
000115200317
000116221006     f*carplnz   uf a e           k disk    rename(carplnr:planFile)
000117221006
000118200317     fcaraccp   uf a e           k disk    rename(caraccr:acctFile)
000119200317
000120200317     faet001wf1 uf a e           k disk    rename(aef01:methodSM)
000121200317
000124190401      *========================================================================
000125190401
000135190401     d psds           sds
000136190401     d proc_name         *proc
000137190401     d user                  254    263
000138220929
000145190401      //======================================================================
000146190401      // mainline
000147190401      //======================================================================
000148190401
000149190401       exsr init;
000150190401       exsr main;
000151190401       exsr exit;
000152190401
000153190401      //======================================================================
000154190401      // moin
000155190401      //======================================================================
000156190401
000157190401       begsr main;
000158190401
000159200317        setll 1 mainFile;
000160200317        read mainFile;
000161200317
000162200317        dow not %eof;
000163200317
000164200317         exsr process;
000165200317         exsr groupUpdate;
000166200317
000175200317         read mainFile;
000176190401        enddo;
000177190401
000178190401       endsr;
000179190401
000180200317      //======================================================================
000181200317      // process
000182200317      //======================================================================
000183200317
000184200317       begsr process;
000185200317
000187200701        chain  ('0000000011' : %dec(trst:3:0) : %dec(sub:3:0) : %dec(acct:4:0))
000188200317         acctFile;
000189200317         if not %found;
000190200317          cauniq = '0000000011';
000191200317           catrst = %dec(trst:3:0);
000192200317            casub# = %dec(sub:3:0);
000193220929             caacct = %dec(acct:4:0);
000195221006              cacid5 = %editc(%dec(control#:7:0):'X');
000196220929               cacid8 = %editc(%dec(control#:7:0):'X');
000197220929               cacid7 = %editc(%dec(control#:7:0):'X');
000198220929              cacid4 = %editc(%dec(control#:7:0):'X');
000200220929            caacct = %dec(acct:4:0);
000201200317           castatus = 'N';
000202200317          write acctFile;
000203200317         endif;
000204200317
000205221006        //chain
000206221006        // ('0000000011' : %dec(trst:3:0) : %dec(sub:3:0) : %dec(acct:4:0) : plan)
000207221006        //   planFile;
000208221006        //if not %found (carplnz);
000209221006        chain
000210221006         ('0000000011' : %dec(trst:3:0) : %dec(sub:3:0) : plan : %dec(acct:4:0):
000211221006           mapvalue)
000212221006           planFile;
000214221006        if not %found (carplnl);
000215200317         cpuniq = '9000000011';
000216200317         cptrst = %dec(trst:3:0);
000217200317         cpsub# = %dec(sub:3:0);
000218200701         cpacct = %dec(acct:4:0);
000219200317         cpplan = plan;
000220200317         cpcctr = mapvalue;
000221200317
000222200317         chain
000223200701          (%dec(trst:3:0) : %dec(sub:3:0) : %dec(acct:4:0) : plan : mapmethod)
000224200317           methodSM;
000225200317          if not %found;
000226200317           ae1trs = %dec(trst:3:0);
000227200317            ae1sub = %dec(sub:3:0);
000228200701             ae1acc = %dec(acct:4:0);
000229200317             ae1pln = plan;
000230200317            ae1map = mapmethod;
000231200317           write methodSM;
000232200317          endif;
000233200317
000234200317          cpcid1 = covtype;
000235201208          if covtype = 'MED';
000236201208           cpcid1 = 'MEA';
000237201208          endif;
000238201208
000239200325          cpcid2 = %editc(%dec(elr:3:0):'X');
000240200325          cpcid3 = %editc(%dec(suffix:3:0):'X');
000241200325          cpcid4 = %editc(%dec(account:5:0):'X');
000242200325          cpcid5 = %editc(%dec(planid:3:0):'X');
000243200325          cpcid6 = %editc(%dec(claimoff:3:0):'X');
000244200317          write planFile;
000245200317        endif;
000246200317
000247221006        //if %found (carplnz);
000248221006        if %found (carplnl);
000249200701         //cpplan = plan;
000250200317          cpcctr = mapvalue;
000251201208
000252200317           cpcid1 = covtype;
000253201208            if covtype = 'MED';
000254201208             cpcid1 = 'MEA';
000255201208            endif;
000256201208
000257201208            cpcid2 = %editc(%dec(elr:3:0):'X');
000258200325             cpcid3 = %editc(%dec(suffix:3:0):'X');
000259200325             cpcid4 = %editc(%dec(account:5:0):'X');
000260200325            cpcid5 = %editc(%dec(planid:3:0):'X');
000261200325           cpcid6 = %editc(%dec(claimoff:3:0):'X');
000262200317          update planFile;
000263200317        endif;
000264200317
000265200317       endsr;
000266200317
000267200317      //======================================================================
000268200317      // process
000269200317      //======================================================================
000270200317
000271200317       begsr groupUpdate;
000272200317
000273200317        chain
000274200701         ('0000000011':%dec(trst:3:0):%dec(sub:3:0):%dec(acct:4:0)) acctFile;
000275200317        if %found;
000276220929         cacid5 = %editc(%dec(control#:7:0):'X');
000277220929          cacid8 = %editc(%dec(control#:7:0):'X');
000278200701           cacid7 = %editc(%dec(control#:7:0):'X');
000281220929          cacid4 = %editc(%dec(control#:7:0):'X');
000284200317         update acctFile;
000285200317        endif;
000286200317
000287200317       endsr;
000288200317
000289190401      //======================================================================
000290190401      // exit
000291190401      //======================================================================
000292190401
000293190401       begsr exit;
000294190401
000295190401        *inlr = '1';
000296190401        return;
000297190401
000298190401       endsr;
000299190401
000300190401      //======================================================================
000301190401      // init
000302190401      //======================================================================
000303190401
000304190401       begsr init;
000305190401
000306190401       endsr;
000307190401
000308190401      //======================================================================
