000100170718      *=========================================================================
000200170718     H option(*noDebugIo)
000300170718      *=========================================================================
000400170718      * AFAOVR1R - AFA Amount Override Spreadsheet
000500170718      *=========================================================================
000600170718      *  Date        Int  Description
000700170718      *  ----------  ---  ------------------------------------------------------
000800170718      *  07/18/2017  jt   Original Creation
000900170718      *=========================================================================
001000170718
001100170718     Fafaaov    if   e           k disk
001200170718
001300170718     Faccmst    if   e           k disk    ExtFile('F.ACCMST')
001400170718
001500170718     Fafaovrcsv o  a e             disk
001600010326
001700170718      *=========================================================================
001800170718
001900170718     d today           s              8  0
002000170718
002100110909     D AccountHdg      C                   '------------Account +
002200110909     D                                       Name--------------'
002300170718
002400110909     D NoteHdg         C                   '-----------------No+
002500110909     D                                      te-----------------'
002600170718
002700170718      //========================================================================
002800170718      // mainline
002900170718      //========================================================================
003000170718
003100170718       exsr init;
003200170718       exsr main;
003300170718       exsr exit;
003400170718
003500170718      //========================================================================
003600170718      // main
003700170718      //========================================================================
003800170718
003900170718       begsr main;
004000170718
004100170718        setll *loval afaaov;
004200170718        read afaaov;
004300170718
004400170718        dow not %eof;
004500170718
004600170718         exsr process;
004700170718
004800170718        read afaaov;
004900170718        enddo;
005000170718
005100170718       endsr;
005200010403
005300170718      //========================================================================
005400170718      // process
005500170718      //========================================================================
005600170718
005700170718       begsr process;
005800170718
005900170718        chain (artrst : arsub# : aracct) accmst;
006000170718        if not %found;
006100170718         acnam1 = %trim('Name not Found');
006200170718        endif;
006300170718
006400170718        wkrecord = '"' + %trim(%editc(ARTRST:'P')) + '","' +
006500170718                   %trim(%editc(ARSUB#:'P')) + '","' +
006600170718                   %trim(%editc(ARACCT:'P')) + '","' +
006700170718                   %trim(ACNAM1) + '","' +
006800170718                   %trim(%editc(AROAMT:'P')) + '","' +
006900170718                   %trim(%editc(ARWAMT:'P')) + '","' +
007000170718                   %trim(ARNOTE) + '","' +
007100170718                   %trim(%editc(ARCHDT:'P')) + '","' +
007200170718                   ARCHGU + '",';
007300170718        write afaovrsr;
007400170718
007500170718       endsr;
007600170718
007700170718      //========================================================================
007800170718      // write header
007900170718      //========================================================================
008000170718
008100170718       begsr writespTitle;
008200170718
008300170718        wkrecord = '"' + 'Trust' + '","' + 'Sub#'  + '","' +
008400170718                   'Acct'  + '","' + AccountHdg  + '","' +
008500170718                   'Override Amount'  + '","' + 'Original Amount' +
008600170718                   '","' + NoteHdg  + '","' + 'Override Entry Date'  +
008700170718                   '","' + 'Entered by User'  + '",';
008800170718        write afaovrsr;
008900170718
0090001707180320   endsr;
009100060817
009200170718      //=======================================================================
009300170718      // Exit
009400170718      //=======================================================================
009500170718
009600170718       begsr exit;
009700170718
009800170718        *inlr = '1';
009900170718        return;
010000170718
010100170718       endsr;
010200170718
010300170718      //=======================================================================
010400170718      // Init
010500170718      //=======================================================================
010600170718
010700170718       begsr init;
010800170718
010900170718        today = %dec(%date);
011000170718
011100170718        exsr writeSpTitle;
011200170718
011300170718       endsr;
011400170718
011500170718      //=======================================================================
