000100170718      *=========================================================================
000200170718     H option(*noDebugIo)
000300170718      *=========================================================================
000400170718      * AFAREP1R - AFA Remote Spreadsheet Preview Mode
000500170718      *=========================================================================
000600170718      *  Date        Int  Description
000700170718      *  ----------  ---  ------------------------------------------------------
000800170718      *  07/18/2017  jt   Original Creation
000900170718      *=========================================================================
001000170801
001100090709     FACCACH    IF   E           K Disk
001200170718
001300170718     Faccmst    if   e           k disk    ExtFile('F.ACCMST')
001400170718
001500170718     Ftrsmst    if   e           k disk    ExtFile('F.TRSMST')
001600170718
001700170731     FAFAAOV    IF   E           K Disk
001800170718
001900170718     Fafarem    o  a e             disk
002000170718
002100170718     Fafaremcsv o  a e             disk
002200170718
002300170718     Fafaerrcsv o  a e             disk
002400170718
002500170718     Fhist      o  a e           k disk    ExtFile('F.HIST')
002600170718
002700170718      *=========================================================================
002800170718
002900170718     d                 ds
003000170718     d bal                     1    108  2
003100170718     d                                     dim(12)
003200170718     d  bal1x                  1      9  2
003300170718     d  bal2x                 10     18  2
003400170718     d  bal3x                 19     27  2
003500170718     d  bal4x                 28     36  2
003600170718     d  bal5x                 37     45  2
003700170718     d  bal6x                 46     54  2
003800170718     d  bal7x                 55     63  2
003900170718     d  bal8x                 64     72  2
004000170718     d  bal9x                 73     81  2
004100170718     d  bal10x                82     90  2
004200170718     d  bal11x                91     99  2
004300170718     d  bal12x               100    108  2
004400170718
004500110214     D  ACVTDTMDY      DS
004600110214     D  ACVTDTYY               1      4  0
004700110214     D  ACVTDTMM               5      6  0
004800110214     D  ACVTDTDD               7      8  0
004900170718
005000090909     D                 DS
0051000909040125 D  TSA                    1     10  0
0052001207110125 D  AHTRST                 1      3  0
0053001207120125 D  AHSUB#                 4      6  0
0054001207110125 D  AHACCT                 7     10  0
005500170718
005600170718     D ACHFound        s              1
005700170718     d validFlag       s              1
005800170718     d trust           s              3
005900170718     d sub#            s              3
006000170718     d acct            s              4
006100170718     d prtctr          s              5  0
006200170718     d today           s              8  0
006300170718     d pullymd8        s              8  0
006400170718     d pullymd         s              6  0
006500170718     d day             s              4
006600170718     d usreffdt        s              8  0
006700170718     d totbal          s              9  2
006800170718     d ax              s              2  0
006900170718     d invtotOut       s              9  2
007000170718     d error           s             50
007100170718     D @trst           s              3
007200170718     D @subd           s              3
007300170718     D @acct           s              4
007400170718
007500170718     D                uds
007600170718     D luser                   1     10
007700170718
007800090813     D RoutMsg         C                   'Routing Number is Missing.'
007900090813     D BActMsg         C                   'Bank Account# is Missing.'
008000090813     D CSFlMsg         C                   'Checking/Savings Flag is Missing'
008100170801     D NoFdMsg         C                   'No AFA Record for Date Entered'
008200170718
008300170718     D weekDay         pr                  extpgm('DAYOFWEEK')
008400170718     D  day                           3a   const
008500170718
008600170802     d*afarem1r        pi
008700170802     d* wsedt                         8    const
008800170802     d* wsimo                         2    const
008900170802     d* wsiyy                         4    const
009000170802     d* wstrg                         1
009100170802
009200170718     d afarem1r        pi
009300170718     d  wsedt                         8    const
009400170718     d  wstrg                         1
009500170718
009600170718      //========================================================================
009700170718      // mainline
009800170718      //========================================================================
009900170718
010000170718       exsr init;
010100170718       exsr main;
010200170718       exsr exit;
010300170718
010400170718      //========================================================================
010500170718
010600170718       begsr main;
010700170718
010800170718        setll *loval accach;
010900170718        read accach;
011000170718
011100170718        dow not %eof;
011200170718
011300170718        chain ahtrst trsmst;
011400170718        validFlag = 'N';
011500170718
011600170718        if (wstrg = '1' and tscode = 'O A') or
011700170718         (wstrg = '2' and TSCODE <> 'O A');
011800170718
011900170731         IF AHTRST = 900 OR AHTRST = 825;
012000110216
012100170731         //if AHBEDT <= UsrEffDt
012200170731         // and AHBEDT <= Today
012300170731         //and (AHENDT = 0 or AHENDT > Today);
012400170731          // if AHBEDT = UsrEffDt;
012500170718           validFlag = 'Y';
012600170718           exsr process;
012700170718          ACHFound = 'Y';
012800170718         endif;
012900170718
013000170718        endif;
013100170718
013200170718        read accach;
013300170718        enddo;
013400170718
013500170718        if achFound <> 'Y' and validFlag = 'Y';
013600170718         error = %trim(nofdmsg) +  ' ' + %trim(wsedt);
013700170718         exsr sendEmail1;
013800170718        endif;
013900170718
014000170718
014100170718       endsr;
014200010403
014300170718      //========================================================================
014400170718      // process
014500170718      //========================================================================
014600170718
014700170718       begsr process;
014800170718
014900170718        if ahrout = 0;
015000170718         error = routMsg;
015100170718         exsr sendEmail1;
015200170718        endif;
015300170718
015400170718        if ahact# = ' ';
015500170718         error = bactMsg;
015600170718         exsr sendEmail1;
015700170718        endif;
015800170718
015900170718        if ahcsfl = ' ';
016000170718         error = csflMsg;
016100170718         exsr sendEmail1;
016200170718        endif;
016300170718
016400170718        prtctr = prtctr + 1;
016500080409
016600170718        exsr writeOut;
016700170718
016800170718       endsr;
016900170718
017000170718      //========================================================================
017100170718      // writeout
017200170718      //========================================================================
017300170718
017400170718       begsr writeOut;
017500170718
017600170718        clear afaremr;
017700170718
017800170718        invtotOut = totbal;
017900170718
018000170718        chain (ahtrst : ahsub# : ahacct) accmst;
018100170718
018200170718        acvtdtmdy = %char(acvtdt);
018300170718        bal1x = bal1;
018400170718        bal2x = bal2;
018500170718        bal3x = bal3;
018600170718        bal4x = bal4;
018700170718        bal5x = bal5;
018800170718        bal6x = bal6;
018900170718        bal7x = bal7;
019000170718        bal8x = bal8;
019100170718        bal9x = bal9;
019200170718        bal10x = bal10;
019300170718        bal11x = bal11;
019400170718        bal12x = bal12;
019500170718
019600170718        totbal = bal1;
019700170718        totbal = bal3 + bal4 + bal5 + bal6 + bal7 + bal8 + bal9 +
019800170718                 bal10 + bal11 + bal12;
019900170718
020000170718        ax = acvtdtmm - 1;
020100170718        if ax < 1;
020200170718         ax = 12;
020300170718        endif;
020400170718
020500170728        if totbal > 0 or totbal < 0;
020600170731         chain (ahtrst : ahsub# : ahacct) afaaov;
020700170718         if %found;
020800170718          invtotOut = aroamt;
020900170718           exsr $comnhist;
021000170718            ck#not = %editc(arwamt:'P');
021100170718             note2 = %editc(aroamt:'P');
021200170718            trcode = 'L73';
021300170718           hstrtime = %time;
021400170718          write histr;
021500170718         else;
021600170718          invtotout = totbal;
021700170718         endif;
021800170718
021900170721         wkrecord = '"' + %trim('DVZ') + '","' + %trim('CCD') + '","' +
022000170811                    %trim('GBS, INC.') + '","' + %trim('9ii1200892') + '","' +
022100170811                    %trim('GROUP BENE') + '","' +
022200170718                    %trim('4108321300DEBIT') + '","' +
022300170718                    %trim(%editc(PullYMD:'P')) + '","' +
022400170718                    %trim(ACNAM1) + '","' + %trim(%editw(AHROUT:'0         ')) +
022500170801                    '","' + %trim(AHACT#) + '","' + %trim(AHCSFL) + '","' +
022600170801                    %trim('7') + '","' + %trim(%editw(TSA:'0          ')) +
022700170718                    '","' + %trim(%editc(InvTotOut:'P')) + '","' +
022800170718                    '  ' + '",';
022900170718
023000170718         write afaremr;
023100170718
023200170718         exsr $comnhist;
023300170718
023400170718         trcode = 'L72';
023500170718         hstrtime = %time;
023600170718         write histr;
023700170718
023800170718         // Load field values to the physical file version of AFAREMCSV (AFAREM)...
023900170718         datrst = ahtrst;
024000170718         dasub# = ahsub#;
024100170718         daacct = ahacct;
024200170718         dadvz = %trim('DVZ');
024300170721         daPPD = %trim('CCD');
024400170718         dagbs = %trim('GBS,INC. ');
024500170811         da9ii = %trim('9ii1200892');
024600170811         dasrd = %trim('GROUP BENE');
024700170718         dadeb = %trim('4108321300DEBIT');
024800170718         dapul = %trim(%editc(PullYMD:'P'));
024900170718         daacn = %trim(ACNAM1);
025000170718         darou = %trim(%editw(AHROUT:'0         '));
025100170718         daact = %trim(AHACT#);
025200170718         dacsf = %trim(AHCSFL);
025300170718         da7 = %trim('7');
025400170718         datsa = %trim(%editw(TSA:'0          '));
025500170718         datot = InvtotOut;
025600170718         dablk = ' ';
025700170718
025800170718         write afaremxr;
025900170718
026000170718         clear afaremxr;
026100170718        endif;
026200170718
026300170718        clear afaremr;
026400170718
026500170718       endsr;
026600170718
026700170718      //=======================================================================
026800170718      // send email
026900170718      //=======================================================================
027000170718
027100170718       begsr sendEmail1;
027200170718
027300170718        trust = %char(actrst);
027400170718        sub# = %char(ahsub#);
027500170718        acct = %char(ahacct);
027600170718
027700170718        wkerror = '"' + %Trim(trust) + '","' +
027800170718                  %Trim(Sub#) + '","' + %Trim(Acct) + '","' +
027900170718                  %Trim(Acct) + '","' + %Trim(Error) + '",' ;
028000170718
028100170718        write afaerrsr;
028200170718
028300170718       endsr;
028400170718
028500170718      //=======================================================================
028600170718      //
028700170718      //=======================================================================
028800170718
028900170718       begsr $comnhist;
029000170718
029100170718        clear histr;
029200170718
029300170718        @trst = %editc(ahtrst:'X');
029400170718        @subd = %editc(ahsub#:'X');
029500170718        @acct = %editc(ahacct:'X');
029600170718
029700170718        hkey = %trim(@trst) + %trim(@subd) + %trim(@acct);
029800170718        trmflg = ' ';
029900170718        trlflg = ' ';
030000170718        hdseq# = 0;
030100170718        hprgnm = 'AFAREM1R';
030200170718        hstrst = ahtrst;
030300170718        hssub# = ahsub#;
030400170718        hsacct = ahacct;
030500170718        hoper = luser;
030600170718        hsdltd = 'A';
030700170718        trdate = %dec(%date);
030800170718
030900170718       endsr;
031000170718
031100170718      //=======================================================================
031200170718      // Exit
031300170718      //=======================================================================
031400170718
031500170718       begsr exit;
031600170718
031700170718        *inlr = '1';
031800170718        return;
031900170718
032000170718       endsr;
032100170718
032200170718      //=======================================================================
032300170718      // Init
032400170718      //=======================================================================
032500170718
032600170718       begsr init;
032700170718
032800170718        today = %dec(%date);
032900170718
033000170718        weekday(day);
033100170718
033200170718        select;
033300170718
033400170718         when day = '*SAT';
033500170718          pullymd8 = %dec(%date + %days(2));
033600170718
033700170718         when day = '*FRI';
033800170718          pullymd8 = %dec(%date + %days(3));
033900170718
034000170718         other;
034100170718          pullymd8 = %dec(%date + %days(1));
034200170718
034300170718        endsl;
034400170718
034500170718        pullymd = %dec(%subst(%char(pullymd8):3:6):6:0);
034600170718
034700170718        usreffdt = %dec( %char( %date(wsedt:*usa0):*iso0):8:0);
034800170718
034900170718       endsr;
035000170718
035100170718      //=======================================================================
