000100170711      *=========================================================================
000200170711     H option(*noDebugIo)
000300170711      *=========================================================================
000400170713      * AFAREP1R - AFA Remote Spreadsheet Preview Mode
000500170711      *=========================================================================
000600170711      *  Date        Int  Description
000700170711      *  ----------  ---  ------------------------------------------------------
000800170711      *  07/11/2017  jt   Original Creation
000900170711      *=========================================================================
001000170711
001100090709     FACCACH    IF   E           K Disk
001200170801
001300170801     Finvsum    if   e           k disk    ExtFile('F.INVSUM')
001400170801     F                                     rename(invsmr:invFile)
001500170711
001600170801     Faccmst    if   e           k disk    ExtFile('F.ACCMST')
001700170801
001800170714     Ftrsmst    if   e           k disk    ExtFile('F.TRSMST')
001900170711
002000170801     Fafarem    o    e             disk    rename(afaremxr:remoteFile)
002100170711
002200170801     Fafaremcsv o    e             disk    rename(afaremr:csvFile)
002300170711
002400170801     Fafaerrcsv o    e             disk    rename(afaerrsr:errorFile)
002500170711
002600170802     Fafaaov    uf a e           k disk    rename(afaaovr:overFile)
002700170801
002800170711      *=========================================================================
002900170711
003000170802     D acvtdtmdy       ds
003100170802     D  acvtdtyy               1      4  0
003200170802     D  acvtdtmm               5      6  0
003300170802     D  acvtdtdd               7      8  0
003400170711
003500170802     D                 ds
003600170802     D tsa                     1     10  0
003700170802     D  ahtrst                 1      3  0
003800170802     D  ahsub#                 4      6  0
003900170802     D  ahacct                 7     10  0
004000061017
004100170802     d afaFound        s              1
004200170711     d prtctr          s              5  0
004300170711     d validFlag       s              1
004400170712     d trust           s              3
004500170712     d sub#            s              3
004600170712     d acct            s              4
004700170713     d today           s              8  0
004800170713     d pullymd8        s              8  0
004900170713     d pullymd         s              6  0
005000170713     d day             s              4
005100170713     d usreffdt        s              8  0
005200170713     d totbal          s              9  2
005300170713     d ax              s              2  0
005400170713     d error           s             50
005500170711
005600090813     D RoutMsg         C                   'Routing Number is Missing.'
005700090813     D BActMsg         C                   'Bank Account# is Missing.'
005800090813     D CSFlMsg         C                   'Checking/Savings Flag is Missing'
005900170713     D NoFdMsg         C                   'No ACH Record for Date Entered:'
006000170711
006100170807     D sds            sds
006200170807     D  user                 254    263
006300170807
006400170713     D weekDay         pr                  extpgm('DAYOFWEEK')
006500170713     D  day                           3a   const
006600170713
006700170801     d*afarep1r        pi
006800170801     d* wsedt                         8    const
006900170801     d* wsimo                         2    const
007000170801     d* wsiyy                         4    const
007100170801     d* wstrg                         1
007200170713
007300170801     d afarep1r        pi
007400170801     d  wsedt                         8    const
007500170801     d  wstrg                         1
007600170801
007700170711      //========================================================================
007800170711      // mainline
007900170711      //========================================================================
008000170711
008100170711       exsr init;
008200170711       exsr main;
008300170711       exsr exit;
008400170711
008500170711      //========================================================================
008600170711      // main
008700170711      //========================================================================
008800170711
008900170711       begsr main;
009000170711
009100170711        setll *loval accach;
009200170711        read accach;
009300170711
009400170711        dow not %eof;
009500170711
009600170711        chain ahtrst trsmst;
009700170711        validFlag = 'N';
009800170711
009900171102         if (wstrg = '1' and tscode = 'O A') or
010000171102          (wstrg = '2' and TSCODE <> 'O A');
010100171102
010200171102          chain (ahtrst : ahsub# : ahacct : usreffdt : 'KEB') invFile;
010300171102          if %found;
010400171102
010500171102           if invcdt = usreffdt;
010600171102            validFlag = 'Y';
010700171102             exsr process;
010800171102            afaFound = 'Y';
010900171102           endif;
011000170712
011100171102          else;
011200171102           validFlag = 'N';
011300171102           afaFound = 'N';
011400171102          endif;
011500171102
011600171102         endif;
011700170711
011800170711        read accach;
011900170711        enddo;
012000170711
012100170802        if afaFound <> 'Y' and validFlag = 'Y';
012200170713         error = %trim(nofdmsg) +  ' ' + %trim(wsedt);
012300170711         exsr sendEmail1;
012400170711        endif;
012500170711
012600170711       endsr;
012700170711
012800170711      //========================================================================
012900170711      // process
013000170711      //========================================================================
013100170711
013200170711       begsr process;
013300170711
013400171102        error = ' ';
013500171102
013600171201        if ahendt > 0;
013700171201         if usreffdt > ahendt;
013800171201          error = 'Do not select';
013900171201          leavesr;
014000171201         endif;
014100171201        endif;
014200171102
014300171102        if ahbedt = ahendt;
014400171102         error = 'Begin/End dates are the same';
014500171102         exsr sendEmail1;
014600171102        endif;
014700171102
014800170711        if ahrout = 0;
014900170711         error = routMsg;
015000170711         exsr sendEmail1;
015100170711        endif;
015200170711
015300170711        if ahact# = ' ';
015400170711         error = bactMsg;
015500170711         exsr sendEmail1;
015600170711        endif;
015700170711
015800170711        if ahcsfl = ' ';
015900170711         error = csflMsg;
016000170711         exsr sendEmail1;
016100170711        endif;
016200170711
016300170711        prtctr = prtctr + 1;
016400080409
016500171102        if error = ' ';
016600171102         exsr writeOut;
016700171102        endif;
016800170711
016900170711       endsr;
017000170711
017100170712      //========================================================================
017200170712      // writeout
017300170712      //========================================================================
017400170712
017500170712       begsr writeOut;
017600170712
017700170801        clear csvFile;
017800170712
017900170801        chain (ahtrst : ahsub# : ahacct) accmsr;
018000170713
018100170801        acvtdtmdy = %char(invcdt);
018200170713
018300170801        totbal = inendb;
018400170801
018500170713        ax = acvtdtmm - 1;
018600170712
018700170713        if ax < 1;
018800170713         ax = 12;
018900170713        endif;
019000091029
019100170728        if totbal > 0 or totbal < 0;
019200170713
019300170721         wkrecord = '"' + %trim('DVZ') + '","' + %trim('CCD') + '","' +
019400170811                    %trim('GBS, INC.') + '","' + %trim('9ii1200892') + '","' +
019500170811                    %trim('GROUP BENE') + '","' +
019600170713                    %trim('4108321300DEBIT') + '","' +
019700170713                    %trim(%editc(PullYMD:'P')) + '","' +
019800170713                    %trim(ACNAM1) + '","' + %trim(%editw(AHROUT:'0         ')) +
019900170718                    '","' + %trim(AHACT#) + '","' + '","' + %trim(AHCSFL) +
020000170718                    '","' + %trim('7') + '","' +
020100170718                    %trim(%editw(TSA:'0          ')) +
020200170801                    '","' + %trim(%editc(totbal:'P')) + '","' +
020300170713                    '  ' + '",';
020400171102         write csvFile;
020500170712
020600170714         // Load field values to the physical file version of AFAREMCSV (AFAREM)...
020700170801         clear remoteFile;
020800170801
020900170713         datrst = ahtrst;
021000170713         dasub# = ahsub#;
021100170713         daacct = ahacct;
021200170713         dadvz = %trim('DVZ');
021300170721         daPPD = %trim('CCD');
021400170713         dagbs = %trim('GBS,INC. ');
021500170811         da9ii = %trim('9ii1200892');
021600170811         dasrd = %trim('GROUP BENE');
021700170713         dadeb = %trim('4108321300DEBIT');
021800170713         dapul = %trim(%editc(PullYMD:'P'));
021900170713         daacn = %trim(ACNAM1);
022000170713         darou = %trim(%editw(AHROUT:'0         '));
022100170713         daact = %trim(AHACT#);
022200170713         dacsf = %trim(AHCSFL);
022300170713         da7 = %trim('7');
022400170713         datsa = %trim(%editw(TSA:'0          '));
022500170801         datot = inendb;
022600170713         dablk = ' ';
022700170712
022800171102         write remoteFile;
022900170801
023000170802         chain (ahtrst : ahsub# : ahacct) overFile;
023100170802         exsr moveFields;
023200170802         if %found;
023300171102          update overFile;
023400170802         else;
023500170807          //clear overFile;
023600171102          write overFile;
023700170802         endif;
023800170801
023900171204         unlock afaaov;
024000171204
024100170712        endif;
024200170712
024300170712       endsr;
024400170712
024500170712      //=======================================================================
024600170712      // send email
024700170712      //=======================================================================
024800170712
024900170712       begsr sendEmail1;
025000170712
025100170801        clear errorFile;
025200170801
025300170712        trust = %char(actrst);
025400170712        sub# = %char(ahsub#);
025500170712        acct = %char(ahacct);
025600170712
025700170712        wkerror = '"' + %Trim(trust) + '","' +
025800170712                  %Trim(Sub#) + '","' + %Trim(Acct) + '","' +
025900170712                  %Trim(Acct) + '","' + %Trim(Error) + '",' ;
026000170712
026100171102        write errorFile;
026200170712
026300170712       endsr;
026400060817
026500170802      //=======================================================================
026600170802      // move fields
026700170802      //=======================================================================
026800170802
026900170802       begsr moveFields;
027000170802
027100170802        artrst = ahtrst;
027200170802        arsub# = ahsub#;
027300170802        aracct = ahacct;
027400170802        artsa = %trim(%editw(TSA:'0          '));
027500170802        arwamt = inendb;
027600170802        aroamt = inendb;
027700170807        archdt = %dec(%date);
027800170807        archgu = user;
027900170802
028000170802       endsr;
028100170802
028200170711      //=======================================================================
028300170711      // Exit
028400170711      //=======================================================================
028500170711
028600170711       begsr exit;
028700170711
028800170711        *inlr = '1';
028900170711        return;
029000170711
029100170711       endsr;
029200170711
029300170711      //=======================================================================
029400170711      // Init
029500170711      //=======================================================================
029600170711
029700170711       begsr init;
029800170711
029900170713        today = %dec(%date);
030000170712
030100170713        weekday(day);
030200170712
030300170713        select;
030400170713
030500170713         when day = '*SAT';
030600170713          pullymd8 = %dec(%date + %days(2));
030700170712
030800170713         when day = '*FRI';
030900170713          pullymd8 = %dec(%date + %days(3));
031000170713
031100170713         other;
031200170713          pullymd8 = %dec(%date + %days(1));
031300170713
031400170713        endsl;
031500170713
031600170713        pullymd = %dec(%subst(%char(pullymd8):3:6):6:0);
031700170711
031800170713        usreffdt = %dec( %char( %date(wsedt:*usa0):*iso0):8:0);
031900170713
032000170711       endsr;
032100170711
032200170711      //=======================================================================
