000100171211     H option(*noDebugIo)  DftActGrp(*no)
000200160928      *-------------------------------------------------------------------------
000300160928      *
000400230403      *  Description: Make First History
000500230216      *  Programmer.: Jon Allen
000600230403      *  Date.......: 04/03/2023
000700160928      *
000800170322      *
000900160928      *-------------------------------------------------------------------------
001000160928      * Modifications
001100160928      *
001200160928      * Date         Programmer    Mod      Description
001300160928      *-------------------------------------------------------------------------
001400160928      *
001500220209      *
001600160928      *-------------------------------------------------------------------------
001700230403     FAMW0070D  CF   E             WORKSTN
001800160928     F                                     HANDLER('PROFOUNDUI(HANDLER)')
001900160928     F                                     SFILE(LSTSFL:rrn)
002000160928     F
002100230403     fAMW0071LF uf   e           k disk
002200230403     fAMW0006L1 if   e           k disk
002300230403     fAMW0007P  if   e           k disk
002400161005
002500160218      *--------------------------------------------------------------------
002600161223     d PGMD          ESDS                  EXTNAME(IOPGMD)
002700161227     D  @pgmq            *proc
002800161223
002900230403     d BTNADDNEW       s               n
003000230403     d BTNCLOSE        s               n
003100230403     d BTNEDIT         s               n
003200161222     d HasError        s               n
003300161222     d ReLoad          s              1
003400161222     d rrn             s              5s 0
003500161222
003600180315
003700180315      *-------------------------------------------------------------------------
003800180315      *
003900180315      * Procedures
004000180315      *
004100180315      *-------------------------------------------------------------------------
004200230217       dcl-s oCancel Char(1);
004300230217       dcl-s w80date zoned(8);
004400230217       dcl-s s2NewStat Char(1);
004500171211
004600180315
004700161005      *-------------------------------------------------------------------------
004800160928      *?Mainline Program
004900161005      *-------------------------------------------------------------------------
005000171212     C     *entry        plist
005100171212     C                   parm                    pKey             10
005200171212     C                   parm                    s1ActNam         40
005300171212
005400161222       Reload = 'Y';
005500230216
005600230403       A7TRUST = %dec(%subst(pkey:1:3):3:0);
005700230403       A7SUBNO = %dec(%subst(pkey:4:3):3:0);
005800230403       A7ACCTN = %dec(%subst(pkey:7:4):4:0);
005900230216
006000171212       s1Key = pKey;
006100171212       s1Account = %Subst(pKey : 1 : 3) + '-' +
006200171212                   %Subst(pKey : 4 : 3) + '-' +
006300171212                   %Subst(pKey : 7 : 4);
006400171212
006500230403          chain (A7TRUST:A7SUBNO:A7ACCTN) AMW0006L1;
006600230403          if  not %found(AMW0006L1);
006700230403          clear  A6OPENED;
006800230403          clear  A6CLOSED;
006900230403          clear  wsOPENED;
007000230403          clear  wsCLOSED;
007100230403          else;
007200230403         if a6opened <> 0;
007300230403         wsopened = %Char(%Date(a6opened:*iso):*Usa);
007400230403         endif;
007500230403         if a6closed <> 0;
007600230403         wsclosed = %Char(%Date(a6closed:*iso):*Usa);
007700230403         else;
007800230403         wsclosed = '99/99/9999';
007900230403         endif;
008000230403          endif;
008100171212
008200171212
008300161223       dou btnExit = *on;
008400160928
008500161223          if Reload = 'Y';
008600161222             exsr ClearS1;
008700161222             exsr LoadS1;
008800161005             Reload = 'N';
008900161223          endif;
009000160928
009100161223          exsr DisplyS1;
009200160928
009300161223          if btnExit = *on;
009400161223             leave;
009500161223          endif;
009600161223
009700161223
009800161223          Select;
009900161223
010000161223          when  btnAddNew = *on;
010100161223             Clear AddScreen;
010200161223             ReLoad = 'Y';
010300161223             exsr $AddRecord;
010400161223
010500161223          other;
010600161223             exsr ReadChanged;
010700161223
010800161223          endsl;
010900161223
011000161223       enddo;
011100160928
011200161223       *inlr = *on;
011300160928
011400160928      *-------------------------------------------------------------------------
011500161222       Begsr ClearS1;
011600160928
011700161223          //?Clear the Subfile
011800171211          ClrSfl = *on;
011900161223          Write LstCtl;
012000171211          ClrSfl = *off;
012100160928
012200161223          rrn = 0;
012300160928
012400160928       Endsr;
012500160928      *-------------------------------------------------------------------------
012600161222       Begsr DisplyS1;
012700160928
012800161223          exfmt  LstCtl ;
012900160928
013000160928       Endsr;
013100160928      *-------------------------------------------------------------------------
013200161222       Begsr LoadS1;
013300161005
013400161223          //----------------------------------------------------
013500171211          //?Load the Subfile.
013600161223          //----------------------------------------------------
013700230403          Setll (A7TRUST:A7SUBNO:A7ACCTN:A6OPENED) AMW0071LF;
013800230403          dou %Eof(AMW0071LF);
013900230403             reade(n) (A6TRUST:A6SUBNO:A6ACCTN:A6OPENED) AMW0071LF;
014000161005
014100230403             if %Eof(AMW0071LF);
014200161223                leave;
014300161223             endif;
014400161222
014500171212             s1Account = %Subst(s1Key : 1 : 3) + '-' +
014600171212                         %Subst(s1Key : 4 : 3) + '-' +
014700171212                         %Subst(s1Key : 7 : 4);
014800230403
014900230403         if a7adddate <> 0;
015000230403         wsadddate = %Char(%Date(a7adddate:*iso):*Usa);
015100230403         endif;
015200230403         if a7addtime <> 0;
015300230403         wsaddtime = %Char(%Time(a7addtime) :*usa);
015400230403         endif;
015500171211
015600161223             rrn = rrn + 1;
015700161223             write LstSfl;
015800161223
015900161223          enddo;
016000230403
016100230403          chain (A7TRUST:A7SUBNO:A7ACCTN) AMW0007P;
016200230403          if  %found(AMW0007P);
016300230403
016400230403         if a7adddate <> 0;
016500230403         wsadddate = %Char(%Date(a7adddate:*iso):*Usa);
016600230403         endif;
016700230403         if a7addtime <> 0;
016800230403         wsaddtime = %Char(%Time(a7addtime) :*usa);
016900230403         endif;
017000230403
017100230403             rrn = rrn + 1;
017200230403             write LstSfl;
017300230403          endif;
017400230403
017500161005
017600161222       Endsr;
017700161223
017800161223      *-------------------------------------------------------------------------
017900161223       Begsr $AddRecord;
018000171212
018100161223          dou btnCancel = *on;
018200161223
018300161223             exfmt AddScreen;
018400161223
018500180315             if btnSearch = *on;
018600180315                btnSearch = *off;
018700180315             EndIf;
018800180315
018900180315
019000180315             exsr Validate;
019100180315             if hasError = *on;
019200180315                iter;
019300180315             EndIf;
019400180315
019500180315
019600161223             if btnAccept = *on;
019700171211
019800230217           //   write R_AMW0006R;
019900161223                leave;
020000161223
020100161223             EndIf;
020200161223
020300161223
020400161223          EndDo;
020500161223
020600161223
020700161223       EndSr;
020800161223
020900230227      *-------------------------------------------------------------------------
021000230227       Begsr $CloseRecord;
021100230227
021200230227
021300230227       EndSr;
021400230227
021500161223      *-------------------------------------------------------------------------
021600161223       Begsr LoadData;
021700161223
021800171211          Clear EditScreen;
021900161223
022000161223       Endsr;
022100161223      *-------------------------------------------------------------------------
022200161223       Begsr $EditRecord;
022300161223
022400161223          exsr LoadData;
022500161223
022600161223          dou btnCancel = *on;
022700161223
022800161223             exfmt EditScreen;
022900161223
023000161223             if btnAccept = *on;
023100171212
023200230217                Reload = 'Y';
023300161223                leave;
023400161223
023500161223             EndIf;
023600161223
023700161223
023800161223          EndDo;
023900161223
024000161223
024100161223       EndSr;
024200161007      *-------------------------------------------------------------------------
024300161007       Begsr Validate;
024400161007
024500161223          hasError = *off;
024600171213          errEmail = *off;
024700171213
024800161007       endsr;
024900161223
025000161223      *-------------------------------------------------------------------------
025100161223       Begsr ReadChanged;
025200161223
025300161223          Dou *in95 = *ON;
025400161223             READC LstSfl;
025500161223             *in95 = %EOF;
025600161223
025700161223             If *in95 = *OFF;
025800161223
025900161223                If btnEdit = *on;
026000161223                   exsr $EditRecord;
026100161223                endIf;
026200161223
026300161223
026400230227                If btnClose = *on;
026500230227                   exsr $CloseRecord;
026600230227                endIf;
026700161223
026800161223
026900230227                btnClose = *off;
027000161223                btnEdit = *off;
027100161223                update LstSfl;
027200161223
027300161223                Reload = 'Y';
027400161223             endIf;
027500161223
027600161223
027700161223          enddo;
027800161223       Endsr;
027900161223
