000100170711      *=========================================================================
000200170711     H option(*noDebugIo)
000300170711      *=========================================================================
000400180426      * AMWELLETR - Advanced Mobile welcome letter
000500170711      *=========================================================================
000600170711      *  Date        Int  Description
000700170711      *  ----------  ---  ------------------------------------------------------
000800180426      *  04/26/2018  jt   Original Creation
000900170711      *=========================================================================
001000170810
001100180426     finvsum    if   e           k disk    ExtFile('F.INVSUM')
001200180426     f                                     rename(invsmr:invFile)
001300180426
001400180426     ftrsmst    if   e           k disk    ExtFile('F.TRSMST')
001500180426     f                                     rename(trsmsr:trustFile)
001600180426
001700180426     faccmst    if   e           k disk    ExtFile('F.ACCMST')
001800180426     f                                     rename(accmsr:actmstFile)
001900180517
002000180517     faccmsp    if   e           k disk    rename(accmspr:miscFile)
002100180517
002200180426     fhistaa    if   e           k disk    ExtFile('F.HISTAA')
002300180426     f                                     rename(histr:histFile)
002400180426
002500180426     famwellet  o    e             disk    rename(amwelr:welFile)
002600170810
002700170711      *=========================================================================
002800061017
002900180426     d startDate       s              8  0
003000180426     d endDate         s              8  0
003100180426     d histkey         s             10
003200180426     d SrDenAdvMob     s              3
003300180426     d fmtDate         s               d   datfmt(*usa)
003400180426     d totalAmount     s              8  2
003500180426     d remainingBal    s              8  2
003600180426     d proceed         s              1
003700180904     d writeRec        s              1
003800180426
003900180426     d amwelletr       pi
004000180426     d  type                          1    const
004100180426
004200170711      //========================================================================
004300170711      // mainline
004400170711      //========================================================================
004500170711
004600170711       exsr init;
004700170711       exsr main;
004800170711       exsr exit;
004900170711
005000170711      //========================================================================
005100170711      // main
005200170711      //========================================================================
005300170711
005400170711       begsr main;
005500170711
005600180426        setll *loval actmstFile;
005700180426        read actmstFile;
005800180426
005900180426        dow not %eof;
006000180426
006100180426         chain actrst trustFile;
006200180426         if %found;
006300180426
006400180426          if tscode = SrDenAdvMob;
006500180426
006600180426           if enroll >= startDate;
006700180426             clear totalAmount;
006800180426             exsr process;
006900180426
007000180426             if proceed = 'Y';
007100180426              exsr compare;
007200180904
007300180904              if writeRec = 'Y';
007400180904               exsr writeRecord;
007500180904              endif;
007600180904
007700180426             endif;
007800180426
007900180426           endif;
008000180426
008100180426          endif;
008200180426
008300180426         endif;
008400180426
008500180426        read actmstFile;
008600180426        enddo;
008700180426
008800180426       endsr;
008900170711
009000170711      //========================================================================
009100170711      // process
009200170711      //========================================================================
009300170711
009400170711       begsr process;
009500180426
009600180426        proceed = 'Y';
009700180426        if enroll = atrmdt;
009800180426         proceed = 'N';
009900180426         leavesr;
010000180426        endif;
010100180426
010200180426        histKey = %editc(actrst:'X') + %editc(acsub#:'X') + %editc(acacct:'X');
010300180426
010400180426        setll (histkey : 'BMP') histFile;
010500180426        reade (histkey : 'BMP') histFile;
010600180426
010700180426         proceed = 'N';
010800180426         dow not %eof;
010900180426
011000180515          if cm$flg > ' ';
011100180426           proceed = 'Y';
011200180426           exsr addAmounts;
011300180426          endif;
011400180426
011500180426        reade (histkey : 'BMP') histFile;
011600180426        enddo;
011700180426
011800170711       endsr;
011900170711
012000180426      //=======================================================================
012100180426      // add amounts
012200180426      //=======================================================================
012300180426
012400180426       begsr addAmounts;
012500180426
012600180426        totalAmount = totalAmount + tramt;
012700180426
012800180426       endsr;
012900180426
013000180426      //=======================================================================
013100180426      // compare
013200180426      //=======================================================================
013300180426
013400180426       begsr compare;
013500180426
013600180904        writeRec = 'Y';
013700180904
013800180426        setll (actrst : acsub# : acacct) invFile;
013900180426        reade (actrst : acsub# : acacct) invFile;
014000180426
014100180426        dow not %eof;
014200180426         if inrc = 'KEB';
014300180426          leave;
014400180426         endif;
014500180426        reade (actrst : acsub# : acacct) invFile;
014600180426        enddo;
014700180426
014800180904        if totalAmount = 0;
014900180904         writeRec = 'N';
015000180904         leavesr;
015100180904        endif;
015200180904
015300180426        remainingBal = inendb / totalAmount;
015400180426
015500180426       endsr;
015600180426
015700180426      //=======================================================================
015800180426      // write record
015900180426      //=======================================================================
016000180426
016100180426       begsr writeRecord;
016200180426
016300180426        clear welFile;
016400180426
016500180426        amtsa = %editc(actrst:'X') + '-' + %editc(acsub#:'X') + '-' +
016600180426                %editc(acacct:'X');
016700180426
016800180426        amacname = acnam1;
016900180427
017000180427        amasphfl = asphfl;
017100180426
017200180426        aminitinv = inendb;
017300180426        ampaidamt = totalAmount * -1;
017400180426
017500180426        fmtDate = %date(trdate:*iso);
017600180426        amtrdate = %char(fmtDate);
017700180426
017800180426        fmtDate = %date(enroll:*iso);
017900180426        ameffdate = %char(fmtDate);
018000180426
018100180426        fmtDate = %date(recvdt:*iso);
018200180426        amdatepay = %char(fmtDate);
018300180426
018400180517        chain (actrst : acsub# : acacct) miscFile;
018500180517        if %found;
018600180517         ammedicaid = ammaid;
018700180517        endif;
018800180517
018900180426        write welFile;
019000180426
019100180426       endsr;
019200180426
019300170711      //=======================================================================
019400170711      // Exit
019500170711      //=======================================================================
019600170711
019700170711       begsr exit;
019800170711
019900170711        *inlr = '1';
020000170711        return;
020100170711
020200170711       endsr;
020300170711
020400170711      //=======================================================================
020500170711      // Init
020600170711      //=======================================================================
020700170711
020800170711       begsr init;
020900170712
021000180426        startDate = 20171024;
021100180426        //endDate = 20180320;
021200180426
021300180426        select;
021400180426         when type = 'S';
021500180426          SrDenAdvMob = 'O N';
021600180426         when type = 'M';
021700180426          SrDenAdvMob = 'O M';
021800180426         when type = 'A';
021900180426          SrDenAdvMob = 'O A';
022000180426        endsl;
022100180426
022200170711       endsr;
022300170711
022400170711      //=======================================================================
