000100160311      *========================================================================
000200180308     h option(*noDebugIo)
000300160311      *========================================================================
000400180308      * CARRSCAN4 - Principal scan report.
000500180308      *========================================================================
000600180308      * Date         Int  Description
000700180308      * ---------    ---  -----------------------------------------------------
000800180308      * 03/05/2018   jt   Copied from CARSCAN2
000900180308      *========================================================================
001000180306
001100120517     FACMUNIQUE IF   E           K DISK
001200180308
001300120517     FCOMCTUNIQ IF   E           K DISK
001400180308
001500120517     FPLNUNIQUE IF   E           K DISK
001600180308
001700120517     FCARUNIQUE IF   E           K DISK
001800180308
001900120517     FMCOVAPSE  IF   E           K DISK
002000180308
002100120517     FCARPTRKP  UF A E           K DISK
002200180308
002300120517     FGRATEINQ  IF   E           K DISK
002400180308
002500120719     FCARRSCANAAIF   E           K DISK
002600160311
002700120517     FT500      O  A F  500        DISK
002800180306
002900180306      *=========================================================================
003000180306
003100180306     d x               s            500
003200180306     d a               s              1
003300180306     d #3              s              3  0
003400180306     d #c              s              9  0
003500180306     d @g              s             15
003600180306     d #fr             s              8  0
003700180306     d #to             s              8  0
003800180306     d @msg            s            100
003900180306     d @chgs           s            300
004000180308     d holdStatus      s              1
004100180306
004200180309     d h_trst          s              3  0
004300180309     d h_sub#          s              3  0
004400180309     d h_acct          s              4  0
004500180309     d h_plan          s              4
004600160509
004700180309       //=======================================================================
004800180306       // mainline
004900180306       //=======================================================================
005000180306
005100180306       exsr init;
005200180306       exsr main;
005300180306       exsr exit;
005400180306
005500180306       //=======================================================================
005600180306       // main
005700180306       //=======================================================================
005800180306
005900180306       begsr main;
006000180306
006100180306        dou a = 'X';
006200180306
006300180306        select;
006400180306         when a = '1';
006500180306          exsr $1;
006600180306         when a = '2';
006700180306          exsr $2;
006800180306         when a = '3';
006900180306          exsr $3;
007000180306        endsl;
007100180306
007200180306       enddo;
007300180306
007400180306       endsr;
007500180306
007600180306       //=======================================================================
007700180306       // $1
007800180306       //=======================================================================
007900180306
008000180306       begsr $1;
008100180306
008200180306        a = '2';
008300180306
008400180306       endsr;
008500180306
008600180306       //=======================================================================
008700180306       // $2
008800180306       //=======================================================================
008900180306
009000180306       begsr $2;
009100180306
009200180306        read accmsr;
009300180306        if %eof;
009400180306         a = 'X';
009500180306         leavesr;
009600180306        endif;
009700180306
009800180306        if atrmdt <> 0;
009900180306         leavesr;
010000180306        endif;
010100180306
010200180306        chain (actrst : acsub# : acacct) comcxr;
010300180306        if not %found;
010400180306         leavesr;
010500180306        endif;
010600180306
010700180306        setll (actrst : acsub# : acacct) comcxr;
010800180306        a = '3';
010900180306
011000180306       endsr;
011100180306
011200180306       //=======================================================================
011300180306       // $3
011400180306       //=======================================================================
011500180306
011600180306       begsr $3;
011700180306
011800180306        reade (actrst : acsub# : acacct) comcxr;
011900180306        if %eof;
012000180306         a = '2';
012100180306         leavesr;
012200180306        endif;
012300180306
012400180306        if cmcan <> 0;
012500180306         leavesr;
012600180306        endif;
012700180306
012800180306        if h_trst <> actrst or
012900180306         h_sub# <> acsub# or
013000180306          h_acct <> acacct or
013100180306           h_plan <> cmplan;
013200180306            h_trst = actrst;
013300180306           h_sub# = acsub#;
013400180306          h_acct = acacct;
013500180306         h_plan = cmplan;
013600180306        else;
013700180306         leavesr;
013800180306        endif;
013900180306
014000180306        chain (cmtrst : csubdv : cmplan) plnmsr;
014100180306        if not %found;
014200180306         leavesr;
014300180306        endif;
014400180306
014500180306        chain pcarr carmsr;
014600180306        if not %found;
014700180306         leavesr;
014800180306        endif;
014900180306
015000210210        if carrcd <> 'PFL' and carrcd <> 'PFR' and carrcd <> 'PRD'
015100210210           and carrcd <> 'PRL' and carrcd <> 'PVL';
015200180306         leavesr;
015300180306        endif;
015400180306
015500180306        @chgs = ' ';
015600180306        @msg = ' ';
015700180306
015800180306        exsr $rate;
015900180306
016000180306        exsr $count;
016100180306
016200180306        chain (actrst : acsub# : acacct : cmplan) fcrt;
016300180306        if %found;
016400180306         exsr $chkit;
016500180306        else;
016600180306         exsr $makeit;
016700180306        endif;
016800180306
016900180306       endsr;
017000180306
017100180306       //=======================================================================
017200180306       // $chkit
017300180306       //=======================================================================
017400180306
017500180306       begsr $chkit;
017600180306
017700180306        if fcgrp <> @g;
017800180306         @msg = 'GROUP # CHANGED';
017900180306         exsr $ad2chgs;
018000180306        endif;
018100180306
018200180306        if #fr <> fcrfr;
018300180306         @msg = 'NEW RATES ADDED';
018400180306         exsr $ad2chgs;
018500180306        endif;
018600180306
018700180306        if #fr = fcrfr and #To <> fcrto;
018800180306         @msg = 'RATES EXTENDED';
018900180306         exsr $ad2chgs;
019000180306        endif;
019100180306
019200180306        if pdescr <> fcdesc;
019300180306         @msg = 'PLAN DESC CHANGED';
019400180306         exsr $ad2chgs;
019500180306        endif;
019600180306
019700180306        if @chgs <> ' ';
019800180306         fcgrp = @g;
019900180306          fcrfr = #fr;
020000180306           fcrto = #to;
020100180306           fcdesc = pdescr;
020200210608          update fcrt;
020300180309         //exsr $printit;
020400180306        endif;
020500180306
020600180306       endsr;
020700180306
020800180306       //=======================================================================
020900180306       // $ad2chgs
021000180306       //=======================================================================
021100180306
021200180306       begsr $ad2chgs;
021300180306
021400180306        #3 = 0;
021500180306        #3 = %len(@chgs);
021600180306
021700180306        if #3 = 0;
021800180306         @chgs = %trim(@msg);
021900180306         leavesr;
022000180306        endif;
022100180306
022200180306        if @chgs = ' ';
022300180306         @chgs = %trim(@msg);
022400180306        else;
022500180306         @chgs = %trim(@chgs) + '; ' + %TRIM(@msg);
022600180306        endif;
022700180306
022800180306       endsr;
022900180306
023000180306       //=======================================================================
023100180306       // $makeit
023200180306       //=======================================================================
023300180306
023400180306       begsr $makeit;
023500180306
023600180306        clear fcrt;
023700180306
023800180306        fctrs = actrst;
023900180306        fcsub = acsub#;
024000180306        fcacc = acacct;
024100180306        fcpln = cmplan;
024200180306        fcgrp = @g;
024300180306        fcrfr = #fr;
024400180306        fcrto = #to;
024500180306
024600180306        write fcrt;
024700180306
024800180309        if acdltd = 'A';
024900180309         @msg = 'NEW ACCOUNT HAS BEEN ADDED';
025000180309        else;
025100180309         @msg = 'ACCOUNT HAS BEEN CANCELED';
025200180309        endif;
025300180306        exsr $ad2chgs;
025400180306
025500180306        exsr $printit;
025600180306
025700180306       endsr;
025800160311
025900160311       //=======================================================================
026000180306       // $count
026100180306       //=======================================================================
026200160311
026300180306       begsr $count;
026400180306
026500180306        #c = 0;
026600180306
026700180306        chain (actrst : acsub# : acacct : cmplan) fcrt;
026800180306        if not %found;
026900180306         leavesr;
027000180306        endif;
027100180306
027200180306        setll (actrst : acsub# : acacct : cmplan) fcrt;
027300180306        dou %eof;
027400180306        reade (actrst : acsub# : acacct : cmplan) fcrt;
027500180306        if not %found and candt = 0;
027600180306         #c = #c + 1;
027700180306        endif;
027800180306
027900180306        enddo;
028000180306
028100180306       endsr;
028200180306
028300180306       //=======================================================================
028400180306       // $rate
028500180306       //=======================================================================
028600180306
028700180306       begsr $rate;
028800180306
028900180306        #fr = 0;
029000180306        #to = 0;
029100180306        @g = ' ';
029200180306
029300180306        chain (cmtrst : csubdv : cmplan) grater;
029400180306        if not %found;
029500180306         leavesr;
029600180306        endif;
029700180306
029800180306        setgt (cmtrst : csubdv : cmplan) grater;
029900180306        readpe (cmtrst : csubdv : cmplan) grater;
030000180306        #fr = frmdat;
030100180306        #to = todat;
030200180306        @g = group#;
030300180306
030400180306       endsr;
030500180306
030600180306       //=======================================================================
030700180306       // $printit
030800180306       //=======================================================================
030900180306
031000180306       begsr $printit;
031100180306
031200180306        chain aacode aacodr;
031300180306
031400180306        x  = '"' + %char(fctrs) + '","' + %char(fcsub) + '","' + %char(fcacc) +
031500180306              '","' + %trim(acnam1) + '","' + fcpln + '","' +  %trim(pdescr) +
031600180306             '","' + %editw(fcrfr:'    /  /  ') + '","' +
031700180306             %editw(fcrto:'    /  /  ') + '","' + pcarr + '","' +
031800180306             %trim(cname) + '","' + %trim(fcgrp) + '","' + %char(#c) + '","' +
031900180306             %trim(@chgs) + '","' + %trim(afnam) + ' ' + %trim(alnam) + '"';
032000180306
032100180306        except outf;
032200180306
032300180306       endsr;
032400180306
032500180306       //=======================================================================
032600180306       // exit
032700180306       //=======================================================================
032800180306
032900180306       begsr exit;
033000180306
033100180306        *inlr = '1';
033200180306        return;
033300180306
033400180306       endsr;
033500180306
033600180306       //=======================================================================
033700180306       // init
033800180306       //=======================================================================
033900180306
034000180306       begsr init;
034100180306
034200180306        a = '1';
034300180306
034400180306        x = '"TRUST","SUB","ACCT","ACCT NAME","PLAN","PLAN NAME","RATE FROM", +
034500180306            "RATE TO","CARR CODE","CARR NAME","GROUP NBR","LIVES","NOTES", +
034600180306            "AA CODE"';
034700180306        except outf;
034800180308
034900180306       endsr;
035000180306
035100180306       //=======================================================================
035200180306
035300120517     OT500      EADD         OUTF
035400120517     O                       X              B   500
