000100130412   X***X CARRIER ACCOUNTS THAT TERMED IN FULLY INSURED AND MAY POTENTIALLY
000200130412   X***X     BE TERMED IN GAS.
000300130412   X***X
000400130412   X***X SSK 04/12/2013
000500130412   X***X
000600130412   X***X
000700130412   X***X
000800130412   X***X
000900130412   X***X
001000130412      *
001100130121     FACMUNIQUE IF   E           K DISK
001200130412      *
001300130412     FT200      O  A F  200        DISK
001400120517      *
001500130412   X***X
001600130412    ***
001700130412     D X               S            200A
001800130412    ***
001900130412     D TSA             S             10A
002000130412    ***
002100130412     D                 DS
002200130412     D TSA@                    1     10A
002300130412     D #T                      1      3S 0
002400130412     D #S                      4      6S 0
002500130412     D #A                      7     10S 0
002600130412    ***
002700111005   X***X
002800130412    ***
002900130412     C     *ENTRY        PLIST
003000130412     C                   PARM                    TSA
003100130412     C                   EVAL      TSA@ = TSA
003200130412    ***
003300130412     C     KL#           KLIST
003400130412     C                   KFLD                    #T
003500130412     C                   KFLD                    #S
003600130412     C                   KFLD                    #A
003700130412    ***
003800130412     C     KL#           CHAIN     ACCMSR
003900130412    ***
004000130412     C
004100130412    ***
004200130412   X***X
004300130412     OT200      EADD         OUTF
004400130412     O                       X              B   200
