000100130412   X***X CARRIER ACCOUNTS THAT ARE PROSPECTIVE GAS ACCOUNTS REPORT
000200130412   X***X     AND SET UP ACCOUNT SHELL.
000300130412   X***X
000400130412   X***X SSK 04/12/2013
000500130412   X***X
000600130412   X***X
000700130412   X***X
000800130412   X***X
000900130412   X***X
001000130412      *
001100130121     FACMUNIQUE IF   E           K DISK
001200130412      *
001300130412     FAC2MSTL2  IF   E           K DISK
001400130412      *
001500130412      *
001600130412     FT2000     O  A F 2000        DISK
001700120517      *
001800111005   X***X
001900120517   S***S
002000130121     OCSAD2RPT  EADD         OUTF
002100120517     O                       X              B   500
