000100130412   X***X PRINT EXTRACTED REPORTS
000200130412   X***X
000300130412   X***X SSK 04/12/2013
000400130412   X***X
000500130412   X***X
000600130412   X***X
000700130412   X***X
000800130412   X***X
000900130412      *
001000130412     FCARRSHLWF IF   E           K DISK
001100130412     FCARRTRMWF IF   E           K DISK
001200130412     FCARRREIWF IF   E           K DISK
001300130412      *
001400130412     FT2000     O  A F 2000        DISK
001500130412     FCARRSGAPRFO    E             PRINTER OFLIND(*IN99)
001600120517      *
001700111005   X***X
001800130121     OCSAD2RPT  EADD         OUTF
001900120517     O                       X              B   500
002000130412   X***X
