000100120619     **
000200120619     **
000300120619     *** MEDICAL
000400120619     **
000500120619     D DS@MEDICAL      DS
000600120619     D  MED@DS                 1    150A
000700120619     D  MEACNU               001    007A
000800120619     D  MEBRCO               008    013A
000900120619     D  MEBEOP               014    018A
001000120619     D  MEEFFD               019    026A
001100120619     D  METRMD               027    034A
001200120619     D  MEMEMBER             035    035A
001300120619     D  MESPOUSE             036    036A
001400120619     D  MECHILD              037    037A
001500120619     D  F900                 038    039A
001600120619     D  MECBREF              040    047A
001700120619     D  MECBRTR              048    055A
001800120619     D  F901                 056    069A
001900120619     D  MEHMOCOD             070    072A
002000120619     D  MENETID              073    077A
002100120619     D  MEPCPID              078    087A
002200120619     D  MEPI                 088    088A
002300120619     D  MEPHNED              089    096A
002400120619     D  MEPCLED              097    104A
002500120619     D  F902                 105    150A
002600120619     **
002700120619     *** DENTAL
002800120619     **
002900120619     D DS@DENTAL       DS
003000120619     D  DEN@DS                 1    150A
003100120619     D  DNACNU               001    007A
003200120619     D  DNBRCO               008    013A
003300120619     D  DNBEOP               014    018A
003400120619     D  DNEFFD               019    026A
003500120619     D  DNTRMD               027    034A
003600120619     D  DNMEMBER             035    035A
003700120619     D  DNSPOUSE             036    036A
003800120619     D  DNCHILD              037    037A
003900120619     D  F903                 038    039A
004000120619     D  DNCBREF              040    047A
004100120619     D  DNCBRTR              048    055A
004200120619     D  F904                 056    069A
004300120619     D  DNOFFID              070    075A
004400120619     D  F905                 076    081A
004500120619     D  DNOFNED              082    089A
004600120619     D  DNESTPI              090    090A
004700120619     D  F906                 091    150A
004800120619     **
004900120619     *** VISION
005000120619     **
005100120619     D DS@VISION       DS
005200120619     D  VIS@DS                 1    150A
005300120619     D  VSACNU               001    007A
005400120619     D  VSBRCO               008    013A
005500120619     D  VSBEOP               014    018A
005600120619     D  VSEFFD               019    026A
005700120619     D  VSTRMD               027    034A
005800120619     D  VSMEMBER             035    035A
005900120619     D  VSSPOUSE             036    036A
006000120619     D  VSCHILD              037    037A
006100120619     D  F907                 038    039A
006200120619     D  VSCBREF              040    047A
006300120619     D  VSCBRTR              048    055A
006400120619     D  F908                 056    150A
006500120619     **
006600120619     *** PHARMACY
006700120619     **
006800120619     D DS@DRUG         DS
006900120619     D  RXD@DS                 1    150A
007000120619     D  RXACNU               001    007A
007100120619     D  RXBRCO               008    013A
007200120619     D  RXBEOP               014    018A
007300120619     D  RXEFFD               019    026A
007400120619     D  RXTRMD               027    034A
007500120619     D  RXMEMBER             035    035A
007600120619     D  RXSPOUSE             036    036A
007700120619     D  RXCHILD              037    037A
007800120619     D  F907                 038    039A
007900120619     D  RXCBREF              040    047A
008000120619     D  RXCBRTR              048    055A
008100120619     D  F908                 056    150A
008200120619     **
008300120619     **
