000100120622     FCGNW011   UPE  F  750        DISK
000200120622     ICGNW011   AA
000300120622     C                   EXCEPT    F1
000400120622     OCGNW011   E            F1
000500120622     O                                          600 '         '
