000100120622     FCGNW010   IF   E           K DISK    PREFIX(N:1)
000200120622     FCGNW011   O  A F  750        DISK
000300120622     F*GNW014   O  A F  900        DISK
000400120622     F*GNW015   O  A F 1050        DISK
000500120622     F*GNW016   O  A F 1200        DISK
000600120622   X***X
000700120622     D @750            S            750A
000800120622     D @900            S            900A
000900120622     D @1050           S           1050A
001000120622     D @1200           S           1200A
001100120622     D LOAD@         E DS                  EXTNAME(CGNW010) PREFIX(N:1)
001200120622    ***
001300120622     D NO              S               N   INZ(*OFF)
001400120622     D YES             S               N   INZ(*ON)
001500120622     D EMP_CNL         S               N
001600120622     D EMP_I           S               N
001700120622     D SPS_I           S               N
001800120622     D CHD_I           S               N
001900120622     D MBR#EFF         S              8S 0
002000120622     D MBR#TRM         S              8S 0
002100120622    ***
002200120622     D DK@           E DS                  EXTNAME(CGNW010) OCCURS(60)
002300120622     D @DCED                 619    626S 0                                      EFFD
002400120622     D @DCCD                 627    634S 0                                      TRMD
002500120622     D @DECI                 635    635A                                        MEMBER
002600120622     D @DSDPCI               636    636A                                        SPOUSE
002700120622     D @DCCI                 637    637A                                        CHILD
002800120622     D @COLLAT               638    638A
002900120622     D @DCOBRAF              640    647S 0
003000120622     D @DCOBRAT              648    655S 0
003100120622     D DK@1          E DS                  EXTNAME(CGNW010) OCCURS(60)
003200120622     D  S1EFFD              0619   0626A
003300120622     D  S1TRMD              0627   0634A
003400120622     D  S1MEMBER            0635   0635A
003500120622     D  S1SPOUSE            0636   0636A
003600120622     D  S1CHILD             0637   0637A
003700120622     D DK@2          E DS                  EXTNAME(CGNW010) OCCURS(60)
003800120622     D  S1EFFD              0619   0626A
003900120622     D  S1TRMD              0627   0634A
004000120622     D  S1MEMBER            0635   0635A
004100120622     D  S1SPOUSE            0636   0636A
004200120622     D  S1CHILD             0637   0637A
004300120622     D  S2EFFD              0769   0776A
004400120622     D  S2TRMD              0777   0784A
004500120622     D  S2MEMBER            0785   0785A
004600120622     D  S2SPOUSE            0786   0786A
004700120622     D  S2CHILD             0787   0787A
004800120622     D DK@3          E DS                  EXTNAME(CGNW010) OCCURS(60)
004900120622     D  S1EFFD              0619   0626A
005000120622     D  S1TRMD              0627   0634A
005100120622     D  S1MEMBER            0635   0635A
005200120622     D  S1SPOUSE            0636   0636A
005300120622     D  S1CHILD             0637   0637A
005400120622     D  S2EFFD              0769   0776A
005500120622     D  S2TRMD              0777   0784A
005600120622     D  S2MEMBER            0785   0785A
005700120622     D  S2SPOUSE            0786   0786A
005800120622     D  S2CHILD             0787   0787A
005900120622     D  S3EFFD              0919   0926A
006000120622     D  S3TRMD              0927   0934A
006100120622     D  S3MEMBER            0935   0935A
006200120622     D  S3SPOUSE            0936   0936A
006300120622     D  S3CHILD             0937   0937A
006400120622     D DK@4          E DS                  EXTNAME(CGNW010) OCCURS(60)
006500120622     D  S1EFFD              0619   0626A
006600120622     D  S1TRMD              0627   0634A
006700120622     D  S1MEMBER            0635   0635A
006800120622     D  S1SPOUSE            0636   0636A
006900120622     D  S1CHILD             0637   0637A
007000120622     D  S2EFFD              0769   0776A
007100120622     D  S2TRMD              0777   0784A
007200120622     D  S2MEMBER            0785   0785A
007300120622     D  S2SPOUSE            0786   0786A
007400120622     D  S2CHILD             0787   0787A
007500120622     D  S3EFFD              0919   0926A
007600120622     D  S3TRMD              0927   0934A
007700120622     D  S3MEMBER            0935   0935A
007800120622     D  S3SPOUSE            0936   0936A
007900120622     D  S3CHILD             0937   0937A
008000120622     D  S4EFFD              1069   1076A
008100120622     D  S4TRMD              1077   1084A
008200120622     D  S4MEMBER            1085   1085A
008300120622     D  S4SPOUSE            1086   1086A
008400120622     D  S4CHILD             1087   1087A
008500120622    ***
008600120622    *** MIX AND MATCH STRUCTURES BELOW WITH THE SEGMENTS USED IN CGNW010
008700120622    *** SPECIFIC POSITIONS MUST BE KNOWN PRIOR TO DOING THIS PROGRAM
008800120622    ***
008900120622    *** ALL STRUCTURES FOR ALL FOUR POSITIONS ARE LOCATED AT THE BOTTOM
009000120622    *** OF THIS SOURCE MEMBER
009100120622     **
009200120622     **
009300120622    ***
009400120622    ***
009500120622   X***X
009600120622     C                   EXSR      $CLEAR
009700120622    ***
009800120622     C                   DOU       %EOF(CGNW010)
009900120622     C                   READ      CGNF010
010000120622     C                   IF        NOT %EOF(CGNW010)
010100120622    * *
010200120622     C                   IF        H@SSN = *BLANKS
010300120622     C                   MOVEL     N1SSN1        H@SSN
010400120622     C                   ENDIF
010500120622    * *
010600120622     C                   IF        N1SSN1 <> H@SSN
010700120622     C                   EXSR      $PROC
010800120622     C                   MOVEL     N1SSN1        H@SSN             9
010900120622     C                   ENDIF
011000120622    * *
011100120622     C                   EXSR      $LOAD
011200120622    * *
011300120622     C                   ENDIF
011400120622     C                   ENDDO
011500120622    ***
011600120622     C                   EXSR      $PROC
011700120622    ***
011800120622     C                   EVAL      *INLR = *ON
011900120622   S***S
012000120622     C     $LOAD         BEGSR
012100120622    ***
012200120622     C                   ADD       1             #CNE              3 0
012300120622     C     #CNE          OCCUR     DK@
012400120622     C                   EVAL      DK@ = LOAD@
012500120622    ***
012600120622     C                   IF        @DECI = 'Y'
012700120622     C                   EVAL      EMP_I = YES
012800120622     C                   EVAL      MBR#EFF = @DCED
012900120622     C                   EVAL      MBR#TRM = @DCCD
013000120622     C                   ENDIF
013100120622    ***
013200120622     C                   IF        @DSDPCI = 'Y'
013300120622     C                   EVAL      SPS_I = YES
013400120622     C                   ADD       1             #RSC              3 0
013500120622     C                   ENDIF
013600120622    ***
013700120622     C                   IF        @DCCI = 'Y'
013800120622     C                   EVAL      CHD_I = YES
013900120622     C                   ADD       1             #RCC              3 0
014000120622     C                   ENDIF
014100120622    ***
014200120622     C                   EVAL      @COLLAT = 'N'
014300120622    ***
014400120622     C                   ENDSR
014500120622   S***S
014600120622     C     $PROC         BEGSR
014700120622    ***
014800120622     C                   IF        #CNE = 1
014900120622     C                   EVAL      @DSDPCI = 'N'
015000120622     C                   EVAL      @DCCI = 'N'
015100120622     C                   EXSR      $WRITE
015200120622     C                   EXSR      $CLEAR
015300120622     C                   LEAVESR
015400120622     C                   ENDIF
015500120622    ***
015600120622     C                   MOVE      *ZEROS        #NDX              3 0
015700120622     C                   DO        #CNE
015800120622    * *
015900120622     C                   ADD       1             #NDX
016000120622     C     #NDX          OCCUR     DK@
016100120622    * *
016200120622     C                   IF        EMP_I = YES
016300120622     C                   EVAL      @DECI = 'Y'
016400120622     C                   ELSE
016500120622     C                   EVAL      @DECI = 'N'
016600120622     C                   ENDIF
016700120622    * *
016800120622     C                   IF        SPS_I = YES
016900120622     C                   EVAL      @DSDPCI = 'Y'
017000120622     C                   ELSE
017100120622     C                   EVAL      @DSDPCI = 'N'
017200120622     C                   ENDIF
017300120622    * *
017400120622     C                   IF        CHD_I = YES
017500120622     C                   EVAL      @DCCI = 'Y'
017600120622     C                   ELSE
017700120622     C                   EVAL      @DCCI = 'N'
017800120622     C                   ENDIF
017900120622    * *
018000120622     C                   IF        @DCCD = 0
018100120622     C                   IF        @DCED < MBR#EFF
018200120622     C                   EVAL      @DCED = MBR#EFF
018300120622     C                   ENDIF
018400120622     C                   ELSE
018500120622     C                   IF        MBR#TRM <> 0
018600120622     C                   EVAL      @DCCD = MBR#TRM
018700120622     C                   ENDIF
018800120622     C                   ENDIF
018900120622    * *
019000120622     C                   ENDDO
019100120622    ***
019200120622     C                   MOVE      *ZEROS        #NDX
019300120622     C                   DO        #CNE
019400120622    * *
019500120622     C                   ADD       1             #NDX
019600120622     C     #NDX          OCCUR     DK@
019700120622    * *
019800120622     C                   EXSR      $WRITE
019900120622    * *
020000120622     C                   ENDDO
020100120622    * *
020200120622     C                   EXSR      $CLEAR
020300120622    ***
020400120622     C                   ENDSR
020500120622   S***S
020600120622     C     $WRITE        BEGSR
020700120622    ***
020800120622     C                   EVAL      @750 = DK@
020900120622    ***
021000120622     C                   EVAL      %SUBST(@750:593:8) = *BLANKS
021100120622    ***
021200120622     C                   IF        %SUBST(@750:72:9) = '000000000'
021300120622     C                   EVAL      %SUBST(@750:72:9) = *BLANKS
021400120622     C                   ENDIF
021500120622    ***
021600120622     C                   IF        %SUBST(@750:627:8) = '00000000'
021700120622     C                   EVAL      %SUBST(@750:627:8) = *BLANKS
021800120622     C                   ENDIF
021900120622    ***
022000120622     C                   IF        %SUBST(@750:648:8) = '00000000' OR
022100120622     C                             %SUBST(@750:648:8) = '99999999'
022200120622     C                   EVAL      %SUBST(@750:648:8) = *BLANKS
022300120622     C                   ENDIF
022400120622    ***
022500120622     C                   EXCEPT    OUTF
022600120622    ***
022700120622     C                   ENDSR
022800120622   S***S
022900120622     C     $CLEAR        BEGSR
023000120622    ***
023100120622     C                   MOVE      *ZEROS        #NDX
023200120622     C                   MOVE      *ZEROS        #CNE
023300120622    ***
023400120622     C                   DO        60
023500120622     C                   ADD       1             #NDX
023600120622     C     #NDX          OCCUR     DK@
023700120622     C                   CLEAR                   DK@
023800120622     C                   ENDDO
023900120622    ***
024000120622     C                   MOVE      *ZEROS        MBR#EFF
024100120622     C                   MOVE      *ZEROS        #TCC              3 0
024200120622     C                   MOVE      *ZEROS        #TSC              3 0
024300120622     C                   MOVE      *ZEROS        #RCC              3 0
024400120622     C                   MOVE      *ZEROS        #RSC              3 0
024500120622     C                   EVAL      EMP_CNL = NO
024600120622     C                   EVAL      EMP_I = NO
024700120622     C                   EVAL      SPS_I = NO
024800120622     C                   EVAL      CHD_I = NO
024900120622    ***
025000120622     C                   ENDSR
025100120622   S***S
025200120622     OCGNW011   EADD         OUTF
025300120622     O                       @750           B   750
025400120622     O*GNW014   EADD         OUTF
025500120622     O*                      @900           B   900
025600120622     O*GNW015   EADD         OUTF
025700120622     O*                      @1050          B  1050
025800120622     O*GNW016   EADD         OUTF
025900120622     O*                      @1200          B  1200
026000120622   X***X
026100120622   X***X
026200120622   X***X
026300120622   X***X
026400120622   X***X
026500120622   X***X
026600120622   X***X
026700120622   X***X
026800120622   X***X
026900120622     **
027000120622     *** MEDICAL SEGMENT 1
027100120622     **
027200120622     **
027300120622     D DS@W010         DS
027400120622     D  W010@DS                1   9999A
027500120622     D  MEACNU              0601   0607A
027600120622     D  MEBRCO              0608   0613A
027700120622     D  MEBEOP              0614   0618A
027800120622     D  MEEFFD              0619   0626A
027900120622     D  METRMD              0627   0634A
028000120622     D  MEMEMBER            0635   0635A
028100120622     D  MESPOUSE            0636   0636A
028200120622     D  MECHILD             0637   0637A
028300120622     D  F900                0638   0639A
028400120622     D  MECBREF             0640   0647A
028500120622     D  MECBRTR             0648   0655A
028600120622     D  F901                0656   0669A
028700120622     D  MEHMOCOD            0670   0672A
028800120622     D  MENETID             0673   0677A
028900120622     D  MEPCPID             0678   0687A
029000120622     D  MEPI                0688   0688A
029100120622     D  MEPHNED             0689   0696A
029200120622     D  MEPCLED             0697   0704A
029300120622     D  F902                0705   0750A
029400120622     **
029500120622     *** MEDICAL SEGMENT 2
029600120622     **
029700120622     **
029800120622     D DS@W010         DS
029900120622     D  W010@DS                1   9999A
030000120622     D  MEACNU              0751   0757A
030100120622     D  MEBRCO              0758   0763A
030200120622     D  MEBEOP              0764   0768A
030300120622     D  MEEFFD              0769   0776A
030400120622     D  METRMD              0777   0784A
030500120622     D  MEMEMBER            0785   0785A
030600120622     D  MESPOUSE            0786   0786A
030700120622     D  MECHILD             0787   0787A
030800120622     D  F900                0788   0789A
030900120622     D  MECBREF             0790   0797A
031000120622     D  MECBRTR             0798   0805A
031100120622     D  F901                0806   0819A
031200120622     D  MEHMOCOD            0820   0822A
031300120622     D  MENETID             0823   0827A
031400120622     D  MEPCPID             0828   0837A
031500120622     D  MEPI                0838   0838A
031600120622     D  MEPHNED             0839   0846A
031700120622     D  MEPCLED             0847   0854A
031800120622     D  F902                0855   0900A
031900120622     **
032000120622     *** MEDICAL SEGMENT 3
032100120622     **
032200120622     **
032300120622     D DS@W010         DS
032400120622     D  W010@DS                1   9999A
032500120622     D  MEACNU              0901   0907A
032600120622     D  MEBRCO              0908   0913A
032700120622     D  MEBEOP              0914   0918A
032800120622     D  MEEFFD              0919   0926A
032900120622     D  METRMD              0927   0934A
033000120622     D  MEMEMBER            0935   0935A
033100120622     D  MESPOUSE            0936   0936A
033200120622     D  MECHILD             0937   0937A
033300120622     D  F900                0938   0939A
033400120622     D  MECBREF             0940   0947A
033500120622     D  MECBRTR             0948   0955A
033600120622     D  F901                0956   0969A
033700120622     D  MEHMOCOD            0970   0972A
033800120622     D  MENETID             0973   0977A
033900120622     D  MEPCPID             0978   0987A
034000120622     D  MEPI                0988   0988A
034100120622     D  MEPHNED             0989   0996A
034200120622     D  MEPCLED             0997   1004A
034300120622     D  F902                1005   1050A
034400120622     **
034500120622     *** MEDICAL SEGMENT 4
034600120622     **
034700120622     **
034800120622     D DS@W010         DS
034900120622     D  W010@DS                1   9999A
035000120622     D  MEACNU              1051   1057A
035100120622     D  MEBRCO              1058   1063A
035200120622     D  MEBEOP              1064   1068A
035300120622     D  MEEFFD              1069   1076A
035400120622     D  METRMD              1077   1084A
035500120622     D  MEMEMBER            1085   1085A
035600120622     D  MESPOUSE            1086   1086A
035700120622     D  MECHILD             1087   1087A
035800120622     D  F900                1088   1089A
035900120622     D  MECBREF             1090   1097A
036000120622     D  MECBRTR             1098   1105A
036100120622     D  F901                1106   1119A
036200120622     D  MEHMOCOD            1120   1122A
036300120622     D  MENETID             1123   1127A
036400120622     D  MEPCPID             1128   1137A
036500120622     D  MEPI                1138   1138A
036600120622     D  MEPHNED             1139   1146A
036700120622     D  MEPCLED             1147   1154A
036800120622     D  F902                1155   1200A
036900120622     **
037000120622     *** DENTAL SEGMENT 1
037100120622     **
037200120622     **
037300120622     D DS@W010         DS
037400120622     D  W010@DS                1   9999A
037500120622     D  DNACNU              0601   0607A
037600120622     D  DNBRCO              0608   0613A
037700120622     D  DNBEOP              0614   0618A
037800120622     D  DNEFFD              0619   0626A
037900120622     D  DNTRMD              0627   0634A
038000120622     D  DNMEMBER            0635   0635A
038100120622     D  DNSPOUSE            0636   0636A
038200120622     D  DNCHILD             0637   0637A
038300120622     D  F903                0638   0639A
038400120622     D  DNCBREF             0640   0647A
038500120622     D  DNCBRTR             0648   0655A
038600120622     D  F904                0656   0669A
038700120622     D  DNOFFID             0670   0675A
038800120622     D  F905                0676   0681A
038900120622     D  DNOFNED             0682   0689A
039000120622     D  DNESTPI             0690   0690A
039100120622     D  F906                0691   0750A
039200120622     **
039300120622     *** DENTAL SEGMENT 2
039400120622     **
039500120622     **
039600120622     D DS@W010         DS
039700120622     D  W010@DS                1   9999A
039800120622     D  DNACNU              0751   0757A
039900120622     D  DNBRCO              0758   0763A
040000120622     D  DNBEOP              0764   0768A
040100120622     D  DNEFFD              0769   0776A
040200120622     D  DNTRMD              0777   0784A
040300120622     D  DNMEMBER            0785   0785A
040400120622     D  DNSPOUSE            0786   0786A
040500120622     D  DNCHILD             0787   0787A
040600120622     D  F903                0788   0789A
040700120622     D  DNCBREF             0790   0797A
040800120622     D  DNCBRTR             0798   0805A
040900120622     D  F904                0806   0819A
041000120622     D  DNOFFID             0820   0825A
041100120622     D  F905                0826   0831A
041200120622     D  DNOFNED             0832   0839A
041300120622     D  DNESTPI             0840   0840A
041400120622     D  F906                0841   0900A
041500120622     **
041600120622     *** DENTAL SEGMENT 3
041700120622     **
041800120622     **
041900120622     D DS@W010         DS
042000120622     D  W010@DS                1   9999A
042100120622     D  DNACNU              0901   0907A
042200120622     D  DNBRCO              0908   0913A
042300120622     D  DNBEOP              0914   0918A
042400120622     D  DNEFFD              0919   0926A
042500120622     D  DNTRMD              0927   0934A
042600120622     D  DNMEMBER            0935   0935A
042700120622     D  DNSPOUSE            0936   0936A
042800120622     D  DNCHILD             0937   0937A
042900120622     D  F903                0938   0939A
043000120622     D  DNCBREF             0940   0947A
043100120622     D  DNCBRTR             0948   0955A
043200120622     D  F904                0956   0969A
043300120622     D  DNOFFID             0970   0975A
043400120622     D  F905                0976   0981A
043500120622     D  DNOFNED             0982   0989A
043600120622     D  DNESTPI             0990   0990A
043700120622     D  F906                0991   1050A
043800120622     **
043900120622     *** DENTAL SEGMENT 4
044000120622     **
044100120622     **
044200120622     D DS@W010         DS
044300120622     D  W010@DS                1   9999A
044400120622     D  DNACNU              1051   1057A
044500120622     D  DNBRCO              1058   1063A
044600120622     D  DNBEOP              1064   1068A
044700120622     D  DNEFFD              1069   1076A
044800120622     D  DNTRMD              1077   1084A
044900120622     D  DNMEMBER            1085   1085A
045000120622     D  DNSPOUSE            1086   1086A
045100120622     D  DNCHILD             1087   1087A
045200120622     D  F903                1088   1089A
045300120622     D  DNCBREF             1090   1097A
045400120622     D  DNCBRTR             1098   1105A
045500120622     D  F904                1106   1119A
045600120622     D  DNOFFID             1120   1125A
045700120622     D  F905                1126   1131A
045800120622     D  DNOFNED             1132   1139A
045900120622     D  DNESTPI             1140   1140A
046000120622     D  F906                1141   1200A
046100120622     **
046200120622     *** VISION SEGMENT 1
046300120622     **
046400120622     **
046500120622     D DS@W010         DS
046600120622     D  W010@DS                1   9999A
046700120622     D  VSACNU              0601   0607A
046800120622     D  VSBRCO              0608   0613A
046900120622     D  VSBEOP              0614   0618A
047000120622     D  VSEFFD              0619   0626A
047100120622     D  VSTRMD              0627   0634A
047200120622     D  VSMEMBER            0635   0635A
047300120622     D  VSSPOUSE            0636   0636A
047400120622     D  VSCHILD             0637   0637A
047500120622     D  F907                0638   0639A
047600120622     D  VSCBREF             0640   0647A
047700120622     D  VSCBRTR             0648   0655A
047800120622     D  F908                0656   0750A
047900120622     **
048000120622     *** VISION SEGMENT 2
048100120622     **
048200120622     D DS@W010         DS
048300120622     D  W010@DS                1   9999A
048400120622     D  VSACNU              0751   0757A
048500120622     D  VSBRCO              0758   0763A
048600120622     D  VSBEOP              0764   0768A
048700120622     D  VSEFFD              0769   0776A
048800120622     D  VSTRMD              0777   0784A
048900120622     D  VSMEMBER            0785   0785A
049000120622     D  VSSPOUSE            0786   0786A
049100120622     D  VSCHILD             0787   0787A
049200120622     D  F907                0788   0789A
049300120622     D  VSCBREF             0790   0797A
049400120622     D  VSCBRTR             0798   0805A
049500120622     D  F908                0806   0900A
049600120622     **
049700120622     **
049800120622     *** VISION SEGMENT 3
049900120622     **
050000120622     D DS@W010         DS
050100120622     D  W010@DS                1   9999A
050200120622     D  VSACNU              0901   0907A
050300120622     D  VSBRCO              0908   0913A
050400120622     D  VSBEOP              0914   0918A
050500120622     D  VSEFFD              0919   0926A
050600120622     D  VSTRMD              0927   0934A
050700120622     D  VSMEMBER            0935   0935A
050800120622     D  VSSPOUSE            0936   0936A
050900120622     D  VSCHILD             0937   0937A
051000120622     D  F907                0938   0939A
051100120622     D  VSCBREF             0940   0947A
051200120622     D  VSCBRTR             0948   0955A
051300120622     D  F908                0956   1050A
051400120622     **
051500120622     **
051600120622     *** VISION SEGMENT 4
051700120622     **
051800120622     **
051900120622     D DS@W010         DS
052000120622     D  W010@DS                1   9999A
052100120622     D  VSACNU              1051   1057A
052200120622     D  VSBRCO              1058   1063A
052300120622     D  VSBEOP              1064   1068A
052400120622     D  VSEFFD              1069   1076A
052500120622     D  VSTRMD              1077   1084A
052600120622     D  VSMEMBER            1085   1085A
052700120622     D  VSSPOUSE            1086   1086A
052800120622     D  VSCHILD             1087   1087A
052900120622     D  F907                1088   1089A
053000120622     D  VSCBREF             1090   1097A
053100120622     D  VSCBRTR             1098   1105A
053200120622     D  F908                1106   1200A
053300120622     **
053400120622     *** DRUG SEGMENT 1
053500120622     **
053600120622     **
053700120622     D DS@W010         DS
053800120622     D  W010@DS                1   9999A
053900120622     D  RXACNU              0601   0607A
054000120622     D  RXBRCO              0608   0613A
054100120622     D  RXBEOP              0614   0618A
054200120622     D  RXEFFD              0619   0626A
054300120622     D  RXTRMD              0627   0634A
054400120622     D  RXMEMBER            0635   0635A
054500120622     D  RXSPOUSE            0636   0636A
054600120622     D  RXCHILD             0637   0637A
054700120622     D  F907                0638   0639A
054800120622     D  RXCBREF             0640   0647A
054900120622     D  RXCBRTR             0648   0655A
055000120622     D  F908                0656   0750A
055100120622     **
055200120622     *** DRUG SEGMENT 2
055300120622     **
055400120622     **
055500120622     D DS@W010         DS
055600120622     D  W010@DS                1   9999A
055700120622     D  RXACNU              0751   0757A
055800120622     D  RXBRCO              0758   0763A
055900120622     D  RXBEOP              0764   0768A
056000120622     D  RXEFFD              0769   0776A
056100120622     D  RXTRMD              0777   0784A
056200120622     D  RXMEMBER            0785   0785A
056300120622     D  RXSPOUSE            0786   0786A
056400120622     D  RXCHILD             0787   0787A
056500120622     D  F907                0788   0789A
056600120622     D  RXCBREF             0790   0797A
056700120622     D  RXCBRTR             0798   0805A
056800120622     D  F908                0806   0900A
056900120622     **
057000120622     *** DRUG SEGMENT 3
057100120622     **
057200120622     **
057300120622     D DS@W010         DS
057400120622     D  W010@DS                1   9999A
057500120622     D  RXACNU              0901   0907A
057600120622     D  RXBRCO              0908   0913A
057700120622     D  RXBEOP              0914   0918A
057800120622     D  RXEFFD              0919   0926A
057900120622     D  RXTRMD              0927   0934A
058000120622     D  RXMEMBER            0935   0935A
058100120622     D  RXSPOUSE            0936   0936A
058200120622     D  RXCHILD             0937   0937A
058300120622     D  F907                0938   0939A
058400120622     D  RXCBREF             0940   0947A
058500120622     D  RXCBRTR             0948   0955A
058600120622     D  F908                0956   1050A
058700120622     **
058800120622     *** DRUG SEGMENT 4
058900120622     **
059000120622     **
059100120622     D DS@W010         DS
059200120622     D  W010@DS                1   9999A
059300120622     D  RXACNU              1051   1057A
059400120622     D  RXBRCO              1058   1063A
059500120622     D  RXBEOP              1064   1068A
059600120622     D  RXEFFD              1069   1076A
059700120622     D  RXTRMD              1077   1084A
059800120622     D  RXMEMBER            1085   1085A
059900120622     D  RXSPOUSE            1086   1086A
060000120622     D  RXCHILD             1087   1087A
060100120622     D  F907                1088   1089A
060200120622     D  RXCBREF             1090   1097A
060300120622     D  RXCBRTR             1098   1105A
060400120622     D  F908                1106   1200A
