000100120622     FCGNW016   UPE  F 1200        DISK
000200120622     ICGNW016   AA
000300120622     C                   EXCEPT    F1
000400120622     OCGNW016   E            F1
000500120622     O                                          600 '         '
