000100120622     FCGNW015   UPE  F 1050        DISK
000200120622     ICGNW015   AA
000300120622     C                   EXCEPT    F1
000400120622     OCGNW015   E            F1
000500120622     O                                          600 '         '
