000100120622     FCGNW014   UPE  F  900        DISK
000200120622     ICGNW014   AA
000300120622     C                   EXCEPT    F1
000400120622     OCGNW014   E            F1
000500120622     O                                          600 '         '
