000100191104       Ctl-opt option(*noDebugIo)   DftActGrp(*no);
000200191104
000300191104      *-------------------------------------------------------------------------
000400191104      *
000500191104      *  Description: Check OE Attachement Files.
000600191104      *  Programmer.: Brian Rees
000700191104      *  Date.......: 11/04/2019
000800191104      *
000900191104      *-------------------------------------------------------------------------
001000191104
001100191104      *-------------------------------------------------------------------------
001200191104      *
001300191104      * Declare Files
001400191104      *
001500191104      *-------------------------------------------------------------------------
001600191104       Dcl-f InqLtrAtt keyed usage( *input : *output );
001700191104
001800191104
001900191104
002000191104
002100191104      *-------------------------------------------------------------------------
002200191104      *
002300191104      * Global Variables
002400191104      *
002500191104      *-------------------------------------------------------------------------
002600191104
002700191104       dcl-ds pgmd
002800191104          ExtName('IOPGMD') PSDS;
002900191104         @pgmq *proc;
003000191104       end-ds;
003100191104
003200191104       dcl-c q '''' ;
003300191104
003400191104      *--------------------------------------------
003500191104      *
003600191104      * Procedures
003700191104      *
003800191104      *--------------------------------------------
003900191104       /include *LIBL/QMODSRC,#COMMANDPR         // Command
004000191104
004100191104
004200191104
004300191104      *-------------------------------------------------------------------------
004400191104      *
004500191104      * *Entry Procedure
004600191104      *
004700191104      *-------------------------------------------------------------------------
004800191104       Dcl-pr Main ExtPgm;
004900191104         *N  Char(10);
005000191104         *N  Char(200);
005100191104         *N  char(26);
005200191104
005300191104
005400191104       End-Pr;
005500191104
005600191104       dcl-pi Main;
005700191104         pFileType Char(10);
005800191104         pFileName Char(200);
005900191104         pTimeStmp Char(26);
006000191104       End-Pi;
006100191104
006200191104       dcl-s wEmail Char(60);
006300191104       Dcl-s Msg Char(2000);
006400191104       dcl-s Subject Char(100);
006500191104
006600191104      *-------------------------------------------------------------------------
006700191104      *
006800191104      * Mainline Program
006900191104      *
007000191104      *-------------------------------------------------------------------------
007100191104
007200220518       wEmail = 'payrolledi@amwins.com';
007300191104
007400191125
007500191125           // br_todo Add TSA???
007600191125           //
007700191125
007800191104       chain pFileType InqLtrAtt;
007900191104       if not %Found( InqLtrAtt );
008000191104
008100191104         LT_KEY  = pFileType;
008200191104         LTFILENAME = pFileName;
008300191104         LTMODDATE  = ptimeStmp;
008400191104
008500191104         write r_Attach;
008600191104
008700191104       else;
008800191104
008900191104         if pTimeStmp > ltModDate;
009000191104
009100191104           Subject = 'Newer Letter found for OE!';
009200191104           Msg = 'The Letter Type: ' + %trim( pFileType ) +
009300191104           ' has a differnet modification date that what is in our ' +
009400191104           'system. ' +
009500191104           '<br>Program: CHKOEATTC' +
009600191104           '<br><br><b>New File</b>' +
009700191104           '<br>File Name: ' + %Trim( pFileName ) +
009800191104           '<br>Mod Date: ' + %Trim( pTimeStmp ) +
009900191104           '<br><br><b>Current File</b>' +
010000191104           '<br>File Name: ' + %Trim( ltFileName ) +
010100191104           '<br>Mod Date: ' + %Trim( ltModDate )  ;
010200191104
010300191104           CmdString = 'Mailtool toAddr(' + wEmail + ') ' +
010400191104             ' Subject(' + q + %Trim( Subject)  + q + ') ' +
010500191104             ' Message(' + q + %Trim( Msg ) + q + ')' +
010600220518             ' FromAddr(payrolledi@amwins.com)' +
010700191104             ' BdyCt(' + q + 'text/html; charset=utf-8' + q + ')';
010800191104
010900191104           #Command(CmdString:%len(%Trim(CmdString)));
011000191104
011100191104         EndIf;
011200191104
011300191104       EndIf;
011400191104
011500191104       *inlr = *on;
