000100160928     H option(*noDebugIo)  DftActGrp(*no) BndDir('GBSBDIR')
000200161013
000300161013      *-------------------------------------------------------------------------
000400161013      *
000500190405      *  Description: Checks to see if the user is using a web environment
000600190405      *  Programmer.: B.Rees
000700190405      *  Date.......: 01/15/2016
000800161013      *
000900161013      *-------------------------------------------------------------------------
001000190405      * Change Log
001100190405      *
001200190405      *-------------------------------------------------------------------------
001300161013     FChkProFnddcf   e             workstn
001400161013
001500190405
001600161013      *-------------------------------------------------------------------------
001700161013     D pgmsts         sDS
001800161013     D UserName                      10    Overlay( PgmSts: 254 )
001900161013     D CurrentUser                   10    Overlay( PgmSts: 358 )
002000161013
002100161013     D p               s               *
002200161013     D Data            s           1000A   varying
002300161013
002400161013     D ProfoundUI      s              1    inz
002500161013     D Genie           s              1    inz
002600161013     D Continue        s              1
002700161013
002800161013
002900161013      *--------------------------------------------
003000161013      *?Procedures
003100161013      *--------------------------------------------
003200161013     d inGenie         pr                  ExtPgm('PROFOUNDUI/PUI0002300')
003300161013     d                                1
003400161013
003500161013     d getenv          PR              *   extproc('Qp0zGetEnvNoCCSID')
003600161013     d   name                          *   value options(*string)
003700161013      *-------------------------------------------------------------------------
003800161013
003900161013      *------------------------------------------------------------------
004000161013      *?Main Program
004100161013      *------------------------------------------------------------------
004200161013     C     *Entry        Plist
004300161013     C                   parm                    Program          10
004400161013     C                   parm                    Continue
004500161013
004600161013        //--------------------------------------------
004700161013        //?If running profound Logic Anonymously...
004800161013        //?  check the environment variable.
004900161013        //--------------------------------------------
005000161013
005100161013         Continue   = 'Y';
005200161013         ProfoundUI =  *Blanks;
005300161013
005400161013         p = getenv('PROFOUNDUI') ;
005500161013         if p <> *NULL;
005600161013           Data = %str(p);
005700161013           ProfoundUI = %Subst(Data:1:1);
005800161013         endif;
005900161013
006000161013
006100161013         //?if ProfoundUI is blank, check genie..
006200161013         inGenie( Genie );
006300161013
006400161013
006500161013         //?Not using Profound... Show Error...
006600161013         if ProfoundUI = *Blanks and Genie = '0';
006700161013
006800161013            Continue = 'N';
006900161013
007000161013            Dou *in03 = *on;
007100161013               exfmt Error;
007200161013
007300161013               if *in03 = *on;
007400161013                  leave;
007500161013               endif;
007600161013
007700161013            enddo;
007800161013
007900190405
008000161013         endif;
008100161013
008200161013
008300161013         *inlr = *on;
