000100990526     F******************************************************************
000300041215     F*  cob390     GROUP BENEFIT SERVICES SOFTWARE                    *
000400990526     F*                                                                *
000500990526     F*            WRITTEN BY - DAVID KETTERMAN                        *
000600041215     F*            DATE - 12/15/04                                     *
000700990526     F*                                                                *
000800041215     F*  DESCRIPTION - List member reinstatements with retain cobra    *
001001041216     F*                notify info = 'Y'                               *
001002041215     F*                                                                *
001100990526     F******************************************************************
001200990526     FHIST      IP   E             DISK
001501001107     Fcodes     IF   E           K DISK
001502041215     Fmember    IF   E           K DISK
001600940803     FQSYSPRT   O    F  132        PRINTER OFLIND(*INOF)
002000990526     D                UDS
002100990526     D  LFY                    1      4  0
002200990526     D  LFMD                   5      8  0
002300990526     D  LTY                    9     12  0
002400990526     D  LTMD                  13     16  0
002500990527     D  LTRUST                17     19
002600990527     D  LSUB                  20     22
002700990527     D  LACC                  23     26
002800981214     D  CONAME               201    240
002900981214     D  LTIME                242    247  0
003103001106     C* CHECK NOTE FIELD FOR A VAILD SSN
003105010320     C                   add       1             tottr             7 0
003107010320
004401001107     c                   movel     trcode        type              1
004402001107     c                   move      trcode        t2                2
004403001107     C     codkey        CHAIN     codes
004404001107     c                   if        %found(codes)
004405001107     c                   move      ldescr        desout           30
004406001107     c                   else
004407001107     c                   move      *blanks       desout
004408001107     c                   end
008239001107
008241010320     c                   add       tottr         totlr             8 0
008242041215
008243041215     C                   MOVE      trdate        @DATIN
008244041215     C                   EXSR      #DATYM
008245041215     C                   MOVE      @DATOU        Trdmdy            8 0
008246041215
008247041215     c* name
008248041215     c                   move      hkey          memkey            9 0
0082490412150065 C     memkey        CHAIN     member
008250041215
0082510412150200 C                   clear                   memnam           34
008252041215     c                   if        %found(member)
0082530412160202 C                   MOVEl     mfname        memnam
008254041215     c                   if        mmi <> ' '
008255041215     C                   CAT       mmi:1         memnam
008256041215     c                   end
008257041216     C                   CAT       mlname:1      memnam
008258041215     c                   end
008259041215
008300990526     C                   EXCEPT    PRT
008301010320     c                   clear                   tottr
008303010320
0083040412150103 C***************************************************
0083050412150104 C* CONVERT FIELD FROM YYYYMMDD TO MMDDYYYY         *
0083060412150105 C***************************************************
0083070412150107 C*
0083080412150107 C* DATE IN  = @DATIN (8.0) YYYYMMDD
0083090412150107 C* DATE OUT = @DATOU (8.0) MMDDYYYY
0083100412150107 C*
0083110412150106 C     #DATYM        BEGSR
008312041215     C                   MOVE      @DATIN        @MD               4 0
008313041215     C                   MOVEL     @DATIN        @Y                4 0
008314041215     C                   MOVEL     @MD           @DATOU            8 0
008315041215     C                   MOVE      @Y            @DATOU
008316041215     C                   MOVE      *ZEROS        @DATIN            8 0
0083170412150120 C                   ENDSR
0083180412150107 C*
008900990526     C     *INZSR        BEGSR
009000990526     C*
009401001107     c     codkey        klist
009402001107     c                   kfld                    type
009403001107     c                   kfld                    t2
009800990526     C                   ENDSR
011500981214     OQSYSPRT   H    1P                     2 03
011600981214     O         OR    OF
011800981214     O                       CONAME              85
012000981214     O          H    1P                     1
012100981214     O         OR    OF
012200041216     O                                           60 'MEMBER REINSTATEMENTS W'
012201041216     O                                           83 'ITH RETAIN COBRA NOTIFY'
012202041216     O                                           94 ' INFO = YES'
012400981214     O          H    1P                     1
012500981214     O         OR    OF
012600041215     O                                           20 'PROGRAM NAME: COB390'
012700981231     O                                           56 'DATE RANGE:'
012800990527   01O                       LFMD                62 '  /  '
012900990527   01O                                           63 '/'
013000990527   01O                       LFY                 67
013100990526     O                                           69 '-'
013200001107   01O                       LTMD                75 '  /  '
013300001107   01O                                           76 '/'
013400001107   01O                       LTY                 80
013500981214     O                                          122 'PAGE :'
013600981214     O                       PAGE          Z    131
013700981214     O          H    1P                     1
013800981214     O         OR    OF
013900981214     O                                            9 'RUN DATE:'
014000990526     O                       *DATE         Y     20
014100990527     O                                           52 'TRUST:'
014200990527     O                       LTRUST              56
014300990527     O                                           62 'SUB:'
014400990527     O                       LSUB                66
014500990527     O                                           72 'ACC:'
014600990527     O                       LACC                77
014700981214     O                                          122 'TIME :'
014800981214     O                       LTIME              132 '  :  :  '
014900981214     O          H    1P                     1
015000981214     O         OR    OF
015100981214     O                                           24 '""""""""""""""""""""""""'
015200981214     O                                           48 '""""""""""""""""""""""""'
015300981214     O                                           72 '""""""""""""""""""""""""'
015400981214     O                                           96 '""""""""""""""""""""""""'
015500981214     O                                          120 '""""""""""""""""""""""""'
015600981214     O                                          132 '""""""""""""'
016200990526     O          H    1P                     1
016300990526     O         OR    OF
016301041215     O                                           10 'TRANS DATE'
016500041215     O                                           22 'SSN'
016501041215     O                                           28 'NAME'
016600041215     O                                           70 'DESCRIPTION'
016601041215     O                                           95 'NOTE'
018100981214     O          H    1P                     2
018200981214     O         OR    OF
018300981214     O                                           24 '""""""""""""""""""""""""'
018400981214     O                                           48 '""""""""""""""""""""""""'
018500981214     O                                           72 '""""""""""""""""""""""""'
018600981214     O                                           96 '""""""""""""""""""""""""'
018700981214     O                                          120 '""""""""""""""""""""""""'
018800981214     O                                          132 '""""""""""""'
018900981214     O          E            PRT            1
018901041215     O                       trdmdy              10 '  /  /    '
019400041215     O                       hkey                22
019401041215     O                       memnam              58
019500041215     O                       desout              89
019501041215     O                       ck#not             121
020401010320     O          t    lr                     1
020402041216     O                                            6 'TOTAL:'
020403041216     O                       TOTlr         1     17
