000100990526     F******************************************************************
000300010320     F*  cob360     GROUP BENEFIT SERVICES SOFTWARE                    *
000400990526     F*                                                                *
000500990526     F*            WRITTEN BY - DAVID KETTERMAN                        *
000600010320     F*            DATE - 03/20/01                                     *
000700990526     F*                                                                *
000800010320     F*  DESCRIPTION - Report transaction count for COBRA Dept.        *
001001001106     F*                                                                *
001100990526     F******************************************************************
001200990526     FHIST      IP   E             DISK
001501001107     Fcodes     IF   E           K DISK
001600161011     Fcob360p   O    F  132        PRINTER OFLIND(*INOF)
002000990526     D                UDS
002100990526     D  LFY                    1      4  0
002200990526     D  LFMD                   5      8  0
002300990526     D  LTY                    9     12  0
002400990526     D  LTMD                  13     16  0
002500990527     D  LTRUST                17     19
002600990527     D  LSUB                  20     22
002700990527     D  LACC                  23     26
002800981214     D  CONAME               201    240
002900981214     D  LTIME                242    247  0
002901010320     ihistr
002902010320     i                                          TRCODE        l1
003102001106     C*
003103001106     C* CHECK NOTE FIELD FOR A VAILD SSN
003104001106     C*
003105010320     C                   add       1             tottr             7 0
003106010320     cl1                 exsr      #l1sr
003107010320
003108010320     c     #l1sr         begsr
004401001107     c                   movel     trcode        type              1
004402001107     c                   move      trcode        t2                2
004403001107     C     codkey        CHAIN     codes
004404001107     c                   if        %found(codes)
004405001107     c                   move      ldescr        desout           30
004406001107     c                   else
004407001107     c                   move      *blanks       desout
004408001107     c                   end
008239001107
008241010320     c                   add       tottr         totlr             8 0
008300990526     C                   EXCEPT    PRT
008301010320     c                   clear                   tottr
008302010320     c                   endsr
008303010320
008900990526     C     *INZSR        BEGSR
009000990526     C*
009401001107     c     codkey        klist
009402001107     c                   kfld                    type
009403001107     c                   kfld                    t2
009800990526     C                   ENDSR
011500161011     Ocob360p   H    1P                     2 03
011600981214     O         OR    OF
011800981214     O                       CONAME              85
012000981214     O          H    1P                     1
012100981214     O         OR    OF
012200010320     O                                           76 'COBRA TRANSACTION COUNT'
012400981214     O          H    1P                     1
012500981214     O         OR    OF
012600010320     O                                           20 'PROGRAM NAME: COB360'
012700981231     O                                           56 'DATE RANGE:'
012800990527   01O                       LFMD                62 '  /  '
012900990527   01O                                           63 '/'
013000990527   01O                       LFY                 67
013100990526     O                                           69 '-'
013200001107   01O                       LTMD                75 '  /  '
013300001107   01O                                           76 '/'
013400001107   01O                       LTY                 80
013500981214     O                                          122 'PAGE :'
013600981214     O                       PAGE          Z    131
013700981214     O          H    1P                     1
013800981214     O         OR    OF
013900981214     O                                            9 'RUN DATE:'
014000990526     O                       *DATE         Y     20
014100990527     O                                           52 'TRUST:'
014200990527     O                       LTRUST              56
014300990527     O                                           62 'SUB:'
014400990527     O                       LSUB                66
014500990527     O                                           72 'ACC:'
014600990527     O                       LACC                77
014700981214     O                                          122 'TIME :'
014800981214     O                       LTIME              132 '  :  :  '
014900981214     O          H    1P                     1
015000981214     O         OR    OF
015100981214     O                                           24 '""""""""""""""""""""""""'
015200981214     O                                           48 '""""""""""""""""""""""""'
015300981214     O                                           72 '""""""""""""""""""""""""'
015400981214     O                                           96 '""""""""""""""""""""""""'
015500981214     O                                          120 '""""""""""""""""""""""""'
015600981214     O                                          132 '""""""""""""'
016200990526     O          H    1P                     1
016300990526     O         OR    OF
016500010320     O                                            5 'TRANS'
016600010320     O                                           19 'DESCRIPTION'
016601010320     O                                           51 'COUNT'
017200981214     O          H    1P                     1
017300981214     O         OR    OF
017500010320     O                                            5 'CODE '
018100981214     O          H    1P                     2
018200981214     O         OR    OF
018300981214     O                                           24 '""""""""""""""""""""""""'
018400981214     O                                           48 '""""""""""""""""""""""""'
018500981214     O                                           72 '""""""""""""""""""""""""'
018600981214     O                                           96 '""""""""""""""""""""""""'
018700981214     O                                          120 '""""""""""""""""""""""""'
018800981214     O                                          132 '""""""""""""'
018900981214     O          E            PRT            1
019400010320     O                       trcode               5
019500010320     O                       desout              38
019503010320     O                       tottr         1     51
020300001107     O          t    lr                  1  1
020400010320     O                                           51 '----------'
020401010320     O          t    lr                     1
020402010320     O                                           40 'TOTAL:'
020403010320     O                       TOTlr         1     51
