000100180323      *=========================================================================
000200180323     h dftactgrp(*no) option(*noDebugIo) bnddir('GBSBIND')
000300180323      *=========================================================================
000400200720      * COB420BR - COBRA Member link to orig mem file maint
000500180326      *========================================================================
000600180326      * Date         Int  Description
000700180326      * ---------    ---  -----------------------------------------------------
000800200720      * 07/20/2020   jt   Original Creation
000801200825      * 09/14/2020   jt   Added exit to main screen
000900180326      *========================================================================
001000180628
001100200720     fcob420bd  cf   e             WorkStn Handler('PROFOUNDUI(HANDLER)')
001101200720
001102200720     fmember    if   e           k disk    extfile('F.MEMBER')
001103200720     f                                     rename(membr:memberFile)
001200180323
001300180323      //========================================================================
001400180323
001500180323     d psds           sds
001600180323     d proc_name         *proc
001700180323
001701200720
001702200720     d nonssnc         s              9
001704200720
002001200720     d linkSSN         pr                  ExtPgm('COB420B2R')
002002200720     d  nonssn                        9
002003200720     d  option                        1
002004200720
002005200720     d cob420br        pi
002006200720     d  option                        1
002007200720
002009200720     d all_linkSSN     pr                  ExtPgm('COB420B3R')
002010200720     d  option                        1
002011200720
002100180323      //========================================================================
002200180323      // mainline
002300180323      //========================================================================
002400180323
002500180323       exsr init;
002600180323       exsr main;
002700180323       exsr exit;
002800180323
002900180323      //========================================================================
003000180323      // main
003100180323      //========================================================================
003200180323
003300180323       begsr main;
003400180323
003500180323        dow btnExit = '0';
003600180323
003700180323         exfmt screen1;
003800180323
003900180323         exsr checkButton;
004000180323
004100180323        enddo;
004200180323
004300180323       endsr;
004400180323
004500180323      //========================================================================
004600180323      // checkButton
004700180323      //========================================================================
004800180323
004900180323       begsr checkButton;
005000180323
005300180323        if btnExit = '1';
005400180323         leavesr;
005500180323        endif;
005600180323
005700180323        if btnEnter = '1';
005800180323         exsr validCheck;
005801200720         btnEnter = '0';
005900180323        endif;
006000180323
006700180323       endsr;
006800180323
006900180323      //========================================================================
007000180323      // valid check
007100180323      //========================================================================
007200180323
007300180323       begsr validCheck;
007400180323
007500200720        errSSN = '0';
007600180323
007601200720        if nonssn > 0;
007602200720         chain nonssn memberFile;
007603200720
007604200720         if not %found;
007800200720           errSSN = '1';
007801200720          leavesr;
007900200720         endif;
008000180323
008001200720         nonssnc = %editc(nonssn:'X');
008002200720         linkSSN(nonssnc : option);
008003200825          nonssn = 0;
008004200825         leavesr;
008005200720        endif;
008006200720
008007200720        if nonssn = 0;
008008200720         all_linkSSN(option);
008009200720        endif;
008010200720
008100180323       endsr;
008200180323
008300180323      //========================================================================
008400180323      // exit
008500180323      //========================================================================
008600180323
008700180323       begsr exit;
008800180323
008900180323        *inlr = '1';
009000180323        return;
009100180323
009200180323       endsr;
009300180323
009400180323      //========================================================================
009500180323      // init
009600180323      //========================================================================
009700180323
009800180323       begsr init;
009900180323
010000180323        btnEnter = '0';
010100180323        btnExit = '0';
010300180323        pgmname = proc_name;
010500200720        errSSN = '0';
010600180323
010601200720        ssntext = 'Enter a valid Non-SSN number:';
010602200720        if option = 'C';
010603200720         ssntext = 'Enter Current Member SSN:';
010604200720        endif;
010605200720
010700180323       endsr;
010800180323
010900180323      //========================================================================
