000100170111     H option(*noDebugIo)
000200170111      *================================================================
000300170111
000400170112     Fjohngreen if   e             disk    rename(EVGXPTF:johnFile)
000500170111
000600170112     Fevrgrenxpnuf a e           k disk    rename(EVGXPTF:everFile)
000700170112
000800170111      *================================================================
000900170111
001000170111       exsr init;
001100170111       exsr main;
001200170111       exsr exit;
001300170111
001400170111      //========================
001500170111      // main
001600170111      //========================
001700170111
001800170111       begsr main;
001900170111
002000170112       setll 1 johnFile;
002100170112       read johnFile;
002200170111
002300170111       dow not %eof;
002400170111
002500170112        chain (EVGRPSEQ) everFile;
002600170112        if not %found;
002700170112         write everFile;
002800170112        endif;
002900170112
003000170112       read johnFile;
003100170111       enddo;
003200170111
003300170111       endsr;
003400170111
003500170111      //========================
003600170111      // exit
003700170111      //========================
003800170111
003900170111       begsr exit;
004000170111
004100170111       *inlr = *on;
004200170111       return;
004300170111
004400170111       endsr;
004500170111
004600170111      //========================
004700170111      // init
004800170111      //========================
004900170111
005000170111       begsr init;
005100170111
005200170111       endsr;
005300170111
005400170111      //========================
