000100001016     H DFTNAME(CR165) FIXNBR(*ZONED)
000200991229      ******************************************************************
000300000414      * CR165     GROUP BENEFIT SERVICES SOFTWARE           1993      *
000400991229      *                                                                *
000500991229      *            WRITTEN BY - MICHAEL C. DUNPHY                      *
000600991229      *            DATE - 10/23/89                                     *
000700991229      *                                                                *
000800991229      *  DESCRIPTION - THIS PROGRAM WILL PRINT MEDICAL TRANSMITTALS    *
000900991229      *                IN GROUP # ORDER.                               *
001000991229      *                                                                *
001100991229      *  Y2K CONVERT - 1998                                            *
001200991229      *                                                                *
001300991229      * 12/1999  KSJ - Converted to RPG ILE                            *
0014000211070020 F* 11/07/02 DLK - add "D" for DBE                                 *
001500991229      *                                                                *
001600000103      *                                                                *
001700991229      ******************************************************************
001800991229     FTRANS     IP   F  232        DISK
001900060218     FCARMST    IF   F  278     3AIDISK    KEYLOC(1)
002000991229     FREPORT    O    F  198        PRINTER OFLIND(*INOF)
002100920603     F                                     FORMLEN(66)
002200920603     F                                     FORMOFL(55)
002300991229
002400991229     D NF              S              1    DIM(40) CTDATA PERRCD(1)             NOT FOUND MESSAGE
002500991229     D N               S              1    DIM(35)                              NAME WORK ARRAY
002600991229     D L1P             S              9  2 DIM(2)
002700991229     D L2P             S              9  2 DIM(2)
002800991229     D L3P             S              9  2 DIM(2)
002900991229     D L4P             S              9  2 DIM(2)
003000991229     D L6P             S              9  2 DIM(2)
003100991229     D L7P             S              9  2 DIM(2)
003200991229     D LRP             S              9  2 DIM(2)
003300991229
003400991229      *   DATA STRUCTURE PLAN MASTER FILE KEY
003500991229     D                 DS
003600991229     D  PLNKEY                 1     10
003700991229     D  TRUST#                 1      3  0
003800991229     D  SUB#                   4      6  0
003900991229     D  PLAN#                  7     10
004000991229
004100991229      * LDA
004200991229     D                UDS
004300991229     D  LTRUST                 7      9                                         COMPNY
004400980817     D  COD                   53     86
004500980817     D  LBC                   90     90
004600991229     D  LFDATE                21     28  0                                      COMPNY
004700991229     D  LTDATE                29     36  0                                      COMPNY
004800991229     D  CONAME               201    240                                         COMPNY
004900991229     D  STIME                242    253  0                                      COMPNY
005000991229     D  HMS                  242    247  0                                      COMPNY
005100991229
005200991229     ITRANS     NS  01
005300991229     I                                  2   10 0SSNO          L1
005400991229     I                                 18   19  CODECK
005500991229     I                                 17   19  TRCODE
005600991229     I                                 26   55  CK#NOT
005700991229     I                                 56   85  NOTE2
005800991229     I                                 26   29  PLAN#
005900991229     I                                 40   41 0AGEBND
006000991229     I                                 52   53  TYPCOD
006100991229     I                                 68   69  OLDCOD
006200991229     I****                                   62  69 OLDED
006300991229     I                                 78   85  ED
006400991229     I                                110  112 0TRUST#
006500991229     I                                113  115 0SUB#
006600991229     I                                110  119 0ACC#
006700991229     I                                125  125  SGRREM        L5
006800991229     I                                126  128  CTLFLD        L7
006900991229     I                                129  136 0TRDATE
007000991229     I                                153  160 0COVTDT        L3
007100991229     I                                163  177  GROUP#        L4
007200991229     I                                185  202  LNAME
007300991229     I                                203  215  FNAME
007400991229     I                                217  217  MI                      50
007500991229     I                                222  228 2PREM
007600991229     I                                229  231  CARKEY        L6
007700991229     I                                232  232  ACTION        L2
007800991229
007900991229      * CARRIER MASTER FILE
008000991229     ICARMST    NS
008100991229     I                                  4   43  CNAME
008200991229
008300991229      *****************************************************************
008400991229      *   M A I N   L I N E   C A L C U L A T I O N S                 *
008500991229      *****************************************************************
008600920617     C                   IF        FLAG <> 'Y'
008700920617     C                   EXCEPT    CRTRIA
008800920728     C                   Z-ADD     0             CNT               7 0
008900920617     C                   MOVE      'Y'           FLAG              1
009000920617     C                   END
009100991229
009200991229      * GET CARRIER NAME FOR HEADINGS
009300991229
009400991229     C   L6CARKEY        CHAIN     CARMST                             98
009500991229     C   98              MOVEL     NF(1)         CNAME
009600991229
009700991229     C   L1              EXSR      #NAMEL
009800991229
009900991229      * CHECK ACTION CODE FOR A=ADDITIONS, D=DELETIONS, OR C=CHANGE IN COV.TYPE
010000991229
010100991229     C  NL2              GOTO      #T0010
010200991229     C                   SETOFF                                       212223
010300910215     C                   SETOFF                                       252627
010400931026     C                   SETOFF                                       2428
010500931025     C                   SETOFF                                       4142
010600991229     C                   IF        ACTION = 'A'
010700991229     C                   SETON                                            21
010800991229     C                   END
010900991229     C                   IF        ACTION = 'C'
011000991229     C                   SETON                                            22
011100991229     C                   END
011200991229     C                   IF        ACTION = 'D'
011300991229     C                   SETON                                            23
011400991229     C                   END
011500991229     C                   IF        ACTION = 'R'
011600991229     C                   SETON                                            24
011700991229     C                   END
011800991229     C                   IF        ACTION = 'E'
011900991229     C                   SETON                                          4126
012000991229     C                   END
012100991229     C                   IF        ACTION = 'G'
012200991229     C                   SETON                                          4227
012300991229     C                   END
012400991229     C                   IF        ACTION = 'H'
012500991229     C                   SETON                                          4128
012600991229     C                   END
012700991229     C     #T0010        TAG
012800991229
012900991229      * START NEW PAGE FOR BREAK OR OVERFLOW
013000991229
013100991229     C   L4
013200991229     COR OF              ADD       1             CNT
013300991229     C   L4
013400991229     COR OF              EXCEPT    HEAD
013500991229
013600980817     C   L3              MOVE      COVTDT        @DATIN
013700980817     C   L3              EXSR      #DATYM
013800980817     C   L3              MOVE      @DATOU        COVMDY            8 0
013900991229
014000920617     C   L3              EXCEPT    TITLE
014100920617     C   L2
014200920617     CANNL3              EXCEPT    TITLE
014300991229
014400991229      *------------  ACCUMULATE TOTALS -------------------------
014500991229
014600991229      * ACCUMULATE PREM
014700991229
014800991229     C                   ADD       PREM          L2P(1)
014900991229
015000980817     C                   MOVE      TRDATE        @DATIN
015100980817     C                   EXSR      #DATYM
015200980817     C                   MOVE      @DATOU        TRDMDY            8 0
015300991229
015400991229      * COVERAGE DATE CHANGE (ENROLL OR CANCEL)
015500991229
015600990729     C   41              MOVE      COVTDT        @DATIN
015700990729     C   41              EXSR      #DATYM
015800990729     C   41              MOVE      @DATOU        OLDMDY            8
015900990729     C   41              MOVE      ED            @DATIN
016000990729     C   41              EXSR      #DATYM
016100990729     C   41              MOVE      @DATOU        EDMDY             8
016200991229
016300991229      ****************************************************************
016400991229      *  T O T A L    T I M E
016500991229      ****************************************************************
016600930520     CL1 U6              GOTO      #END2
016700991229     CL1                 ADD       1             L2MEM             6 0
016800991229
016900991229     CL2                 ADD       L2MEM         L3MEM             6 0
017000991229     CL2                 ADD       L2P           L3P
017100991229     CL2                 XFOOT     L2P           L2PREM            9 2
017200991229
017300991229     CL3                 ADD       L3MEM         L4MEM             6 0
017400991229     CL3                 ADD       L3P           L4P
017500991229     CL3                 XFOOT     L3P           L3PREM            9 2
017600991229
017700991229     CL4                 ADD       L4MEM         L6MEM             6 0
017800991229     CL4                 ADD       L4P           L6P
017900991229     CL4                 XFOOT     L4P           L4PREM            9 2
018000991229
018100991229     CL6                 ADD       L6P           L7P
018200991229     CL6                 XFOOT     L6P           L6PREM            9 2
018300991229
018400991229     CL7                 ADD       L7P           LRP
018500991229     CL7                 XFOOT     L7P           L7PREM            9 2
018600941014     CL7   #END2         TAG
018700991229
018800991229     CLR                 XFOOT     LRP           LRPREM            9 2
018900991229      ****************************************************************
019000991229      *   FIELD= LAST, FIRST MI.
019100991229      *------------------- COMPRESS NAME FIELDS ---------------------*
019200991229      *
019300991229     C     #NAMEL        BEGSR
019400991229
019500991229      * INITIALIZE ARRAY AND COUNTER
019600991229
019700991229     C                   MOVE      *BLANKS       N
019800991229     C                   Z-ADD     35            N#                2 0
019900991229     C                   MOVEA     LNAME         N(1)
020000991229
020100991229      *  FIND FIRST BLANK SPACE
020200991229
020300991229     C                   DOU       N(N#) <> ' '
020400991229     C                   SUB       1             N#
020500991229     C                   END
020600991229
020700991229      * MOVE IN , AND FNAME
020800991229
020900991229     C                   ADD       1             N#
021000991229     C                   MOVEA     ','           N(N#)
021100991229     C                   ADD       2             N#
021200991229     C                   MOVEA     FNAME         N(N#)
021300991229
021400991229      * FIND END OF FNAME AND MOVE IN MI
021500991229
021600991229     C  N50              IF        N# <= 27
021700991229
021800991229     C                   DOU       N(N#) = ' '
021900991229     C                   ADD       1             N#
022000991229     C                   END
022100991229
022200991229     C                   ADD       1             N#
022300991229     C                   MOVEA     MI            N(N#)
022400991229     C                   ADD       1             N#
022500991229     C                   MOVEA     '.'           N(N#)
022600991229
022700991229     C                   END
022800991229
022900991229     C                   ENDSR
023000991229
023100991229      ***************************************************
023200991229      * CONVERT FIELD FROM YYYYMMDD TO MMDDYYYY         *
023300991229      ***************************************************
023400991229
023500991229      * DATE IN  = @DATIN (8.0) YYYYMMDD
023600991229      * DATE OUT = @DATOU (8.0) MMDDYYYY
023700991229
023800991229     C     #DATYM        BEGSR
023900980817     C                   MOVE      @DATIN        @MD               4 0
024000980817     C                   MOVEL     @DATIN        @Y                4 0
024100980817     C                   MOVEL     @MD           @DATOU            8 0
024200980817     C                   MOVE      @Y            @DATOU
024300980817     C                   MOVE      *ZEROS        @DATIN            8 0
024400991229     C                   ENDSR
024500991229
024600991229      ***************************************************
024700991229      * INITIALIZATION SUBROUTING                       *
024800991229      ***************************************************
024900991229
025000991229     C     *INZSR        BEGSR
025100991124     C                   MOVE      LFDATE        @DATIN
025200991124     C                   EXSR      #DATYM
025300991124     C                   MOVE      @DATOU        LFMDY             8 0
025400991124     C                   MOVE      LTDATE        @DATIN
025500991124     C                   EXSR      #DATYM
025600991124     C                   MOVE      @DATOU        LTMDY             8 0
025700991229     C                   ENDSR
025800991229
025900991229     OREPORT    E            CRTRIA         3 03
026000991229     O                       CONAME              80
026100991229     O          E            CRTRIA         3
026200931022     O                                           68 'Medical Transmittals by '
026300931115     O                                           75 'Group #'
026400991229     O          E            CRTRIA         2
026500931022     O                                           47 '1. Enter The Trust# to '
026600931022     O                                           71 'print...................'
026700931022     O                                           85 '............. '
026800931022     O                       LTRUST              88
026900991229     O          E            CRTRIA         2
027000920618     O                                           78 '2.   If "ALL" enter the '
027100931022     O                                           72 'Trust Category to print.'
027200931022     O                                           85 '............ '
027300941014     O                       COD                119
027400991229     O          E            CRTRIA      1  3
027500931022     O                                           53 'Enter A Date Range To'
027600931022     O                                           73 'Print Transmittals'
027700991229     O          E            CRTRIA         1
027800931022     O                                           45 '3. Enter From Date...'
027900931022     O                                           69 '........................'
028000931022     O                                           85 '............... '
028100991124     O                       LFMDY               94
028200991229     O          E            CRTRIA         1
028300931022     O                                           43 '4. Enter To Date...'
028400931022     O                                           67 '........................'
028500931022     O                                           85 '................. '
028600991124     O                       LTMDY               94
028700991229     O          E            CRTRIA         2
028800021107     O                                           43 '5. (B)lue Cross onl'
028900021107     O                                           67 'y (D)BE only (N)o BC or '
029000021107     O                                           85 'DBE (A)ll........ '
029100961001     O                       LBC                 86
029200991229     O          E            HEAD           2 03
029300991229     O                       CONAME              78
029400991229     O          E            HEAD           1
029500991229     O                                           68 'M E D I C A L   B E N E '
029600991229     O                                           85 'F I T S   L I S T'
029700991229     O          E            HEAD           1
029800991229     O                       LFMDY               62 '  /  /    '
029900991229     O                                           64 '-'
030000991229     O                       LTMDY               75 '  /  /    '
030100991229     O          E            HEAD           1
030200991229     O                                           15 'CARRIER NAME:'
030300991229     O                       CNAME               56
030400991229     O          E            HEAD           1
030500991229     O                                           10 'GROUP #:'
030600991229     O                       GROUP#              26
030700991229     O                                          114 'PAGE:'
030800991229     O                       CNT           Z    120
030900991229     O          E            HEAD           1
031000991229     O                                           22 'PROGRAM NAME: CR165 '
031100941014     O                                          116 'TRUST CATEGORY :'
031200941014     O                       CTLFLD             120
031300991229     O          E            HEAD           1
031400991229     O                                           11 'RUN DATE:'
031500991229     O                       UDATE         Y     22
031600941014     O                                          116 'SGR FLAG :'
031700941014     O                       SGRREM             120
031800991229     O          E            HEAD           1
031900991229     O                                           24 '""""""""""""""""""""""""'
032000991229     O                                           48 '""""""""""""""""""""""""'
032100991229     O                                           72 '""""""""""""""""""""""""'
032200991229     O                                           96 '""""""""""""""""""""""""'
032300991229     O                                          120 '""""""""""""""""""""""""'
032400991229     O          E            HEAD           1
032500991229     O                                           63 'TRANS'
032600991229     O                                           86 'COV'
032700991229     O                                          101 '-- CHANGES --'
032800991229     O                                          111 'NET'
032900991229     O          E            HEAD           1
033000991229     O                                           15 'EMPLOYEE'
033100991229     O                                           48 'SOC.SEC.#'
033200991229     O                                           63 'DATE'
033300991229     O                                           78 'GROUP NUMBER'
033400991229     O                                           87 'TYPE'
033500991229     O                                           96 'FROM'
033600991229     O                                          104 'TO'
033700991229     O                                          115 'PREMIUM'
033800991229     O          E            HEAD           2
033900991229     O                                           24 '""""""""""""""""""""""""'
034000991229     O                                           48 '""""""""""""""""""""""""'
034100991229     O                                           72 '""""""""""""""""""""""""'
034200991229     O                                           96 '""""""""""""""""""""""""'
034300991229     O                                          120 '""""""""""""""""""""""""'
034400991229     O          E            HEAD           1
034500991229     O                                           24 '------------------------'
034600991229     O                                           48 '------------------------'
034700991229     O                                           72 '------------------------'
034800991229     O                                           96 '------------------------'
034900991229     O                                          120 '------------------------'
035000991229     O          E            TITLE          2
035100991229     O                                           17 'EFFECTIVE DATE:'
035200991229     O                       COVMDY              28 '  /  /    '
035300991229     O               21                          78 '*** ADDITIONS ***'
035400991229     O               22                          85 '*** COVERAGE CHANGES ***'
035500991229     O               23                          78 '*** DELETIONS ***'
035600991229     O               24                          85 '*** COVERAGE REINSTATEME'
035700991229     O               24                          92 'NTS ***'
035800931022     O               26                          85 '*** ENROLLMENT DATE CHAN'
035900931022     O               26                          92 'GES ***'
036000931022     O               27                          84 '*** AGEBAND CHANGES ***'
036100931022     O               28                          74 '*** COVERAGE CANCEL DATE'
036200931022     O               28                          86 'CHANGES ***'
036300991229
036400991229     O          D    01                     1
036500991229     O                       N                   37
036600991229     O                       SSNO                50 '   -  -    '
036700991229     O                       TRDMDY         B    63 '  /  /    '
036800991229     O                       GROUP#         B    81
036900991229     O                       TYPCOD              85
037000991229     O               22      TYPCOD              97
037100991229     O               22      OLDCOD              90
037200991229     O               41 26   OLDMDY         B    96
037300991229     O               41 26   EDMDY          B   105
037400000313     O               41 28   OLDMDY         B    96
037500000313     O               41 28   EDMDY          B   105
037600000313     O***            41 28   EDMDY          B    96
037700000313     O***            41 28   OLDMDY         B   105
037800991229     O               42      OLDCOD         B    90
037900991229     O               42      AGEBND         B    97
038000991229     O                       PREM          LB   120
038100991229     O          T    L2                     1
038200991229     O                                           57 '...............'
038300991229     O                                           80 '........................'
038400991229     O                                          104 '........................'
038500991229     O                                          120 '................'
038600991229     O          T    L2                     2
038700991229     O               21                          25 'ADDITION TOTALS-------->'
038800991229     O               22                          25 'CHANGE COVERAGE TOTALS->'
038900991229     O               23                          25 'DELETION TOTALS-------->'
039000991229     O               24                          25 'COVERAGE REIN. TOTALS-->'
039100991229     O               26                          25 'ENRLDT CHANGE TOTALS--->'
039200991229     O               27                          25 'AGEBAND CHANGE TOTALS-->'
039300991229     O               28                          25 'CHANGE CAN. DATE TOTAL->'
039400991229     O                                           46 '(TOTAL TRANSACTIONS:'
039500991229     O                       L2MEM         LB    54
039600991229     O                                           55 ')'
039700991229     O                       L2P(1)        LB   120
039800991229     O          T    L3                     2
039900991229     O                                           25 'EFFECTIVE DATE TOTALS-->'
040000991229     O                                           46 '(TOTAL TRANSACTIONS:'
040100991229     O                       L3MEM         LB    54
040200991229     O                                           55 ')'
040300991229     O                       L3P(1)        LB   120
040400991229     O          T    L4                     2
040500991229     O                                           25 'GROUP # TOTALS--------->'
040600991229     O                                           46 '(TOTAL TRANSACTIONS:'
040700991229     O                       L4MEM         LB    54
040800991229     O                                           55 ')'
040900991229     O                       L4P(1)        LB   120
041000991229     O          T    L6                     2
041100991229     O                                           25 'CARRIER TOTALS--------->'
041200991229     O                       L6P(1)        LB   120
041300991229     O          T    L7                     2
041400991229     O                                           25 'TRUST CATEGORY TOTALS-->'
041500991229     O                       L7P(1)        LB   120
041600991229     O          T    LR                     2 03
041700991229     O                                           68 '       *** MEDICAL GRAND'
041800991229     O                                           79 'TOTALS ***'
041900991229     O          T    LR                     2
042000991229     O                                           24 '------------------------'
042100991229     O                                           48 '------------------------'
042200991229     O                                           72 '------------------------'
042300991229     O                                           96 '------------------------'
042400991229     O                                          120 '------------------------'
042500991229     O          T    LR                     2
042600991229     O                                           25 'GRAND TOTALS----------->'
042700991229     O                       LRP(1)        LB   120
042800910215**  NOT FOUND MESSAGE
042900910215--- NOT FOUND --------------------------
