000100001016     H DFTNAME(CR160) FIXNBR(*ZONED)
000200991229      ******************************************************************
000300000414      * CR160     GROUP BENEFIT SERVICES SOFTWARE           1989      *
000400991229      *                                                                *
000500991229      *            WRITTEN BY - MICHAEL C. DUNPHY                      *
000600991229      *            DATE - 10/23/89                                     *
000700991229      *                                                                *
000800991229      *  DESCRIPTION - THIS PROGRAM WILL PRINT MEDICAL TRANSMITTALS    *
000900991229      *                IN ACCOUNT ORDER.                               *
001000991229      *                                                                *
001100991229      *  Y2K CONVERT - 1998                                            *
001200991229      *                                                                *
001300991229      * 12/1999  KSJ - Converted to RPG ILE                            *
0014000211070020 F* 11/07/02 DLK - add "D" for DBE                                 *
001500991229      *                                                                *
001600000103      *                                                                *
001700991229      ******************************************************************
001800991229     FTRANS     IP   F  232        DISK
001900060218     FCARMST    IF   F  278     3AIDISK    KEYLOC(1)
002000991229     FACCMST    IF   F  560    10AIDISK    KEYLOC(1)
002100991229     FTRSMST    IF   F  264     3AIDISK    KEYLOC(1)
002200991229     FREPORT    O    F  198        PRINTER OFLIND(*INOF)
002300920603     F                                     FORMLEN(66)
002400920603     F                                     FORMOFL(55)
002500991229
002600991229     D NF              S              1    DIM(40) CTDATA PERRCD(1)             NOT FOUND MESSAGE
002700991229     D N               S              1    DIM(35)                              NAME WORK ARRAY
002800991229     D L1P             S              9  2 DIM(2)
002900991229     D L2P             S              9  2 DIM(2)
003000991229     D L3P             S              9  2 DIM(2)
003100991229     D L4P             S              9  2 DIM(2)
003200991229     D L5P             S              9  2 DIM(2)
003300991229     D L7P             S              9  2 DIM(2)
003400991229     D L8P             S              9  2 DIM(2)
003500991229     D LRP             S              9  2 DIM(2)
003600991229
003700991229      *   DATA STRUCTURE PLAN MASTER FILE KEY
003800991229     D                 DS
003900991229     D  PLNKEY                 1     10
004000991229     D  TRUST#                 1      3  0
004100991229     D  SUB#                   4      6  0
004200991229     D  PLAN#                  7     10
004300991229
004400991229      * LDA
004500991229     D                UDS
004600991229     D  LTRUST                 7      9                                         COMPNY
004700980817     D  COD                   53     86
004800980817     D  LBC                   90     90
004900991229     D  LFDATE                21     28  0                                      COMPNY
005000991229     D  LTDATE                29     36  0                                      COMPNY
005100991229     D  CONAME               201    240                                         COMPNY
005200991229     D  STIME                242    253  0                                      COMPNY
005300991229     D  HMS                  242    247  0                                      COMPNY
005400991229
005500991229     ITRANS     NS  01
005600991229     I                                  2   10 0SSNO          L1
005700991229     I                                 18   19  CODECK
005800991229     I                                 17   19  TRCODE
005900991229     I                                 26   55  CK#NOT
006000991229     I                                 56   85  NOTE2
006100991229     I                                 26   29  PLAN#
006200991229     I                                 40   41 0AGEBND
006300991229     I                                 52   53  TYPCOD
006400991229     I                                 68   69  OLDCOD
006500991229     I****                                   62  69 OLDED
006600991229     I                                 78   85  ED
006700991229     I                                110  112 0TRUST#        L5
006800991229     I                                113  115 0SUB#          L4
006900991229     I                                110  119 0ACC#          L4
007000991229     I                                125  125  SGRREM        L6
007100991229     I                                126  128  CTLFLD        L8
007200991229     I                                129  136 0TRDATE
007300991229     I                                153  160 0COVTDT        L3
007400991229     I                                163  177  GROUP#
007500991229     I                                185  202  LNAME
007600991229     I                                203  215  FNAME
007700991229     I                                217  217  MI                      50
007800991229     I                                222  228 2PREM
007900991229     I                                229  231  CARKEY        L7
008000991229     I                                232  232  ACTION        L2
008100991229
008200991229      * TRUST MASTER FILE
008300991229     ITRSMST    NS
008400991229     I                                  4   23  TNAME
008500991229
008600991229      * CARRIER MASTER FILE
008700991229     ICARMST    NS
008800991229     I                                  4   43  CNAME
008900991229
009000991229     IACCMST    NS
009100991229     I                                  1   10 0ACCNO
009200991229     I                                 11   50  ACNAM1
009300991229     I                                 91  120  AADDR1
009400991229     I                                151  165  ACITY
009500991229     I                                166  167  ASTATE
009600991229     I                             P  168  172 0AZIP
009700991229     I                                310  312 0AVGAGE
009800991229
009900991229      *****************************************************************
010000991229      *   M A I N   L I N E   C A L C U L A T I O N S                 *
010100991229      *****************************************************************
010200920617     C                   IF        FLAG <> 'Y'
010300920617     C                   EXCEPT    CRTRIA
010400920728     C                   Z-ADD     0             CNT               7 0
010500920617     C                   MOVE      'Y'           FLAG              1
010600920617     C                   END
010700991229
010800991229      * GET CARRIER NAME FOR HEADINGS
010900991229
011000991229     C   L7CARKEY        CHAIN     CARMST                             98
011100991229     C   98              MOVEL     NF(1)         CNAME
011200991229
011300991229      * GET TRUST NAME FOR HEADINGS
011400991229
011500991229     C   L5TRUST#        CHAIN     TRSMST                             98
011600991229     C   98              MOVEL     NF(1)         TNAME
011700991229
011800991229     C   L1              EXSR      #NAMEL
011900991229
012000991229      * CHECK ACTION CODE FOR A=ADDITIONS, D=DELETIONS, OR C=CHANGE IN COV.TYPE
012100991229
012200991229     C  NL2              GOTO      #T0010
012300991229     C                   SETOFF                                       212223
012400910215     C                   SETOFF                                       252627
012500931026     C                   SETOFF                                       2428
012600931025     C                   SETOFF                                       4142
012700991229     C                   IF        ACTION = 'A'
012800991229     C                   SETON                                            21
012900991229     C                   END
013000991229     C                   IF        ACTION = 'C'
013100991229     C                   SETON                                            22
013200991229     C                   END
013300991229     C                   IF        ACTION = 'D'
013400991229     C                   SETON                                            23
013500991229     C                   END
013600991229     C                   IF        ACTION = 'R'
013700991229     C                   SETON                                            24
013800991229     C                   END
013900991229     C                   IF        ACTION = 'E'
014000991229     C                   SETON                                          4126
014100991229     C                   END
014200991229     C                   IF        ACTION = 'G'
014300991229     C                   SETON                                          4227
014400991229     C                   END
014500991229     C                   IF        ACTION = 'H'
014600991229     C                   SETON                                          4128
014700991229     C                   END
014800991229     C     #T0010        TAG
014900991229
015000991229      * START NEW PAGE FOR BREAK OR OVERFLOW
015100991229
015200991229     C   L5
015300991229     COR OF              ADD       1             CNT
015400991229     C   L5
015500991229     COR OF              EXCEPT    HEAD
015600991229
015700991229      * GET ACCOUNT NAME FOR HEADINGS
015800991229
015900991229     C   L4ACC#          CHAIN     ACCMST                             98
016000920601     C   L4
016100991229     CAN 98              MOVEL     NF(1)         ACNAM1
016200991229     C   L4              EXCEPT    L2OUT
016300991229
016400980817     C   L3              MOVE      COVTDT        @DATIN
016500980817     C   L3              EXSR      #DATYM
016600980817     C   L3              MOVE      @DATOU        COVMDY            8 0
016700991229
016800920617     C   L3              EXCEPT    TITLE
016900920617     C   L2
017000920617     CANNL3              EXCEPT    TITLE
017100991229
017200991229      *------------  ACCUMULATE TOTALS -------------------------
017300991229
017400991229      * ACCUMULATE PREM
017500991229
017600991229     C                   ADD       PREM          L2P(1)
017700991229
017800980817     C                   MOVE      TRDATE        @DATIN
017900980817     C                   EXSR      #DATYM
018000980817     C                   MOVE      @DATOU        TRDMDY            8 0
018100991229
018200991229      * COVERAGE DATE CHANGE (ENROLL OR CANCEL)
018300991229
018400990729     C   41              MOVE      COVTDT        @DATIN
018500990729     C   41              EXSR      #DATYM
018600990729     C   41              MOVE      @DATOU        OLDMDY            8
018700990729     C   41              MOVE      ED            @DATIN
018800990729     C   41              EXSR      #DATYM
018900990729     C   41              MOVE      @DATOU        EDMDY             8
019000991229
019100991229      ****************************************************************
019200991229      *  T O T A L    T I M E
019300991229      ****************************************************************
019400930520     CL1 U6              GOTO      #END2
019500991229     CL1                 ADD       1             L2MEM             6 0
019600991229
019700991229     CL2                 ADD       L2MEM         L3MEM             6 0
019800991229     CL2                 ADD       L2P           L3P
019900991229     CL2                 XFOOT     L2P           L2PREM            9 2
020000991229
020100991229     CL3                 ADD       L3MEM         L4MEM             6 0
020200991229     CL3                 ADD       L3P           L4P
020300991229     CL3                 XFOOT     L3P           L3PREM            9 2
020400991229
020500991229     CL4                 ADD       L4P           L5P
020600991229     CL4                 XFOOT     L4P           L4PREM            9 2
020700991229
020800991229     CL5                 ADD       L5P           L7P
020900991229     CL5                 XFOOT     L5P           L5PREM            9 2
021000991229     CL5                 Z-ADD     0             PAGE
021100991229
021200991229     CL7                 ADD       L7P           LRP
021300991229     CL7                 XFOOT     L7P           L7PREM            9 2
021400991229
021500991229     CL8                 ADD       L8P           LRP
021600991229     CL8                 XFOOT     L8P           L8PREM            9 2
021700941014     CL8   #END2         TAG
021800991229
021900991229     CLR                 XFOOT     LRP           LRPREM            9 2
022000991229      ****************************************************************
022100991229      *   FIELD= LAST, FIRST MI.
022200991229      *------------------- COMPRESS NAME FIELDS ---------------------*
022300991229
022400991229     C     #NAMEL        BEGSR
022500991229
022600991229      * INITIALIZE ARRAY AND COUNTER
022700991229
022800991229     C                   MOVE      *BLANKS       N
022900991229     C                   Z-ADD     35            N#                2 0
023000991229     C                   MOVEA     LNAME         N(1)
023100991229
023200991229      *  FIND FIRST BLANK SPACE
023300991229
023400991229     C                   DOU       N(N#) <> ' '
023500991229     C                   SUB       1             N#
023600991229     C                   END
023700991229
023800991229      * MOVE IN , AND FNAME
023900991229
024000991229     C                   ADD       1             N#
024100991229     C                   MOVEA     ','           N(N#)
024200991229     C                   ADD       2             N#
024300991229     C                   MOVEA     FNAME         N(N#)
024400991229
024500991229      * FIND END OF FNAME AND MOVE IN MI
024600991229
024700991229     C  N50              IF        N# <= 27
024800991229
024900991229     C                   DOU       N(N#) = ' '
025000991229     C                   ADD       1             N#
025100991229     C                   END
025200991229
025300991229     C                   ADD       1             N#
025400991229     C                   MOVEA     MI            N(N#)
025500991229     C                   ADD       1             N#
025600991229     C                   MOVEA     '.'           N(N#)
025700991229
025800991229     C                   END
025900991229
026000991229     C                   ENDSR
026100991229
026200991229      ***************************************************
026300991229      * CONVERT FIELD FROM YYYYMMDD TO MMDDYYYY         *
026400991229      ***************************************************
026500991229
026600991229      * DATE IN  = @DATIN (8.0) YYYYMMDD
026700991229      * DATE OUT = @DATOU (8.0) MMDDYYYY
026800991229
026900991229     C     #DATYM        BEGSR
027000980817     C                   MOVE      @DATIN        @MD               4 0
027100980817     C                   MOVEL     @DATIN        @Y                4 0
027200980817     C                   MOVEL     @MD           @DATOU            8 0
027300980817     C                   MOVE      @Y            @DATOU
027400980817     C                   MOVE      *ZEROS        @DATIN            8 0
027500991229     C                   ENDSR
027600991229
027700991229      ***************************************************
027800991229      * INITIALIZATION SUBROUTING                       *
027900991229      ***************************************************
028000991229
028100991229     C     *INZSR        BEGSR
028200991124     C                   MOVE      LFDATE        @DATIN
028300991124     C                   EXSR      #DATYM
028400991124     C                   MOVE      @DATOU        LFMDY             8 0
028500991124     C                   MOVE      LTDATE        @DATIN
028600991124     C                   EXSR      #DATYM
028700991124     C                   MOVE      @DATOU        LTMDY             8 0
028800991229     C                   ENDSR
028900991229
029000991229     OREPORT    E            CRTRIA         3 03
029100991229     O                       CONAME              80
029200991229     O          E            CRTRIA         3
029300931022     O                                           68 'Medical Transmittals by '
029400931022     O                                           75 'Account'
029500991229     O          E            CRTRIA         2
029600931022     O                                           47 '1. Enter The Trust# to '
029700931022     O                                           71 'print...................'
029800931022     O                                           85 '............. '
029900931022     O                       LTRUST              88
030000991229     O          E            CRTRIA         2
030100920618     O                                           78 '2.   If "ALL" enter the '
030200931022     O                                           72 'Trust Category to print.'
030300931022     O                                           85 '............ '
030400941014     O                       COD                119
030500991229     O          E            CRTRIA      1  3
030600931022     O                                           53 'Enter A Date Range To'
030700931022     O                                           73 'Print Transmittals'
030800991229     O          E            CRTRIA         1
030900931022     O                                           45 '3. Enter From Date...'
031000931022     O                                           69 '........................'
031100931022     O                                           85 '............... '
031200991124     O                       LFMDY               93
031300991229     O          E            CRTRIA         1
031400931022     O                                           43 '4. Enter To Date...'
031500931022     O                                           67 '........................'
031600931022     O                                           85 '................. '
031700991124     O                       LTMDY               93
031800991229     O          E            CRTRIA         2
031900021107     O                                           43 '5. (B)lue Cross onl'
032000021107     O                                           67 'y (D)BE only (N)o BC or '
032100021107     O                                           85 'DBE (A)ll........ '
032200961001     O                       LBC                 86
032300991229     O          E            HEAD           2 03
032400991229     O                       CONAME              78
032500991229     O          E            HEAD           1
032600991229     O                                           68 'M E D I C A L   B E N E '
032700991229     O                                           85 'F I T S   L I S T'
032800991229     O          E            HEAD           1
032900991229     O                       LFMDY               62 '  /  /    '
033000991229     O                                           64 '-'
033100991229     O                       LTMDY               75 '  /  /    '
033200991229     O          E            HEAD           1
033300991229     O                                           15 'CARRIER NAME:'
033400991229     O                       CNAME               56
033500991229     O          E            HEAD           1
033600991229     O                                            8 'TRUST:'
033700991229     O                       TNAME               32
033800991229     O                                          114 'PAGE:'
033900991229     O                       CNT           Z    120
034000991229     O          E            HEAD           1
034100991229     O                                           22 'PROGRAM NAME: CR160 '
034200941014     O                                          116 'TRUST CATEGORY :'
034300941014     O                       CTLFLD             120
034400991229     O          E            HEAD           1
034500991229     O                                           11 'RUN DATE:'
034600991229     O                       UDATE         Y     22
034700941014     O                                          116 'SGR FLAG :'
034800941014     O                       SGRREM             120
034900991229     O          E            HEAD           1
035000991229     O                                           24 '""""""""""""""""""""""""'
035100991229     O                                           48 '""""""""""""""""""""""""'
035200991229     O                                           72 '""""""""""""""""""""""""'
035300991229     O                                           96 '""""""""""""""""""""""""'
035400991229     O                                          120 '""""""""""""""""""""""""'
035500991229     O          E            HEAD           1
035600991229     O                                            8 'ACCT.NO.'
035700991229     O                                           63 'TRANS'
035800991229     O                                           86 'COV'
035900991229     O                                          101 '-- CHANGES --'
036000991229     O                                          111 'NET'
036100991229     O          E            HEAD           1
036200991229     O                                           15 'EMPLOYEE'
036300991229     O                                           48 'SOC.SEC.#'
036400991229     O                                           63 'DATE'
036500991229     O                                           78 'GROUP NUMBER'
036600991229     O                                           87 'TYPE'
036700991229     O                                           96 'FROM'
036800991229     O                                          104 'TO'
036900991229     O                                          115 'PREMIUM'
037000991229     O          E            HEAD           2
037100991229     O                                           24 '""""""""""""""""""""""""'
037200991229     O                                           48 '""""""""""""""""""""""""'
037300991229     O                                           72 '""""""""""""""""""""""""'
037400991229     O                                           96 '""""""""""""""""""""""""'
037500991229     O                                          120 '""""""""""""""""""""""""'
037600991229     O          E            HEAD           1
037700991229     O                                           24 '------------------------'
037800991229     O                                           48 '------------------------'
037900991229     O                                           72 '------------------------'
038000991229     O                                           96 '------------------------'
038100991229     O                                          120 '------------------------'
038200991229     O          E            L2OUT          2
038300991229     O                       ACCNO               13 '0   -   -    '
038400991229     O                       ACNAM1              57
038500991229     O                                           75 'AVERAGE AGE :'
038600991229     O                       AVGAGE        1     79
038700991229     O          E            TITLE          2
038800991229     O                                           17 'EFFECTIVE DATE:'
038900991229     O                       COVMDY              28 '  /  /    '
039000991229     O               21                          78 '*** ADDITIONS ***'
039100991229     O               22                          85 '*** COVERAGE CHANGES ***'
039200991229     O               23                          78 '*** DELETIONS ***'
039300991229     O               24                          85 '*** COVERAGE REINSTATEME'
039400991229     O               24                          92 'NTS ***'
039500931022     O               26                          85 '*** ENROLLMENT DATE CHAN'
039600931022     O               26                          92 'GES ***'
039700931022     O               27                          84 '*** AGEBAND CHANGES ***'
039800931022     O               28                          74 '*** COVERAGE CANCEL DATE'
039900931022     O               28                          86 'CHANGES ***'
040000991229
040100991229     O          D    01                     1
040200991229     O                       N                   37
040300991229     O                       SSNO                50 '   -  -    '
040400991229     O                       TRDMDY         B    63 '  /  /    '
040500991229     O                       GROUP#         B    79
040600991229     O                       TYPCOD              83
040700991229     O               22      TYPCOD              97
040800991229     O               22      OLDCOD              90
040900991229     O               41      OLDMDY         B    96
041000991229     O               41      EDMDY          B   105
041100991229     O               42      OLDCOD         B    90
041200991229     O               42      AGEBND         B    97
041300991229     O                       PREM          LB   120
041400991229     O          T    L2                     1
041500991229     O                                           57 '...............'
041600991229     O                                           80 '........................'
041700991229     O                                          104 '........................'
041800991229     O                                          120 '................'
041900991229     O          T    L2                     2
042000991229     O               21                          25 'ADDITION TOTALS-------->'
042100991229     O               22                          25 'CHANGE COVERAGE TOTALS->'
042200991229     O               23                          25 'DELETION TOTALS-------->'
042300991229     O               24                          25 'COVERAGE REIN. TOTALS-->'
042400991229     O               28                          25 'CHANGE CAN. DATE TOTAL->'
042500991229     O                                           46 '(TOTAL TRANSACTIONS:'
042600991229     O                       L2MEM         LB    54
042700991229     O                                           55 ')'
042800991229     O                       L2P(1)        LB   120
042900991229     O          T    L3                     2
043000991229     O                                           25 'EFFECTIVE DATE TOTALS-->'
043100991229     O                                           46 '(TOTAL TRANSACTIONS:'
043200991229     O                       L3MEM         LB    54
043300991229     O                                           55 ')'
043400991229     O                       L3P(1)        LB   120
043500991229     O          T    L4                     2
043600991229     O                                           25 'ACCOUNT NUMBER TOTALS-->'
043700991229     O                                           46 '(TOTAL TRANSACTIONS:'
043800991229     O                       L4MEM         LB    54
043900991229     O                                           55 ')'
044000991229     O                       L4P(1)        LB   120
044100991229     O          T    L4                     1
044200991229     O                                           24 '------------------------'
044300991229     O                                           48 '------------------------'
044400991229     O                                           72 '------------------------'
044500991229     O                                           96 '------------------------'
044600991229     O                                          120 '------------------------'
044700991229     O          T    L5                     2
044800991229     O                                           25 'TRUST TOTALS----------->'
044900991229     O                       L5P(1)        LB   120
045000991229     O          T    L7                     2
045100991229     O                                           25 'CARRIER TOTALS--------->'
045200991229     O                       L7P(1)        LB   120
045300991229     O          T    L8                     2
045400991229     O                                           25 'TRUST CATEGORY TOTALS-->'
045500991229     O                       L8P(1)        LB   120
045600991229     O          T    LR                     2 03
045700991229     O                                           68 '       *** MEDICAL GRAND'
045800991229     O                                           79 'TOTALS ***'
045900991229     O          T    LR                     2
046000991229     O                                           24 '------------------------'
046100991229     O                                           48 '------------------------'
046200991229     O                                           72 '------------------------'
046300991229     O                                           96 '------------------------'
046400991229     O                                          120 '------------------------'
046500991229     O          T    LR                     2
046600991229     O                                           25 'GRAND TOTALS----------->'
046700991229     O                       LRP(1)        LB   120
046800910215**  NOT FOUND MESSAGE
046900910215--- NOT FOUND --------------------------
