000100910215     H DFTNAME(DB030)
0002009102150002 F******************************************************************  DB0301
0003000004140003 F* DB030      GROUP BENEFIT SERVICES SOFTWARE           1988      *  DB0301
0004009102150004 F*                                                                *  DB0301
0005009102150005 F*            WRITTEN BY - MICHAEL C. DUNPHY                      *  DB0301
0006009102150006 F*            DATE - 03/22/89                                     *  DB0301
0007009102150007 F*                                                                *  DB0301
0008009102150008 F*  DESCRIPTION - THIS PROGRAM WILL COMPARE HISTORY TOTALS        *  DB0301
0009009102150009 F*            TO ACCOUNT BALANCES AND PRINT EXCEPTIONS            *  DB0301
0010009102150010 F*                                                                *  DB0301
0011009808200014 F*                                                                *
0012009808200010 F*  Y2K CONVERT - 1998                                            *
0013009808200015 F*                                                                *
0014000102210011 F******************************************************************  DB0301
001500010221     F* MODIFICATION HISTORY
001600010221     F* ???  08.20.1998  Y2K CONVERSION
001700010221     F* SSK  02.21.2001  RPGIV CONVERSION
001701011030     F* dlk  10/30/01    enlarge acctot field
001702131003      * dlk  10/03/13    hist file expansion project
001900010221     F*
0020009102150011 F******************************************************************  DB0301
0021009102150012 F*                                                                   DB0301
0022001310030013 FHIST      IP   F  216        DISK
0023000102210015 FACCMST    IF   F  560    10AIDISK    KEYLOC(1)
0024000102210016 FREPORT    O    F  132        PRINTER OFLIND(*INOF)
0025009102150043 D BAL             S              9  2 DIM(12)
0026009102150032 D/SPACE                                                              DB030
0027009102150033 D* LDA                                                               DB030
0028009102150034 D                UDS
0029009102150035 D  CONAME               201    240
0030009102150036 D  STIME                242    253  0
0031009102150037 D  HMS                  242    247  0
0032009102150018 IHIST      NS  01
0033009102150019 I*  TRANSACTION HISTORY FILE                                         DB030
0034009507280021 I                                  1   10 0ACC#          L1
0035009102150020 I                             P   20   24 2TRAMT
0037009102150023 IACCMST    NS
0038009102150024 I*  ACCOUNT MASTER FILE                                              DB030
0039000102210025 I                                 11   45  ACNAM1
0040009102150026 I                                151  165  ACITY
0041009102150027 I                                166  167  ASTATE
004200980820     I                                513  520 0ACVTDT
004300980820     I                                517  518 0AM
0044009102150030 I                             P  249  253 2APREMI
004500910215     I                             P  361  420 2BAL
0046009102150031 I                                512  512  DLTCD
0047009102150038 C*                                                                   DB030
0048009808190039 C* ZERO OUT TOTAL ON ACCOUNT CHANGE                                  DB030
0049009102150040 C*                                                                   DB030
004901011030     c                   if        *inl1
0050000110300041 C                   clear                   ACCTOT           10 2
005002011030     c                   end
0051009102150042 C*                                                                   DB030
0052009102150043 C* ACCUMULATE TRANSACTION AMOUNT                                     DB030
0053009102150044 C*                                                                   DB030
0054000110300045 C                   ADD       tramt         ACCTOT
0055009102150046 C*                                                                   DB030
0056009102150047 C* ON ACCOUNT BREAK CHECK BALANCE                                    DB030
0057009102150048 C*                                                                   DB030
0058009102150049 CL1   ACC#          CHAIN     ACCMST                             98
0059009808190050 CL1 98              EXCEPT    ERR
0061009808190050 CL1 98              GOTO      #END
0062009102150051 C*                                                                   DB030
0063009102150052 C* CHECK BALANCE IN ACCOUNT AGAINST TOTAL TRANSACTIONS               DB030
0064009102150053 C*                                                                   DB030
006500910215     CL1                 XFOOT     BAL           TOTBAL            9 2
006600910215     CL1   TOTBAL        SUB       BAL(AM)       APRBAL            9 2
006700910215     CL1                 Z-ADD     BAL(AM)       ACUBAL            9 2
006800910215      **
0070009102150056 CL1   ACCTOT        IFNE      TOTBAL
0071009102150057 CL1   TOTBAL        SUB       ACCTOT        DIF               9 2
0072009102150058 CL1                 ADD       1             CNT               7 0
0073000110300059 CL1                 except    prt
0074009102150060 CL1                 END
0075009808190060 CL1   #END          TAG
0076009102150061 O******************************************************              DB030
0077009102150062 O*  OUTPUT SPECIFICATIONS                             *              DB030
0078009102150063 O******************************************************              DB030
0079009102150064 O*                                                                   DB030
0080000102210065 OREPORT    H    1P                     2  3
008100010221     O         OR    OF
0082009102150067 O                       CONAME              87
0083000102210065 OREPORT    H    1P                     1
008400010221     O         OR    OF
0085009102150070 O                       UDATE         Y     14
0086009102150071 O                                           77 'ACCOUNT BALANCE AUDIT'
0087009102150072 O                                          120 'PAGE :'
0088009102150073 O                       PAGE          Z    126
0089000102210065 OREPORT    H    1P                     1
009000010221     O         OR    OF
0091009102150076 O                                           17 'PROG: DB030'
0092009102150077 O                                           77 'AGAINST HISTORY TOTAL'
0093009102150078 O                                          120 'TIME :'
0094009102150079 O                       HMS                130 '  :  :  '
0095000102210065 OREPORT    H    1P                     1
009600010221     O         OR    OF
0097009102150082 O                                           24 '------------------------'
0098009102150083 O                                           48 '------------------------'
0099009102150084 O                                           72 '------------------------'
0100009102150085 O                                           96 '------------------------'
0101009102150086 O                                          120 '------------------------'
0102009102150087 O                                          132 '------------'
0103000102210065 OREPORT    H    1P                     1
010400010221     O         OR    OF
0105000102210090 O                                           71 'PREVIOUS'
0106000102210091 O                                           83 'CURRENT'
0107000110300092 O                                          127 'HISTORY'
0108000110300093 O                                          132 'ACCT'
0110000102210065 OREPORT    H    1P                     1
011100010221     O         OR    OF
0112009102150097 O                                            5 'ACCT#'
0113000102210098 O                                           25 'ACCOUNT NAME'
011400010221     O                                           59 'PREMIUM'
0115000102210101 O                                           71 'BALANCE'
0116000102210101 O                                           83 'BALANCE'
011700010221     O                                           95 'TOTAL DUE'
0118000102210103 O                                          109 '(DIFFERENCE)'
0119000110300104 O                                          127 'TOTAL'
0120000110300105 O                                          132 'STAT'
0122000102210065 OREPORT    H    1P                     1
012300010221     O         OR    OF
0124009102150109 O                                           24 '------------------------'
0125009102150110 O                                           48 '------------------------'
0126009102150111 O                                           72 '------------------------'
0127009102150112 O                                           96 '------------------------'
0128009102150113 O                                          120 '------------------------'
0129009102150114 O                                          132 '------------'
0130000110300115 OREPORT    e            prt            1
0131000102210116 O                       ACC#           B    12 '   -   -    '
0132000102210117 O                       ACNAM1         B    48
0133000102210118 O                       APREMI        LB    60
0134000102210119 O                       APRBAL        LB    72
0135000102210120 O                       ACUBAL        LB    84
0136000102210121 O                       TOTBAL        LB    96
0137000102210122 O                       DIF           LB   109
0138000110300123 O                       ACCTOT        LB   127
0139000110300124 O                       DLTCD          B   132
0141000102210115 OREPORT    E            ERR            1
0142000102210116 O                       ACC#           B    12 '   -   -    '
0143009808190117 O                                           23 '********'
0144009808190117 O                                           47 'INVALID ACC# IN HISTORY'
0145009808190117 O                                           56 '********'
0146009102150126 OREPORT    T    LR                  3
0147009102150127 O                                           29 '*** TOTAL ERRORS:'
0148009102150128 O                       CNT           ZB    38
