000100910215     H DFTNAME(DB060)
0002009102150002 F******************************************************************
0003000004140003 F*                  GROUP BENEFIT SERVICES INC.                   *
0004009102150004 F*                                                                *
0005009102150005 F*            PROGRAM    - DB060                                  *
0006009102150006 F*            WRITTEN BY - MICHAEL C. DUNPHY                      *
0007009102150007 F*            DATE       - 08/01/89                               *
0008009102150008 F*                                                                *
0009009102150009 F*  DESCRIPTION - THIS PROGRAM WILL LIST   ALL MEMBERS WITH ERRORS*
0010009102150010 F*                                                                *
0011009808200014 F*                                                                *
0012009808200010 F*  Y2K CONVERT - 1998                                            *
0013009808200015 F*                                                                *
0014009102150011 F******************************************************************
001500010221     F* MODIFICATION HISTORY                                           *
001600010221     F* ???  08.20.1998  Y2K CONVERSION                                *
001700010221     F* SSK  02.21.2001  RPGIV CONVERSION AND FILES EXTERNALIZED       *
001800010221     F*                                                                *
001900010221     F*                                                                *
002000010221     F*                                                                *
002100010221     F******************************************************************
0022000103120013 Fmemac#    IPE  E           K DISK
0023000102210015 FACCMST    IF   F  560    10AIDISK    KEYLOC(1)
0024000102210016 FREPORT    O    F  132        PRINTER OFLIND(*INOF)
002500010221     D                 DS
002600010221     D MBTRST                  1      3S 0
002700010221     D MBSUB#                  4      6S 0
002800010221     D MBACCT                  7     10S 0
002900010221     D ACCKEY                  1     10S 0
003000010221    ***
0031000102210030 D                UDS
0032000102210031 D  CONAME               201    240
0033000102210032 D  TIME                 242    247  0
003400010221Y2K  D  UD8YMD               248    255  0                                      COMPNY
003500010221    ***
0037030103120029 IACCMST    NS
0037040103120030 I                                512  512  DLTCD
0038009102150031 C                   SETOFF                                       50
0039009102150032 C     ACCKEY        CHAIN     ACCMST                             99
0040009102150033 C   99              SETON                                        5051
0041000102210034 OREPORT    H    1P                  2     3
004200010221     O         OR    OF
0043000102210097 O                                           44 '**'
0044000102210096 O                       CONAME              84
0045000102210095 O                                           86 '**'
0046000102210034 OREPORT    H    1P                  2
004700010221     O         OR    OF
0048000102210100 O                       UDATE         Y     13
0049009102150036 O                                           77 'MEMBER ERROR AUDIT'
0050009102150037 O                                          120 'PAGE :'
0051009102150038 O                       PAGE          Z    126
0052000102210034 OREPORT    H    1P                  1
005300010221     O         OR    OF
0054000102210041 O                                           17 'PROG: DB060 '
0055000102210108 O                                          120 'TIME :'
0056000102210109 O                       TIME               130 '  :  :  '
0057000102210034 OREPORT    H    1P                  1
005800010221     O         OR    OF
0059000102210044 O                                           13 'SS #'
0060000102210045 O                                           30 'ACC #'
0061009102150046 O                                           40 'STATUS'
0062009102150047 O                                           49 'NAME'
0063000102210048 O                                           87 'ERRORS'
0064000102210034 OREPORT    H    1P                  1  1
006500010221     O         OR    OF
0066009102150051 O                                           13 '-----------'
0067009102150052 O                                           30 '------------'
0068009102150053 O                                           40 '------'
0069000102210054 O                                           63 '------------------'
0070000102210055 O                                           78 '--------------'
0071000102210056 O                                          100 '-------------------'
0072009102150057 O                                          120 '--------------------'
0073000102210058 OREPORT    D   NLR 50                  1
0074000102210059 O                       MBSSNO              13 '   -  -    '
0075000102210060 O                       ACCKEY              30 '   -   -    '
0076009102150061 O                       STATUS              38
0077000102210062 O                       MLNAME              63
0078000102210063 O                       MFNAME              76
0079000102210064 O                       MMI                 78
0080009102150065 O               51                         100 'ACCOUNT NOT ON FILE'
