0001009102120002 F*
0002009505260003 F* AUDIT FOR COBRA HISTORY NOT MATCHING MEMBER RECORD
0003009102120004 F*
0005009811130005 F*11/13/98 DLW CHANGE DATE LOCATIONS AND RECORD LENGTHS TO NEW
0006009811130005 F*             FORMATS. Y2K COMPLIANT.
000602131003     F* 10/03/13 dlk - hist file expansion
0006031310030004 F*
0007001310030061 FHIST      IP   F  216        DISK
0008009811130061 FMEMBER    IF   F  648     9AIDISK    KEYLOC(1)
0009009505260008 FREPORT    O    F  132        PRINTER OFLIND(*INOF)
0010009505260034 D                UDS
0011009505260035 D  CONAME               201    240
0012009505260037 D  HMS                  242    247  0
0013009106170011 IHIST      NS  01
001400950526     I                                  2   10 0SSN           L1
001500950526     I                             P   20   24 2TRAMT
0016009505260100 IMEMBER    NS
0017009505260101 I*  MEMBER FILE
0018009505260167 I                                136  145 0MTSA
0019009505260167 I                             P  373  376 2PRVBAL
0020009505260168 I                             P  377  380 2CURBAL
0021009811130167 I                                577  584 0MTERM
0022009811130164 I                                625  632 0CEXPDT
0023009505260022 C                   ADD       TRAMT         L1AMT            10 2
002400950526     CL1   SSN           CHAIN     MEMBER                             18
002500950526     CL1 18              EXCEPT    NOSSN
002600950526     CL1 18              GOTO      #END
002700950526     CL1   PRVBAL        ADD       CURBAL        BAL               8 2
002800950526     CL1   L1AMT         IFNE      BAL
0029009505260057 CL1   BAL           SUB       L1AMT         DIF               9 2
0030009505260058 CL1                 ADD       1             CNT               7 0
0031009505260058 CL1                 ADD       L1AMT         LRHBAL           10 2
0032009505260058 CL1                 ADD       BAL           LRMBAL           10 2
0033009505260058 CL1                 ADD       DIF           LRDIF            10 2
003400981113     CL1                 MOVE      MTERM         CYMD#             8
003500981113     CL1                 EXSR      #CYMD8
003600981113     CL1                 MOVE      MDCY#         TERM8             8 0
003700981113     CL1                 MOVE      CEXPDT        CYMD#             8
003800981113     CL1                 EXSR      #CYMD8
003900981113     CL1                 MOVE      MDCY#         CEXP8             8 0
004000950526     CL1                 EXCEPT    ERROR
004100950526     CL1                 END
004200950526     CL1   #END          TAG
004300950526     CL1                 MOVE      *ZEROS        L1AMT
004400950526     CL1                 MOVE      *ZEROS        BAL
004500950526     CL1                 MOVE      *ZEROS        DIF
004600981113     C*------------------------------------------------------
004700981113     C* Rearrange date / ccyymmdd to mmddccyy
004800981113     C*****************************************************
004900981113     C     #CYMD8        BEGSR
005000981113     C                   MOVE      CYMD#         MMDD#             4
005100981113     C                   MOVEL     CYMD#         CCYY#             4
005200981113     C                   MOVEL     MMDD#         MDCY#             8
005300981113     C                   MOVE      CCYY#         MDCY#
005400981113     C                   ENDSR
005500981113     C*****************************************************
0056009505260065 OREPORT    H    1P                     2 03
0057009505260066 O         OR    OF
0058009505260067 O                       CONAME              87
0059009505260068 O          H    1P                     1
0060009505260069 O         OR    OF
0061009811130070 O                       *DATE         Y     16
0062009505260071 O                                           77 '  COBRA BALANCE AUDIT'
0063009505260072 O                                          120 'PAGE :'
0064009505260073 O                       PAGE          Z    126
0065009505260074 O          H    1P                     1
0066009505260075 O         OR    OF
0067009505260076 O                                           17 'PROG: DB420'
0068009505260077 O                                           77 'AGAINST HISTORY TOTAL'
0069009505260078 O                                          120 'TIME :'
0070009505260079 O                       HMS                130 '  :  :  '
0071009505260080 O          H    1P                     1
0072009505260081 O         OR    OF
0073009505260082 O                                           24 '------------------------'
0074009505260083 O                                           48 '------------------------'
0075009505260084 O                                           72 '------------------------'
0076009505260085 O                                           96 '------------------------'
0077009505260086 O                                          120 '------------------------'
0078009505260087 O                                          132 '------------'
0079009505260095 O          H    1P                     1
0080009505260096 O         OR    OF
0081009505260097 O                                            5 'SSN  '
0082009505260100 O                                           20 'MEMBER'
0083009505260101 O                                           31 'MEMBER'
0084009505260102 O                                           45 'COBRA'
0085009505260102 O                                           60 'MEMBER'
0086009505260103 O                                           77 'HISTORY'
0087009505260104 O                                           90 'DIFFERENCE'
0088009505260095 O          H    1P                     1
0089009505260096 O         OR    OF
0090009505260097 O                                           18 'TERM'
0091009505260100 O                                           30 'ACC #'
0092009505260101 O                                           47 'EXPIRES'
0093009505260101 O                                           61 'BALANCE'
0094009505260102 O                                           77 'BALANCE'
0095009505260107 O          H    1P                     1
0096009505260108 O         OR    OF
0097009505260109 O                                           24 '------------------------'
0098009505260110 O                                           48 '------------------------'
0099009505260111 O                                           72 '------------------------'
0100009505260112 O                                           96 '------------------------'
0101009505260113 O                                          120 '------------------------'
0102009505260114 O                                          132 '------------'
0103009505260033 O          E            ERROR          1
0104009505260034 O                       SSN                 11 '   -  -    '
0105009811130034 O                       TERM8         Y     22
0106009505260035 O                       MTSA                37 '   -   -    '
0107009811130035 O                       CEXP8         Y     48
010800950526     O                       BAL           J     61
010900950526     O                       L1AMT         J     77
011000950526     O                       DIF           J     90
0111009505260033 O          E            NOSSN          1
0112009505260034 O                       SSN                 11 '   -  -    '
0113009505260034 O                                           32 '** INVALID SSN **'
0114009505260126 O          T    LR                  1  1
0115009505260109 O                                           61 '------------'
0116009505260109 O                                           77 '------------'
0117009505260109 O                                           90 '------------'
0118009505260126 O          T    LR                     1
0119009505260127 O                                           29 '*** TOTAL ERRORS:'
0120009505260128 O                       CNT           ZB    38
0121009505260109 O                       LRMBAL        J     61
0122009505260109 O                       LRHBAL        J     77
0123009505260109 O                       LRDIF         J     90
