0001000302260002  ******************************************************************
0002000302260009  ******************************************************************
0003000302260010  *                                                                *
000400061109     Fdelbalp   IP   E           K DISK
000500061109     FMEMBER    UF   E           K DISK
000600021203      *
000700061109      *
000800061109     D                 DS
000900061109     D  suba                   1      9
001000061109     D  subn                   1      9  0
001100061109      *
001200061109     D                 DS
001300061109     D  dbsubn                 1      9
001400061109     D   dbsub2                1      2
001500061109      *
001600021203     D                 DS
001700021203     D  dbdate                 1     10
001800021203     D   dbmm                  1      2  0
001900021203     D   dbdd                  4      5  0
002000021203     D   dbyy                  7     10  0
002100021203      *
002200021203     D                 DS
002300021203     D  gbdate                 1      8  0
002400021203     D   gbyy                  1      4  0
002500021203     D   gbmm                  5      6  0
002600021203     D   gbdd                  7      8  0
002700030116      *
002800021219      *
002900021219      ******************************************************************
003000021218      *  Main Line
003100030103      *
003200061109     C                   if        dbsufx = '00'
003300050601      *             If sub# is Alt ID - use mbr ssn
003400050708     C                   if        dbsub2 = '90' and dbmssn <> *blanks
003500050601     C                   movel     dbmssn        subn
003600050601     C                   else
003700050601     C                   movel     dbsubn        subn
003800021219     C                   endif
003900050601      *             Check to see if Mbr already exists
004000050601     C     subn          chain     member                             23
004100061109     C                   if        *in23 = '0'
004200030915      *
004300030915     C                   if        dbhrdt <> *blanks
004400061109     C                   movel     dbhrdt        dbdate
004500030915     C                   z-add     dbdd          gbdd
004600030915     C                   z-add     dbmm          gbmm
004700030915     C                   z-add     dbyy          gbyy
004800061109     C                   if        gbdate <> empdt
004900061109     C                   z-add     gbdate        empdt
005000061109     C                   update    membr
005100030915     C                   endif
005200061109     C                   endif
005300061109     C                   endif
005400021203      *
005500061109     C                   endif
005600061109      *
