000100170808     H bnddir('*LIBL/GBSBDIR') DFTACTGRP(*NO) ACTGRP(*CALLER)
000200170808     H option(*SRCSTMT: *NODEBUGIO)
000300160708    ? *-------------------------------------------------------------------------
000400160708    ? *
000500180305    ? *  Description: Direct Sales Inquiry Plus
000600160708      *
000700170629    ? *  Programmer.: Jon Allen
000800180305    ? *  Date.......: 03/05/2018
000900160708    ? *
001000160708    ? *
001100160708    ? *-------------------------------------------------------------------------
001200180316    ?FDSGASD    CF   E             WORKSTN
001300160926     F                                     HANDLER('PROFOUNDUI(HANDLER)')
001400170808
001500170808     D/COPY *LIBL/QMODSRC,PR0003RPR            // Check Program Authority
001600160926
001700160708    ? *-------------------------------------------------------------------------
001800170629     d hasError        s               n   inz
001900170630     d errTsa          s               n   inz
002000170630     d errDate         s               n   inz
002100170630     d wdate           s              8s 0 inz
002200170630     d mydate          s               d
002300180305
002400170808    ?D PGMD          ESDS                  EXTNAME(IOPGMD)
002500170808     D  @pgmq            *proc
002600180305
002700180305      *-------------------------------------------------------------------------
002800180305      *
002900180305      * Procedures
003000180305      *
003100180305      *-------------------------------------------------------------------------
003200180305       dcl-pr DSPLUS01R ExtPgm('DSPLUS01R');
003300180305          TRS Char(3);
003400180305          SUB Char(3);
003500180305          ACT Char(4);
003600180305       End-Pr;
003700161010
003800160926    ? *-------------------------------------------------------------------------
003900170310      *?Mainline Program
004000160926      *-------------------------------------------------------------------------
004100170629     C     *Entry        plist
004200170629     C                   parm                    TRS               3
004300170629     C                   parm                    SUB               3
004400170629     C                   parm                    ACT               4
004500160926
004600170310      /Free
004700160708
004800170630             //?Stay unless exit is clicked
004900160708          Dou btnExit = *on;
005000160926             Exfmt Screen1;
005100160922
005200170630             //?If exit button leave
005300160926             if btnExit = *on;
005400160926                leave;
005500160926             endif;
005600160926
005700160926             //?Check for Errors
005800160926             exsr Validate;
005900161103
006000170630             //?If error then show error popup
006100170629             if hasError = *on ;
006200180305             if errTSA = *on;
006300170630             exfmt TSAerror ;
006400170629             endif;
006500170629             endif;
006600180305
006700180305             exsr Report;
006800180305          DSPLUS01R( TRS: SUB: ACT );
006900160926
007000160922          enddo;
007100160922
007200170630       eval *inlr = *on;
007300170630       return;
007400160926      *-------------------------------------------------------------------------
007500160926       Begsr Validate;
007600160926
007700160926          hasError = *off;
007800160926
007900170630          errTSA  = *off;
008000170811
008100180316           //?Only required if selecting by account
008200180316           //if s1Trst <> 0 or s1Sub <> 0 or s1Acct <> 0;
008300160926
008400160926          //?Trust Number.
008500180316          //  if s1Trst = *Zero;
008600180316          //     hasError = *on;
008700180316          //     errTsa  = *on;
008800180316          //  endif;
008900160926
009000160926          //?Sub Account Number.
009100180316          //  if s1Sub = *Zero;
009200180316          //    hasError = *on;
009300180316          //    errTsa = *on;
009400180316          //  endif;
009500160926
009600160926          //?Account Number.
009700180316          //if s1Acct = *Zero;
009800180316          //   hasError = *on;
009900180316          //   errTsa  = *on;
010000180316          //endif;
010100170630
010200180316        // endif;
010300160926
010400160926       Endsr;
010500160926      *-------------------------------------------------------------------------
010600160926       Begsr ErrorWindow;
010700160926
010800161103
010900160926       Endsr;
011000170629      *-------------------------------------------------------------------------
011100170629     C     report        begsr
011200180316     C*                   move      s1trst        TRS
011300180316     C*                   move      s1sub         SUB
011400180316     C*                   move      s1acct        ACT
011500170629     C                   endsr
011600170808      // ----------------------------------------------------------------
011700170808       Begsr *Inzsr;
011800170808
011900170808         //?Check Program Authority
012000180305      // ChkPgmAuth(@pgmq : oContinue);
012100180305      // if oContinue = 'N';
012200180305      //    *inlr = *on;
012300180305      //    Return;
012400180305      // endif;
012500170808
012600170808       Endsr;
