000100160708     H option(*noDebugIo) DftActGrp(*no)
000200160708    ? *-------------------------------------------------------------------------
000300160708    ? *
000400170629    ? *  Description: OE Alerts Report
000500160708      *
000600170629    ? *  Programmer.: Jon Allen
000700170629    ? *  Date.......: 06/29/2017
000800160708    ? *
000900160708    ? *
001000160708    ? *-------------------------------------------------------------------------
001100170629    ?FDSH1001D  CF   E             WORKSTN
001200160926     F                                     HANDLER('PROFOUNDUI(HANDLER)')
001300160926
001400160708    ? *-------------------------------------------------------------------------
001500170629     d hasError        s               n   inz
001600170629     d errTrst         s               n   inz
001700170629     d errSub          s               n   inz
001800170629     d errAcct         s               n   inz
001900161010
002000160926    ? *-------------------------------------------------------------------------
002100170310      *?Mainline Program
002200160926      *-------------------------------------------------------------------------
002300170629     C     *Entry        plist
002400170629     C                   parm                    TRS               3
002500170629     C                   parm                    SUB               3
002600170629     C                   parm                    ACT               4
002700170629     C                   parm                    DATE1             8
002800170629     C                   parm                    DATE2             8
002900160926
003000170310      /Free
003100160708
003200170630             //?Stay unless exit is clicked
003300160708          Dou btnExit = *on;
003400160926             Exfmt Screen1;
003500160922
003600170630             //?If exit button leave
003700160926             if btnExit = *on;
003800160926                leave;
003900160926             endif;
004000160926
004100160926             //?Check for Errors
004200160926             exsr Validate;
004300161103
004400170630             //?If error then show error popup
004500170629             if hasError = *on ;
004600170629             exfmt TSAerror ;
004700170629             if errClose = *on ;
004800170629             endif;
004900170629             endif;
005000170629
005100170630             //?If Print clicked and no errors, run report
005200170630             if btnPrint = *on and hasError = *off;
005300170629             exsr report;
005400170630             exfmt submitted;
005500170629             leave;
005600170630             else;
005700170630             trs = *blanks;
005800170630             sub = *blanks;
005900170630             act = *blanks;
006000170630             date1 = *blanks;
006100170630             date2 = *blanks;
006200170629             endif;
006300170629
006400160926
006500160922          enddo;
006600160922
006700170630       eval *inlr = *on;
006800170630       return;
006900160926      *-------------------------------------------------------------------------
007000160926       Begsr Validate;
007100160926
007200160926          hasError = *off;
007300160926
007400160926          errTrst = *off;
007500160926          errSub  = *off;
007600160926          errAcct = *off;
007700160926
007800160926          //?Trust Number.
007900160926          if s1Trst = *Zero;
008000160926             hasError = *on;
008100160926             errTrst = *on;
008200160926          endif;
008300160926
008400160926          //?Sub Account Number.
008500160926          if s1Sub = *Zero;
008600160926             hasError = *on;
008700160926             errSub = *on;
008800160926          endif;
008900160926
009000160926          //?Account Number.
009100160926          if s1Acct = *Zero;
009200160926             hasError = *on;
009300160926             errAcct = *on;
009400160926          endif;
009500160926
009600160926
009700160926       Endsr;
009800160926      *-------------------------------------------------------------------------
009900160926       Begsr ErrorWindow;
010000160926
010100170630          btnPrint = *off;
010200161103
010300160926       Endsr;
010400170629      *-------------------------------------------------------------------------
010500170629     C     report        begsr
010600170629     C                   move      s1trst        TRS
010700170629     C                   move      s1sub         SUB
010800170629     C                   move      s1acct        ACT
010900170630     C                   movel     'Y'           DATE1
011000170629     C                   move      *blanks       DATE2
011100170629     C                   endsr
