000100170808     H bnddir('*LIBL/GBSBDIR') DFTACTGRP(*NO) ACTGRP(*CALLER)
000200170808     H option(*SRCSTMT: *NODEBUGIO)
000300160708    ? *-------------------------------------------------------------------------
000400160708    ? *
000500180305    ? *  Description: Direct Sales Inquiry Plus
000600160708      *
000700170629    ? *  Programmer.: Jon Allen
000800180305    ? *  Date.......: 03/05/2018
000900160708    ? *
001000160708    ? *
001100160708    ? *-------------------------------------------------------------------------
001200180305    ?FDSPLUSD   CF   E             WORKSTN
001300160926     F                                     HANDLER('PROFOUNDUI(HANDLER)')
001400170808
001500170808     D/COPY *LIBL/QMODSRC,PR0003RPR            // Check Program Authority
001600160926
001700160708    ? *-------------------------------------------------------------------------
001800170629     d hasError        s               n   inz
001900170630     d errTsa          s               n   inz
002000170630     d errDate         s               n   inz
002100170630     d wdate           s              8s 0 inz
002200170630     d mydate          s               d
002300180305
002400170808    ?D PGMD          ESDS                  EXTNAME(IOPGMD)
002500170808     D  @pgmq            *proc
002600180305
002700180328       dcl-s trs   char(3);
002800180328       dcl-s sub   char(3);
002900180328       dcl-s act   char(4);
003000180328
003100180305      *-------------------------------------------------------------------------
003200180305      *
003300180305      * Procedures
003400180305      *
003500180305      *-------------------------------------------------------------------------
003600180305       dcl-pr DSPLUS01R ExtPgm('DSPLUS01R');
003700180305          TRS Char(3);
003800180305          SUB Char(3);
003900180305          ACT Char(4);
004000180305       End-Pr;
004100161010
004200160926    ? *-------------------------------------------------------------------------
004300170310      *?Mainline Program
004400160926      *-------------------------------------------------------------------------
004500170629     C     *Entry        plist
004600180328     C                   parm                    TRS
004700180328     C                   parm                    SUB
004800180328     C                   parm                    ACT
004900160926
005000170310      /Free
005100160708
005200170630             //?Stay unless exit is clicked
005300160708          Dou btnExit = *on;
005400160926             Exfmt Screen1;
005500160922
005600170630             //?If exit button leave
005700160926             if btnExit = *on;
005800160926                leave;
005900160926             endif;
006000160926
006100160926             //?Check for Errors
006200160926             exsr Validate;
006300161103
006400170630             //?If error then show error popup
006500170629             if hasError = *on ;
006600180305             if errTSA = *on;
006700170630             exfmt TSAerror ;
006800170629             endif;
006900170629             endif;
007000180305
007100180328          TRS = %char(s1trst);
007200180328          SUB = %char(s1sub);
007300180328          ACT = %char(s1acct);
007400180305          DSPLUS01R( TRS: SUB: ACT );
007500160926
007600160922          enddo;
007700160922
007800170630       eval *inlr = *on;
007900170630       return;
008000160926      *-------------------------------------------------------------------------
008100160926       Begsr Validate;
008200160926
008300160926          hasError = *off;
008400160926
008500170630          errTSA  = *off;
008600170811
008700170811          //?Only required if selecting by account
008800170811       if s1Trst <> 0 or s1Sub <> 0 or s1Acct <> 0;
008900160926
009000160926          //?Trust Number.
009100160926          if s1Trst = *Zero;
009200160926             hasError = *on;
009300170630             errTsa  = *on;
009400160926          endif;
009500160926
009600160926          //?Sub Account Number.
009700160926          if s1Sub = *Zero;
009800160926             hasError = *on;
009900170630             errTsa = *on;
010000160926          endif;
010100160926
010200160926          //?Account Number.
010300160926          if s1Acct = *Zero;
010400160926             hasError = *on;
010500170630             errTsa  = *on;
010600160926          endif;
010700170630
010800170811       endif;
010900160926
011000160926       Endsr;
011100160926      *-------------------------------------------------------------------------
011200160926       Begsr ErrorWindow;
011300160926
011400161103
011500160926       Endsr;
011600170629      *-------------------------------------------------------------------------
011700170808      // ----------------------------------------------------------------
011800170808       Begsr *Inzsr;
011900170808
012000170808         //?Check Program Authority
012100180305      // ChkPgmAuth(@pgmq : oContinue);
012200180305      // if oContinue = 'N';
012300180305      //    *inlr = *on;
012400180305      //    Return;
012500180305      // endif;
012600170808
012700170808       Endsr;
