000100180326      *=========================================================================
000200180326     h dftactgrp(*no) option(*noDebugIo) bnddir('GBSBIND')
000300180326      *=========================================================================
000400230519      * DW084R - Mark Bill File records as done
000500191209      *=========================================================================
000600180326      * Date         Int  Description
000700230427      * ----------   ---  ------------------------------------------------------
000800230519      * 05/19/2023   jt   Original Creation
000801230927      * 09/27/2023   jt   Recompiled for DB change
000900191209      *=========================================================================
001000100520
001400230731     fbillfiled uf   e           k disk    rename(billfdr:mainFile)
001600180410
003600170829      *=========================================================================
003700170829
003800170907     d psds           sds
003900170907     d proc_name         *proc
004000210322     d jobName               244    253
004001210322     d user                  254    263
004002210322     d jobNumber             264    269
006200181022
006201230613     d inScdName       s             10
006202230731     d inDate          s               d
006203230731     d inSeq           s              2  0
006204230613
007409230519     d dw084r          pi
007410230613     d  inSchedule                    1
007411230731     d  inAction                      1
007412230731     d  inEffDate                     8
007413230731     d  inSequence                    2
007414200121
007415200313      //========================================================================
007416200313      // includes
007417200313      //========================================================================
007418200313
007419200313      /include GBSPGM/QMODSRC,#GettokPR
007420200313      /include GBSPGM/QMODSRC,#zFillpr
007421200313
007500170829      //========================================================================
007600180320      // mainline
007700180320      //========================================================================
007800170829
007900170829       exsr init;
008000170829       exsr main;
008100170829       exsr exit;
008200170829
008300170829      //========================================================================
008400170829      // main
008500170829      //========================================================================
008600170829
008700170829       begsr main;
008701230626
008702230626        if inAction = 'U';
008703230519
008704230626         setll inSchedule mainFile;
008705230626         reade inSchedule mainfile;
008706230626         dow not %eof;
008707230519
008708230626          if processd = ' ' and procsdtd = d'0001-01-01';
008711230626           processd = 'Y';
008712230626            procsdtd = %date;
008713230626            update mainFile;
008714230626           leavesr;
008720230626          endif;
008800170829
008801230626         reade inSchedule mainfile;
008802230626         enddo;
008803230626
008804230626        endif;
008805230626
008806230626        if inAction = 'C';
008807230626
008829230731         inDate = %date(inEffDate:*usa0);
008831230731         inSeq = %dec(inSequence:2:0);
008832230731
008833230731         chain (inSchedule : inDate : inSeq) mainFile;
008834230731         if %found;
008835230731          processd = ' ';
008836230731           procsdtd = d'0001-01-01';
008837230731           update mainFile;
008838230731          leavesr;
008839230731         endif;
008840230626
008841230626        endif;
008842230519
012900170829       endsr;
013000170829
060800180622      //========================================================================
060900170829      // exit
061000170829      //========================================================================
061100170829
061200170829       begsr exit;
061300170829
061400170829        *inlr = '1';
061500170829        return;
061600100520
061700170829       endsr;
061800170829
061900170829      //========================================================================
062000170829      // init
062100170829      //========================================================================
062200170829
062300170829       begsr init;
062400170829
062401230613        select;
062402230613         when inSchedule = 'B';
062403230613          inScdName = 'AETNA';
062404230613
062405230613         when inSchedule = 'O';
062406230613          inScdName = 'ALTERNATE';
062407230613
062408230613         when inSchedule = 'D';
062409230613          inScdName = 'DBE';
062410230613
062411230613         when inSchedule = 'N';
062412230613          inScdName = 'EDT/EVT';
062413230613
062414230613         when inSchedule = 'A';
062415230613          inScdName = 'NASCO';
062417230613        endsl;
063802221206
064100170829       endsr;
064200170829
064345200313      //========================================================================
