000100180326      *=========================================================================
000200180326     h dftactgrp(*no) option(*noDebugIo) bnddir('GBSBIND')
000300180326      *=========================================================================
000400230601      * DW083R - Users Still in programs
000500191209      *=========================================================================
000600180326      * Date         Int  Description
000700230427      * ----------   ---  ------------------------------------------------------
000800230601      * 05/25/2023   aa   Original Creation
000900191209      *=========================================================================
001000100520
001100230516     fdw083d    cf   e             WorkStn Handler('PROFOUNDUI(HANDLER)')
001200230512     f                                     SFile(SFL1 : RRN)
001300180320
001400230601     fdw081p    if   e             disk    rename(dw081pr:mainFile) usropn
001402230516
001403230516     fgbsecure  if   e           k disk    rename(secr:secureFile)
001600180410
003600170829      *=========================================================================
003700170829
003800170907     d psds           sds
003900170907     d proc_name         *proc
004000210322     d jobName               244    253
004001210322     d user                  254    263
004002210322     d jobNumber             264    269
004003230512
004004230512     d rrn             s              5i 0
004100170907
004300230427     d e1Envir         s             15
004301230427     d e1Libl          s             10
004302230427     d e1Libl2         s             10
004303230427     d envColor        s             10
004304230427     d e1Acnm          s             40
004305230626     d count           s              1
004306230706     d continue        s              1
004307230802     d allowedToEnd    s              1
004308230802     d function        s             20
004309230802     d dspErrMsg       s              1
006200181022
006800230706     d dw080rb         pr                  ExtPgm('DW080RB')
006801230706     d  continue                      1
007400180910
007401230803     d lockUsers       pr                  ExtPgm('DW080CL')
007402230803
007403230706     d dw101c          pr                  ExtPgm('DW101C')
007404230706     d  count                         1
007405230706
007406230802     d endjob          pr                  ExtPgm('ENDUSRJOB')
007407230802     d  sjobnum                       6
007408230802     d  suser                        10
007409230802     d  sjobname                     10
007410230706
007411221206     d getEnv          pr                  ExtPgm('GETENVR')
007412230427     d  e1Envir                      15
007413230427     d  e1Libl                       10
007414230516     d  e1Libl2                      10
007415221206     d  envColor                     10
007416221206     d  e1Acnm                       40
007417230802
007418230802     d chkFncAuth      pr                  ExtPgm('CHKFNCAUTH')
007419230802     d  pgmname                      10
007420230802     d  function                     20
007421230802     d  dspErrMsg                     1
007422230802     d  continue                      1
007423221206
007424230516     d dw083r          pi
007425200121
007426200313      //========================================================================
007427200313      // includes
007428200313      //========================================================================
007429200313
007430200313      /include GBSPGM/QMODSRC,#GettokPR
007431200313      /include GBSPGM/QMODSRC,#zFillpr
007432200313
007500170829      //========================================================================
007600180320      // mainline
007700180320      //========================================================================
007800170829
007900170829       exsr init;
008000170829       exsr main;
008100170829       exsr exit;
008200170829
008300170829      //========================================================================
008400170829      // main
008500170829      //========================================================================
008600170829
008700170829       begsr main;
008701230516
008702230601        dow btnExit = '0';
008800170829
013000230516         // Clear the subfile...
013001230516         sflclr = '1';
013002230516
013003230516         write sflctl1;
013004230516         sflclr = '0';
013005230516         rrn = 0;
013006230516
013007230516         // Load the subfile...
013008230516         exsr loadSubfile;
013009230516
013010230516         // Display the subfile.
013011230516         sfldsp = '1';
013012230516         exfmt sflctl1;
013013230516
013014230601         exsr checkButton;
013015230601
013016230516         sfldsp = '1';
013017230601
013018230601         // Check for icon click.
013019230601         readc sfl1;
013020230601         if not %eof;
013021230516
013022230802         if buttonEnd = '1';
013024230802          endjob(sjobnum : suser : sjobname);
013025230802          buttonEnd = '0';
013026230802         endif;
013027230516
013028230601         endif;
013029230516
013030230601        enddo;
013031230516
013032230516       endsr;
013033230516
013034230516      //========================================================================
013035230516      // load subfile
013036230516      //========================================================================
013037230516
013038230516       begsr loadSubfile;
013039230516
013040230516        setll 1 mainFile;
013041230516        read mainFile;
013042230516
013043230516        dow not %eof;
013044230516
013052230516         rrn += 1;
013053230516
013054230516           exsr moveFields;
013055230516
013056230516          write sfl1;
013057230516
013060230516        read mainFile;
013061230516        enddo;
013062230516
013063230516       endsr;
013064230516
013065230516      //========================================================================
013066230516      // move fields
013067230516      //========================================================================
013068230516
013069230516       begsr moveFields;
013070230516
013089230516        suser = wausr;
013090230706        sjobnum = wanum;
013091230706        sjobname = wajnm;
013092230516
013093230802        sname = ' ';
013094230516        chain wausr secureFile;
013095230516        if %found;
013096230516         sname = scname;
013097230516        endif;
013098230516
013099230516        spgm = wafnct;
013100230516        sdesc = wafil9;
013101230516
013103230516       endsr;
013104230516
013105230601      //========================================================================
013106230601      // checkButton
013107230601      //========================================================================
013108230601
013109230601       begsr checkButton;
013116230601
013117230601        if btnRefresh = '1';
013118230601         close dw081p;
013119230626          dw101c(count);
013120230601          open dw081p;
013121230601         btnRefresh = '0';
013122230601        endif;
013128230601
013129230706        if btnLock = '1';
013130230706         close dw081p;
013131230803          //dw080rb(continue);
013132230803          lockUsers();
013133230803          dw101c(count);
013134230706          open dw081p;
013135230706         btnLock = '0';
013136230706        endif;
013137230706
013138230601       endsr;
013139230601
060800180622      //========================================================================
060900170829      // exit
061000170829      //========================================================================
061100170829
061200170829       begsr exit;
061300170829
061400170829        *inlr = '1';
061500170829        return;
061600100520
061700170829       endsr;
061800170829
061900170829      //========================================================================
062000170829      // init
062100170829      //========================================================================
062200170829
062300170829       begsr init;
062301230516
062302230516        btnExit = '0';
062400170829
063801230516        getenv(e1envir : e1libl : e1Libl2 : envColor : e1Acnm);
063802230516
063803230516        pgmname = proc_name;
063804230601
063805230626        dw101c(count);
063806230601        open dw081p;
063807230802
063808230802        function = 'ENDJOB';
063809230802        dspErrMsg = 'N';
063810230802
063811230802        visEnd = '0';
063812230802        ChkFncAuth(pgmname : function : dspErrMsg : continue);
063813230802        if continue = 'Y';
063814230802         visEnd = '1';
063815230802        endif;
063816230626
063817230601       endsr;
064200170829
064345200313      //========================================================================
