000100190401      *========================================================================
000102190401       Ctl-opt option(*noDebugIo) dftactgrp(*no);
000103190401      *========================================================================
000104230404      * DW180PRRB - Princeton Remote On-demand Deposit Prompt
000105190401      *========================================================================
000106190401      * Date         Int  Description
000107230330      * ----------   ---  -----------------------------------------------------
000108230404      * 04/04/2023   jt   Original Creation
000112190401      *========================================================================
000113190401
000116230404       Dcl-f dw180prdb WorkStn Handler('PROFOUNDUI(HANDLER)');
000123190401
000124190401      *========================================================================
000125190401
000126190401       dcl-ds UploadFile Qualified;
000128190401         NumFiles Zoned(3);
000129190401         Directory Char(256);
000130190401         Files Char(256);
000131190401       End-Ds;
000132190401
000133190401       dcl-s myFileName Char(256) ;
000134190401
000135190401     d psds           sds
000136210806     d proc_name         *proc
000137190401     d user                  254    263
000141190401
000142230413     d continue        s              1
000143230413     d e1envir         s             15
000144230413     d e1libl          s             10
000145230413     d e1Lib2          s             10
000146230413     d envColor        s             10
000147230413     d e1Acnm          s             40
000148230413
000149230413     d getEnv          pr                  ExtPgm('GETENVR')
000150230413     d  e1envir                      15
000151230413     d  e1libl                       10
000152230413     d  e1Lib2                       10
000153230413     d  envColor                     10
000154230413     d  e1Acnm                       40
000155230413
000156230413     d ChkPgmAuth      pr                  extpgm('CHKPGMAUTH')
000157230413     d  pgmname                      10
000158230413     d  continue                      1
000159230413
000160230404     d dw180prbcl      pr                  ExtPgm('DW180PRBCL')
000161230330
000162230404     d dw180prrb       pi
000163190401
000164190401      //======================================================================
000165190401      // mainline
000166190401      //======================================================================
000167190401
000168190401       exsr init;
000169190401       exsr main;
000170190401       exsr exit;
000171190401
000172190401      //======================================================================
000173190401      // moin
000174190401      //======================================================================
000175190401
000176190401       begsr main;
000177190401
000178190401        Dow btnExit = '0';
000179230330
000180230330         exfmt Screen1;
000181190401
000182210120         errFile = '0';
000183190401         if btnExit = '1';
000184190401          leave;
000185190401         endif;
000186190401
000187190401         myFileName = UploadFile.Files;
000188210120
000189210120         if  UploadFile.Files > ' ';
000190230330          //type = 'Y';
000191230330           errFile = '0';
000192230404            dw180prbcl();
000193230330            exfmt msgWindow;
000194230330           btnExit = '1';
000195210120          leavesr;
000196210120         else;
000197230330          //type = 'N';
000198210120          errFile = '1';
000199210120         endif;
000200190401
000201190401        enddo;
000202190401
000203190401       endsr;
000204190401
000205190401      //======================================================================
000206190401      // exit
000207190401      //======================================================================
000208190401
000209190401       begsr exit;
000210190401
000211190401        *inlr = '1';
000212190401        return;
000213190401
000214190401       endsr;
000215190401
000216190401      //======================================================================
000217190401      // init
000218190401      //======================================================================
000219190401
000220190401       begsr init;
000221190401
000222190401        pgmname = proc_name;
000223190401        btnExit = '0';
000224230330        //type = 'N';
000225190401
000226230413        getenv(e1envir : e1libl : e1Lib2 : envColor : e1Acnm);
000227230413
000228230413        ChkPgmAuth(pgmname : continue);
000229230413        if continue = 'N';
000230230413         exsr exit;
000231230413        endif;
000232230413
000233190401       endsr;
000234190401
000235190401      //======================================================================
