000100190401      *========================================================================
000102190401       Ctl-opt option(*noDebugIo) dftactgrp(*no);
000103190401      *========================================================================
000104230413      * DW180RDRB - Remote Deosit
000105190401      *========================================================================
000106190401      * Date         Int  Description
000107230330      * ----------   ---  -----------------------------------------------------
000108230413      * 04/13/2023   jt   Original Creation
000112190401      *========================================================================
000113190401
000116230413       Dcl-f dw180rddb WorkStn Handler('PROFOUNDUI(HANDLER)');
000123190401
000124190401      *========================================================================
000125190401
000126190401       dcl-ds UploadFile Qualified;
000128190401         NumFiles Zoned(3);
000129190401         Directory Char(256);
000130190401         Files Char(256);
000131190401       End-Ds;
000132190401
000133190401       dcl-s myFileName Char(256) ;
000134190401
000135190401     d psds           sds
000136210806     d proc_name         *proc
000137190401     d user                  254    263
000138230413
000139230413     d continue        s              1
000140230413     d e1envir         s             15
000141230413     d e1libl          s             10
000142230413     d e1Lib2          s             10
000143230413     d envColor        s             10
000144230413     d e1Acnm          s             40
000145230413
000146230413     d getEnv          pr                  ExtPgm('GETENVR')
000147230413     d  e1envir                      15
000148230413     d  e1libl                       10
000149230413     d  e1Lib2                       10
000150230413     d  envColor                     10
000151230413     d  e1Acnm                       40
000152230413
000153230413     d ChkPgmAuth      pr                  extpgm('CHKPGMAUTH')
000154230413     d  pgmname                      10
000155230413     d  continue                      1
000156190401
000157230413     d dw180rdbcl      pr                  ExtPgm('DW180RDBCL')
000158230330
000159230413     d dw180rdrb       pi
000160190401
000161190401      //======================================================================
000162190401      // mainline
000163190401      //======================================================================
000164190401
000165190401       exsr init;
000166190401       exsr main;
000167190401       exsr exit;
000168190401
000169190401      //======================================================================
000170190401      // moin
000171190401      //======================================================================
000172190401
000173190401       begsr main;
000174190401
000175190401        Dow btnExit = '0';
000176230330
000177230330         exfmt Screen1;
000178190401
000179210120         errFile = '0';
000180190401         if btnExit = '1';
000181190401          leave;
000182190401         endif;
000183190401
000184190401         myFileName = UploadFile.Files;
000185210120
000186210120         if  UploadFile.Files > ' ';
000187230330          //type = 'Y';
000188230330           errFile = '0';
000189230413            dw180rdbcl();
000190230330            exfmt msgWindow;
000191230330           btnExit = '1';
000192210120          leavesr;
000193210120         else;
000194230330          //type = 'N';
000195210120          errFile = '1';
000196210120         endif;
000197190401
000198190401        enddo;
000199190401
000200190401       endsr;
000201190401
000202190401      //======================================================================
000203190401      // exit
000204190401      //======================================================================
000205190401
000206190401       begsr exit;
000207190401
000208190401        *inlr = '1';
000209190401        return;
000210190401
000211190401       endsr;
000212190401
000213190401      //======================================================================
000214190401      // init
000215190401      //======================================================================
000216190401
000217190401       begsr init;
000218190401
000219190401        pgmname = proc_name;
000220190401        btnExit = '0';
000221230330        //type = 'N';
000222230413
000223230413        getenv(e1envir : e1libl : e1Lib2 : envColor : e1Acnm);
000224230413
000225230413        ChkPgmAuth(pgmname : continue);
000226230413        if continue = 'N';
000227230413         exsr exit;
000228230413        endif;
000229190401
000230190401       endsr;
000231190401
000232190401      //======================================================================
