000100190401      *========================================================================
000102190401       Ctl-opt option(*noDebugIo) dftactgrp(*no);
000103190401      *========================================================================
000104230330      * DW180RB - ACH Remote On-demand Deposit Prompt
000105190401      *========================================================================
000106190401      * Date         Int  Description
000107230330      * ----------   ---  -----------------------------------------------------
000108230330      * 03/30/2023   jt   Original Creation
000112190401      *========================================================================
000113190401
000116230330       Dcl-f dw180db WorkStn Handler('PROFOUNDUI(HANDLER)');
000123190401
000124190401      *========================================================================
000125190401
000126190401       dcl-ds UploadFile Qualified;
000128190401         NumFiles Zoned(3);
000129190401         Directory Char(256);
000130190401         Files Char(256);
000131190401       End-Ds;
000132190401
000133190401       dcl-s myFileName Char(256) ;
000134190401
000135190401     d psds           sds
000136210806     d proc_name         *proc
000137190401     d user                  254    263
000138230407
000139230407     d continue        s              1
000140230407     d e1envir         s             15
000141230407     d e1libl          s             10
000142230407     d e1Lib2          s             10
000143230407     d envColor        s             10
000144230407     d e1Acnm          s             40
000145230407
000146230407     d getEnv          pr                  ExtPgm('GETENVR')
000147230407     d  e1envir                      15
000148230407     d  e1libl                       10
000149230407     d  e1Lib2                       10
000150230407     d  envColor                     10
000151230407     d  e1Acnm                       40
000152230407
000153230407     d ChkPgmAuth      pr                  extpgm('CHKPGMAUTH')
000154230407     d  pgmname                      10
000155230407     d  continue                      1
000156190401
000157230330     d dw180bcl        pr                  ExtPgm('DW180BCL')
000158230330
000159230330     d dw180rb         pi
000160230330     d* type                          1
000161190401
000162190401      //======================================================================
000163190401      // mainline
000164190401      //======================================================================
000165190401
000166190401       exsr init;
000167190401       exsr main;
000168190401       exsr exit;
000169190401
000170190401      //======================================================================
000171190401      // moin
000172190401      //======================================================================
000173190401
000174190401       begsr main;
000175190401
000176190401        Dow btnExit = '0';
000177230330
000178230330         exfmt Screen1;
000179190401
000180210120         errFile = '0';
000181190401         if btnExit = '1';
000182190401          leave;
000183190401         endif;
000184190401
000185190401         myFileName = UploadFile.Files;
000186210120
000187210120         if  UploadFile.Files > ' ';
000188230330          //type = 'Y';
000189230330           errFile = '0';
000190230330            dw180bcl();
000191230330            exfmt msgWindow;
000192230330           btnExit = '1';
000193210120          leavesr;
000194210120         else;
000195230330          //type = 'N';
000196210120          errFile = '1';
000197210120         endif;
000198190401
000199190401        enddo;
000200190401
000201190401       endsr;
000202190401
000203190401      //======================================================================
000204190401      // exit
000205190401      //======================================================================
000206190401
000207190401       begsr exit;
000208190401
000209190401        *inlr = '1';
000210190401        return;
000211190401
000212190401       endsr;
000213190401
000214190401      //======================================================================
000215190401      // init
000216190401      //======================================================================
000217190401
000218190401       begsr init;
000219190401
000220190401        pgmname = proc_name;
000221190401        btnExit = '0';
000222230330        //type = 'N';
000223230407
000224230407        getenv(e1envir : e1libl : e1Lib2 : envColor : e1Acnm);
000225230407
000226230407        ChkPgmAuth(pgmname : continue);
000227230407        if continue = 'N';
000228230407         exsr exit;
000229230407        endif;
000230190401
000231190401       endsr;
000232190401
000233190401      //======================================================================
