000100190611      *====================================================================
000101190611     h dftactgrp(*no) option(*noDebugIo) bnddir('GBSBIND')
000102210525      *====================================================================
000103210525      * DW375BR - Recover Billing Enrollment records
000104190611      *====================================================================
000105190611      * Date         Int  Description
000106190611      * ---------    ---  -------------------------------------------------
000107200731      * 07/31/2020   jt   Original Creation (re-write)
000108210525      * 05/25/2021   jt   Recompiled for DB change.
000110200731      *====================================================================
000111190611
000800200731     fdw375bd   cf   e             WorkStn Handler('PROFOUNDUI(HANDLER)')
000802190611     f                                     SFile(SFL1 : RRN)
000805190611
001103210525     fdbedtlrec uf a e           k disk    rename(bdr:mainFile)
001104200416
001105210525     fdbe834arc if   e             disk    rename(dbedtlr:archFile)
001107200731
001108210526     fdbe834arc1if   e           k disk    rename(dbedtlr:archFile1)
001109210526
001301190611      *=========================================================================
001302190611
001303190611     d psds           sds
001304190611     d proc_name         *proc
001305190611     d user                  254    263
001306190611
001307190611     d rrn             s              5i 0
001308200731     d a_mdy           s              6
001309210526     d a_mdy0000       s             10
001310210526     d a_mdy9999       s             10
001311200731     d hotime          s              6
001312200731     d hotimed         s              6  0
001313210525     d datetime        s             10
001314210525     d datec           s              8
001315210525     d timec           s              6
001316200416
001317210525     d members         pr                  ExtPgm('DW376R')
001318210525     d  sdatetime                    10
001319210525
001320200731     d dw375br         pi
001321200731     d  inDate                         d   const
001322210525     d  outTime                       6
001323200731     d  selectRec                     1
001324200731
001354190611      //========================================================================
001355190611      // mainline
001356190611      //========================================================================
001357190611
001358190611       exsr init;
001359190611       exsr main;
001360190611       exsr exit;
001361190611
001362190611      //========================================================================
001363190611      // main
001364190611      //========================================================================
001365190611
001366190611       begsr main;
001367190611
001368190611        dow btnExit = '0';
001369190611
001370190611         // Clear the subfile...
001371190611         sflclr = '1';
001372190611
001373190611         write sflctl1;
001374190611         sflclr = '0';
001375190611         rrn = 0;
001376190611
001377190611         // Load the subfile...
001378190611         exsr loadSubfile;
001379190611
001380190611         // Display the subfile.
001381190611         sfldsp = '1';
001382190611         exfmt sflctl1;
001383190611
001386190611         sfldsp = '1';
001387190611
001388200416         // Check for icon click.
001389200416         readc sfl1;
001390200731         if not %eof;
001399190611
001407200731          if checkSel = 'Y';
001409200731           exsr selected;
001410200731           checkSel = ' ';
001411200731           btnExit = '1';
001412200416          endif;
001413200416
001414210525          if selmem = '1';
001415210525           exsr getMembers;
001416210525           selmem = ' ';
001418210525          endif;
001419210525
001420200731         endif;
001421200416
001422200416        enddo;
001423190611
001424190611       endsr;
001425190611
001426190611      //========================================================================
001427190611      // load subfile
001428190611      //========================================================================
001429190611
001430190611       begsr loadSubfile;
001431190611
001432200731        setll *loval mainFile;
001435200416        read mainFile;
001436190613
001437190611        dow not %eof;
001438190611
001440200731         rrn += 1;
001441190611
001442200731         exsr moveFields;
001443200416
001444200731         write sfl1;
001446200416
001447200416        read mainfile;
001448190611        enddo;
001449190611
001452190611       endsr;
001453190611
001454190611      //========================================================================
001455190611      // move fields
001456190611      //========================================================================
001457190611
001458200416       begsr moveFields;
001459190611
001461200731        sdate = %date(odate:*mdy);
001462200731
001463200731        hotime = %char(otime) +'00';
001464200731        hotimed = %dec(hotime:6:0);
001465200731        stime = %time(hotimed:*hms);
001467210525
001468210525        datec = %editc(odate:'X');
001469210525        timec = %editc(otime:'X');
001471210525        sdatetime = %subst(datec:3:6) + %subst(timec:3:4);
001472210525
001473210525        exsr count;
001474210525        smem = o#mem;
001475200416
001476190611       endsr;
001477190611
001781190611      //========================================================================
001782200731      // create records to display
001783190611      //========================================================================
001784190611
001804200731       begsr createRecords;
001807210526
001808210526        //setll 1 archFile;
001809210526        setll (a_mdy0000) archFile1;
001810210526        read archfile1;
001811200731        dow not %eof;
001812200731
001813200731         if %subst(d3fil10:1:6) = a_mdy;
001814200731
001815200731          odate = %dec(%subst(d3fil10:1:6):6:0);
001816200731          otime = %dec(%subst(d3fil10:7:10):4:0);
001817200731
001818200731          chain ( %dec(%subst(d3fil10:1:6):6:0) :
001819200731                 %dec(%subst(d3fil10:7:10):4:0) ) mainfile;
001820200731          if not %found;
001821210525           smem = o#mem + 1;
001822200731           write mainFile;
001823200731          endif;
001824210525
001825210525          if %found;
001826210525           smem = o#mem + 1;
001828210525          endif;
001829200731
001830200731         endif;
001831210526
001832210526         if %subst(d3fil10:1:6) > a_mdy;
001833210526          leavesr;
001834210526         endif;
001835210526
001836210526        read archfile1;
001837200731        enddo;
001838200731
001839200416       endsr;
001840210525
001841210525      //========================================================================
001842210525      // record selected
001843210525      //========================================================================
001844210525
001845210525       begsr count;
001846210525
001847210525        //clear o#mem;
001848210525        chain (odate : otime) mainFile;
001849210525        if %found;
001850210525         if o#mem > 0;
001851210525          leavesr;
001852210525         endif;
001853210525        endif;
001854210525
001855210526        setll (a_mdy0000) archFile1;
001856210526        //setll 1 archFile;
001857210526        read archfile1;
001858210525        dow not %eof;
001859210525         datec = %editc(odate:'X');
001860210525         timec = %editc(otime:'X');
001861210525         datetime = %subst(datec:3:6) + %subst(timec:3:4);
001862210525         if d3fil10 = datetime;
001863210525          chain (odate : otime) mainFile;
001864210525          if %found;
001865210525           o#mem = o#mem + 1;
001866210525           update mainFile;
001867210525         endif;
001868210525         endif;
001869210526
001871210526         if %subst(d3fil10:1:6) > a_mdy;
001872210526          leavesr;
001873210526         endif;
001874210526
001875210526        read archfile1;
001876210525        enddo;
001877210525
001878210525       endsr;
001879210525
001880200731      //========================================================================
001881200731      // record selected
001882200731      //========================================================================
001883200731
001884200731       begsr selected;
001885200731
001886200731        outTime = %char(stime);
001887200731        selectRec = 'Y';
001888200731
001889200731       endsr;
001890200731
001891210525      //========================================================================
001892210525      // get members
001893210525      //========================================================================
001894210525
001895210525       begsr getMembers;
001896210525
001897210525        members(sdateTime);
001898210525
001899210525       endsr;
001900210525
070501190611      //========================================================================
070502190611      // exit
070503190611      //========================================================================
070504190611
070505190611       begsr exit;
070506190611
070507190611        *inlr = '1';
070508190611        return;
070509190611
070510190611       endsr;
070511190611
070512190611      //========================================================================
070513190611      // init
070514190611      //========================================================================
070515190611
070516190611       begsr init;
070517190611
070518200731        btnExit = '0';
070529200731        checkSel = '0';
070530200731        selectRec = ' ';
070531190611
070532190611        sfldsp = '0';
070533190611        sflclr = '0';
070534190611
070535190611        pgmname = proc_name;
070536190611
070537200731        title = 'Recover Billing Enrollment Records';
070538200731
070539200731        a_mdy = %char(inDate : *mdy0);
070540210526        a_mdy0000 = %char(inDate : *mdy0) + '0000';
070541210526        a_mdy9999 = %char(inDate : *mdy0) + '9999';
070542200731
070543200731        exsr createRecords;
070544190611
070545190611       endsr;
070546190611
070547190611      //========================================================================
