000100190611      *====================================================================
000101190611     h dftactgrp(*no) option(*noDebugIo) bnddir('GBSBIND')
000102210525      *====================================================================
000103210525      * DW376R - Recover Billing Enrollment records (members)
000104190611      *====================================================================
000105190611      * Date         Int  Description
000106190611      * ---------    ---  -------------------------------------------------
000107210526      * 05/25/2021   jt   Original Creation
000110200731      *====================================================================
000111190611
000800210525     fdw376d    cf   e             WorkStn Handler('PROFOUNDUI(HANDLER)')
000802190611     f                                     SFile(SFL1 : RRN)
000805190611
001105210525     fdbe834arc1if   e           k disk    rename(dbedtlr:archFile)
001106200731
001301190611      *=========================================================================
001302190611
001303190611     d psds           sds
001304190611     d proc_name         *proc
001305190611     d user                  254    263
001306190611
001307190611     d rrn             s              5i 0
001313210525     d datec           s              8
001314210525     d timec           s              6
001315200416
001316210525     d dw376r          pi
001317210525     d  datetime                     10
001320200731
001354190611      //========================================================================
001355190611      // mainline
001356190611      //========================================================================
001357190611
001358190611       exsr init;
001359190611       exsr main;
001360190611       exsr exit;
001361190611
001362190611      //========================================================================
001363190611      // main
001364190611      //========================================================================
001365190611
001366190611       begsr main;
001367190611
001368190611        dow btnExit = '0';
001369190611
001370190611         // Clear the subfile...
001371190611         sflclr = '1';
001372190611
001373190611         write sflctl1;
001374190611         sflclr = '0';
001375190611         rrn = 0;
001376190611
001377190611         // Load the subfile...
001378190611         exsr loadSubfile;
001379190611
001380190611         // Display the subfile.
001381210525         sfldsp = '1';
001382190611         exfmt sflctl1;
001383190611
001386190611         sfldsp = '1';
001387190611
001388200416         // Check for icon click.
001389200416         readc sfl1;
001399190611
001418200416        enddo;
001419190611
001420190611       endsr;
001421190611
001422190611      //========================================================================
001423190611      // load subfile
001424190611      //========================================================================
001425210525
001426190611       begsr loadSubfile;
001427210525
001431210525        setll (datetime) archFile;
001435210525        reade (datetime) archFile;
001436210525
001437190611        dow not %eof;
001438190611
001439210525        //if d3fil10 = datetime;
001440210525          rrn += 1;
001442210525          exsr moveFields;
001444210525          write sfl1;
001446210525         //endif;
001447210525
001448210525        reade (datetime) archFile;
001449190611        enddo;
001450190611
001452190611       endsr;
001453190611
001454190611      //========================================================================
001455190611      // move fields
001456190611      //========================================================================
001457190611
001458200416       begsr moveFields;
001459190611
001461210525        sssn = d3sub;
001463210525        slast = d3lst;
001464210525        sfirst = d3fst;
001470200416
001471190611       endsr;
001472190611
070501190611      //========================================================================
070502190611      // exit
070503190611      //========================================================================
070504190611
070505190611       begsr exit;
070506190611
070507190611        *inlr = '1';
070508190611        return;
070509190611
070510190611       endsr;
070511190611
070512190611      //========================================================================
070513190611      // init
070514190611      //========================================================================
070515190611
070516190611       begsr init;
070517190611
070518200731        btnExit = '0';
070531190611
070535190611        pgmname = proc_name;
070536190611
070537210525        title = 'Recover Billing Enrollment Members';
070538200731
070544190611       endsr;
070545190611
070546190611      //========================================================================
