0001000204020002  *****************************************************************************
000200120131      * DW434D     Group Benefit Services                                         *
000300020402      *            WRITTEN BY - R.L.J.                                            *
000400120131      *            DATE - 01/2012                                                 *
000500120131      *  DESCRIPTION - Create MBI update files using GBS FSA Chg file             *
000600120131      * NOTE!! When you make a chg to FSxxP files - change D-specs here           *
0007000204020002  *****************************************************************************
0008000204020015  *  Change Log:                                                              *
000900020402      *                                                                *
0010009102150018 F******************************************************************
0011001201310020 FFSCHGP    IF   E           K DISK
0012001201310020 FFSCURP    IF   E           K DISK
0013001201310020 FFSIAP     UF   E             DISK
0014001201310020 FFSIBP     O    E             DISK
0015001201310020 FFSCMBP    O    E             DISK
0016000707230025  *
0017000204030250 D                 DS
0018001201310251 D  fcarea                 1      3  0
0019000910020251 D   areac                 1      3
0020000910020025  *
0021000910020250 D                 DS
0022001201310251 D  fxcgrp#                1     15
0023000910020251 D   cgrp4                 1      4
0024000910020025  *
0025000910020250 D                 DS
0026001201310251 D  fcgrp#                 1     15
0027000910020251 D   grp4                  1      4
0028001004210251 D   grp1                  1      1
0029001004210251 D   grp24                 2      4
0030000912030251 D   grp12                 1     12
0031001005240251 D   grp212                2     12
0032000912030251 D   grp13                13     15
0033001003260025  *
0034001003260250 D                 DS
0035001003260251 D  mbgrp#                 1      9
0036001003260251 D   bgrp1                 1      3    INZ('GBS')
0037001003260251 D   bgrp2                 4      7
0038000805150029  *
0039000805150250 D                 DS
0040001201310251 D  fcphn#                 1      7  0
0041000910010251 D   p3                    1      3
0042000910010251 D   p4                    4      7
0043000910010029  *
0044000910010250 D                 DS
0045000910010251 D  curkey                 1     11  0
0046001201310251 D   fcmid#                1      9  0
0047001201310251 D   fcmida                1      9
0048001201310251 D   fcseq#               10     11  0
0049000505250029  *
0050000510120250 D                 DS
0051000505250251 D  chgkey                 1     11  0
0052001201310251 D   fxmid#                1      9  0
0053001201310251 D   fxseq#               10     11  0
0054000807310029  *
0055000807310250 D                 DS
0056000807310251 D  hldkey                 1     11  0 INZ(0)
0057000807310251 D  astrsk                12     22    INZ('***********')
0058000807310029  *
0059000809150250 D                 DS
0060000809150251 D  curact                 1    214
0061001201310251 D   fctrust               1      3  0
0062001201310251 D   fcsub                 4      6  0
0063001201310251 D   fcacct                7     10  0
0064001201310251 D   fcacnm               11     50
0065000711080029  *
0066000711080250 D                 DS
006700091002     D  recct                  1      6S 0
006800091002     D  reccta                 1      6
006900090108    * *
0070000901080053 D                 DS
0071000910020054 D  wkamt          S              9
0072000910130251 D  cntf           S              2  0 INZ(0)
0073000910130251 D  cntt           S              2  0 INZ(0)
0074000910130251 D  cntl           S              2  0 INZ(0)
0075000910130251 D  fnm1           S              1
0076000711080111  *
0077000910080029  *   Format Output Records
0078000910080250 D                 DS
0079001911210251 D  ibrec                  1    316
0080000910080251 D   ibrcid                1      2
0081000910080251 D   ibtpa                 3      8
0082000910080251 D   ibemlr                9     17
0083000910080251 D   ibemly               18     26
0084000910080251 D   iblnme               27     52
0085000910080251 D   ibfnme               53     71
0086000910080251 D   ibmi                 72     72
0087000910080251 D   ibphn#               73     91
0088000910080251 D   ibadr1               92    127
0089000910080251 D   ibadr2              128    163
0090000910080251 D   ibcity              164    183
0091000910080251 D   ibst                184    193
0092000910080251 D   ibzip               194    202
0093000910080251 D   ibcnty              203    205
0094000910080251 D   ibgndr              206    206
0095000910080251 D   ibbrdt              207    214
0096000910160251 D   ibrmth              215    215
0097001911210251 D   ibemal              216    315
0098001911210251 D   ibfill              316    316
0099000910080291  *
010000080919     C     mbckey        klist
010100120131     C                   kfld                    fxmid#
010200120131     C                   kfld                    fxseq#
0103000508240291  *
0104000910020296 C                   dou       *in21 = '1'
0105001201310297 C                   read      fschgp                                 21
0106001010110291  *
0107001010110296 C                   if        *in21 = '0'
0108001003120291  *
0109001201310296 C                   If        fxsts = 'C' and fxseq# = 0
0110000809260291  *
0111001201310296 C                   If        fxcadr1 <> *blanks or
0112001201310296 C                             fxcadr2 <> *blanks or
0113001201310296 C                             fxccity <> *blanks or
0114001201310296 C                             fxcst <> *blanks or
0115001201310296 C                             fxhlnme <> *blanks or
0116001201310296 C                             fxhfnme <> *blanks or
0117001911210296 C                             fxcemal <> *blanks or
0118001201310296 C                             fxhmi <> *blanks or
0119001201310296 C                             fxcbrdt <> 0 or
0120001201310296 C                             fxczip <> 0 or
0121001201310296 C                             fxcphn# <> 0
0122001010270291  *      Skip AAAA and AAAQ grps - GBS
0123001010270296 C                   If        cgrp4 = 'AAAA' or cgrp4 = 'AAAQ'
0124000910020296 C                   iter
0125000910020296 C                   endif
0126001010270291  *      DEBUG
0127001201310296 C                   If        fxmid# = 212061187
0128001201310296 C                   movel     fxmid#        fxmid#
0129001010270291  *      Skip this SSN
0130001010270296 C                   iter
0131001010270296 C                   endif
013200080926      *
0133000807250296 C                   if        hldkey <> chgkey
0134000807250297 C                   eval      hldkey = chgkey
013500091001     C                   exsr      putnew
013600070605     C                   endif
013700080725     C                   else
013800091001      *
013900080725     C                   endif
014000080725     C                   endif
014100091002      *
014200101011     C                   endif
014300091002     C                   enddo
014400091002      *
014500091002     C                   movel     reccta        iarcnt
014600120131     C                   update    fsiar
014700091002      *
0148000910020297 C                   movel     '1'           *inlr
0149000910020297 C                   return
0150000705300107  ********************************************************************************
0151000705300107  *
0152000910010107  *     PUTNEW - Write the New record to MBI Import files
0153000705300107  *
0154000705300107  ********************************************************************************
015500091001     C     putnew        begsr
0156001201310297 C     mbckey        setll     fscurp                             21
0157000807250296 C                   dou       *in21 = '1'
0158001201310297 C                   read      fscurp                                 21
0159001201310296 C                   If        *in21 = '0' and fcmid# = fxmid# and
0160001201310296 C                             fcseq# = fxseq#
0161000807250297 C                   leave
0162000807250297 C                   else
0163000706050297 C                   leavesr
0164000706050297 C                   endif
0165000706050297 C                   enddo
0166000910010291  *    IB rec
016700100421     C                   If        grp1 = '*'
016800100421     C                   movel(P)  grp24         bgrp2
016900100421     C                   else
017000100421     C                   movel     grp4          bgrp2
017100100421     C                   endif
017200091001     C                   movel(P)  mbgrp#        ibemlr
017300120131     C                   movel     fcmid#        ibemly
017400120131     C                   movel(P)  fclnme        iblnme
017500120131     C                   movel(P)  fcfnme        ibfnme
017600120131     C                   movel     fcmi          ibmi
017700091013     C                   exsr      namrtn
017800091002     C                   eval      ibphn# = '(' + areac + ')' + p3 + '-' + p4
017900120131     C                   movel(P)  fcadr1        ibadr1
018000120131     C                   movel(P)  fcadr2        ibadr2
018100191121     C                   movel(P)  fcemal        ibemal
018200120131     C                   movel(P)  fccity        ibcity
018300120131     C                   movel(P)  fcst          ibst
018400120131     C                   movel(P)  fczip         ibzip
018500091002     C                   eval      ibcnty = 'US '
018600120131     C                   If        fcgndr = 'M'
018700091001     C                   eval      ibgndr = '1'
018800091001     C                   else
018900091001     C                   eval      ibgndr = '2'
019000091001     C                   endif
019100120131     C                   movel     fcbrdt        ibbrdt
019200091016     C                   eval      ibrmth = '1'
019300191121    * *
019400191121     C                   eval      ibfill = 'X'
019500191121    * *     Write IB rec
019600120131     C                   write     fsibr
019700120131     C                   clear                   fscmbr
019800120131     C                   movel     ibrec         fcdata
019900120131     C                   write     fscmbr
020000091001     C                   eval      recct = recct + 1
020100070530      *
020200070530     C                   endsr
0203000711080107  ********************************************************************************
0204000711080107  *
0205000910130107  *     NAMRTN - Reduce total Name length to 20 chars
0206000711080107  *
0207000711080107  ********************************************************************************
0208000910130296 C     namrtn        begsr
0209000910130296 C                   eval      cntl = %scan('  ':iblnme:2)
0210000910130296 C                   if        cntl = 0
0211000910130296 C                   eval      cntl = 25
0212000910130296 C                   else
0213000910130296 C                   eval      cntl = cntl - 1
0214000910130296 C                   endif
0215000910130291  *      If LNAM is GT 18 - Just use last name
0216000910130296 C                   if        cntl > 18
0217000910130296 C                   movel     *blanks       ibfnme
0218000910130296 C                   movel     *blanks       ibmi
0219000910130296 C                   leavesr
0220000910130296 C                   endif
0221000910130291  *
0222000910130296 C                   eval      cntf = %scan('  ':ibfnme:2)
0223000910130296 C                   if        cntf = 0
0224000910130296 C                   eval      cntf = 18
0225000910130296 C                   else
0226000910130296 C                   eval      cntf = cntf - 1
0227000910130296 C                   endif
0228000910130291  *   If LNAM + FNAM + 1 > 18 - remove MI
0229000910130296 C                   eval      cntt = cntl + cntf + 1
0230000910130296 C                   if        cntt > 18
0231000910130296 C                   eval      ibmi = ' '
0232000910130296 C                   endif
0233000910130291  *   If LNAM + FNAM + 1 > 20 - remove MI and use 1 char FNAM
0234000910130291  *
0235000910130296 C                   if        cntt > 20
0236000910130296 C                   movel     ibfnme        fnm1
0237000910130296 C                   movel(P)  fnm1          ibfnme
0238000910130296 C                   endif
0239000910130296 C                   endsr
0240000910130107  ********************************************************************************
0241000910130107  *
0242000910130107  *     INZSR - Preprocessing
0243000910130107  *
0244000910130107  ********************************************************************************
024500071108     C     *Inzsr        Begsr
024600091001    * *   SET DEFAULT FIELDS
0247001201310297 C                   clear                   fsibr
0248001001150297 C                   eval      ibrcid = 'IB'
0249001001150297 C                   eval      ibtpa = 'T00025'
025000091001    * *   Get IA rec
025100120131     C                   read      fsiap
025200101202     C                   movel     iarcnt        reccta
025300091001    * *
025400091001     C                   endsr
