0001000204020002  *****************************************************************************
000200100518      * DW448      Group Benefit Services                                         *
000300020402      *            WRITTEN BY - R.L.J.                                            *
000400100518      *            DATE - 05/2010                                                 *
000500100518      *  DESCRIPTION - Create MBI update files for Group Terms                    *
000600100430      * NOTE!! When you make a chg to MBICP files - change D-specs here           *
0007000204020002  *****************************************************************************
0008000204020015  *  Change Log:                                                              *
000900020402      *                                                                *
0010009102150018 F******************************************************************
0011001004290020 FMBCUR2L   IF   E           K DISK
0012000910010020 FMBIAP     UF   E             DISK
0013000910010020 FMBICP     O    E             DISK
0014000910080020 FMBCMBP    O    E             DISK
0015000707230025  *
0016000204030250 D                 DS
0017000910020251 D  mcarea                 1      3  0
0018000910020251 D   areac                 1      3
0019000910020025  *
0020000910020250 D                 DS
0021001005140251 D  kgrp                   1     15
0022001005140251 D   kgrp4                 1      4
0023001005140025  *
0024001005140250 D                 DS
0025001005140251 D  mcgrp#                 1     15
0026001005140251 D   grp4                  1      4
0027001004210251 D   grp1                  1      1
0028001004210251 D   grp24                 2      4
0029000912030251 D   grp12                 1     12
0030000912030251 D   grp13                13     15
0031001003260025  *
0032001003260250 D                 DS
0033001003260251 D  mbgrp#                 1      9
0034001003260251 D   bgrp1                 1      3    INZ('GBS')
0035001003260251 D   bgrp2                 4      7
0036000711080029  *
0037000711080250 D                 DS
003800091002     D  recct                  1      6S 0
003900091002     D  reccta                 1      6
004000090108    * *
0041000901080053 D                 DS
0042000910020054 D  wkamt          S              9
0043001005180054 D  wkdat          S               D   DATFMT(*ISO)
0044000910130251 D  cntf           S              2  0 INZ(0)
0045000910130251 D  cntt           S              2  0 INZ(0)
0046000910130251 D  cntl           S              2  0 INZ(0)
0047000910130251 D  fnm1           S              1
0048000711080111  *
0049000910080029  *   Format Output Records
0050000910080250 D                 DS
0051000910150251 D  icrec                  1    138
0052000910080251 D   icrcid                1      2
0053000910080251 D   ictpa                 3      8
0054000910080251 D   icemlr                9     17
0055000910150251 D   icplan               18     35
0056000912030251 D     pln12              18     29
0057000912030251 D     pln4               18     21
0058000912030251 D     pln3               22     24
0059000910150251 D   icemly               36     44
0060000910150251 D   icactp               45     48
0061000910150251 D   icpeff               49     56
0062000910150251 D   icptrm               57     64
0063000910150251 D   icsts                65     65
0064000910150251 D   iceypp               66     84
0065000910150251 D   icerpp               85    103
0066000910150251 D   icefrf              104    122
0067000910150251 D   icetrm              123    130
0068001005180251 D   icetrmn             123    130  0
0069000910150251 D   iceeff              131    138
0070000508240291  *
0071001004300291  *         Group shit
0072001006090296 C                   movel(P)  '9237'        kgrp
0073001004290297 C     kgrp          setll     mbcur2l                                21
0074000910020296 C                   dou       *in21 = '1'
0075001005140297 C                   read      mbcur2l                                21
0076000911040291  *          Group shit
0077001005140296 C                   if        *in21 = '0'
0078000809260291  *
0079001005140296 C                   if        grp4 <> kgrp4
0080001005140296 C                   eval      *in21 = '1'
0081001005140296 C                   else
0082001005140291  *
0083001005180296 C                   If        mcseq# = 0
0084000809260291  *      DEBUG
0085001004290296 C                   If        mcmid# = 212061187
0086001004290296 C                   movel     mcmid#        mcmid#
0087000910020296 C                   endif
0088001005190291  *      Only 1 mbr process - Mbr shit
0089001006010296 C*****              If        mcmid# <> 213629327
0090001006010296 C*                  iter
0091001006010296 C*****              endif
009200080926      *
009300100609     C                   if        mctfdt = 0
009400100609      *
009500100429     C                   exsr      putc
009600091001      *
009700100609     C**************     exsr      putz
009800100518      *
009900080725     C                   endif
010000100609      *
010100100609     C                   endif
010200100514     C                   endif
010300080725     C                   endif
010400091002      *
010500091002     C                   enddo
010600100429      *
010700100429     C                   eval      recct = recct + 1
010800100429     C                   movel     reccta        iarcnt
010900100429     C                   update    mbiar
011000091002      *
0111000910020297 C                   movel     '1'           *inlr
0112000910020297 C                   return
0113000705300107  ********************************************************************************
0114000705300107  *
0115001004290107  *     PUTC - Write the New record to MBI Import files
0116000705300107  *
0117000705300107  ********************************************************************************
011800100429     C     putc          begsr
011900070530    * *
0120000910010291  *     IC Rec
012100100429     C                   movel     grp4          bgrp2
012200100429     C                   movel(P)  mbgrp#        icemlr
012300091001     C                   movel     mcmid#        icemly
012400091001     C                   movel(P)  'HRA'         icactp
012500091203     C                   if        grp13 <> '   '
012600091204     C******?            movel(P)  grp13         pln3
012700100315     C                   movel(P)  grp13         icactp
012800091014     C                   endif
012900100315      *
013000100315     C                   movel(P)  grp12         pln12
013100100315     C                   if        pln3 = *blanks
013200100315     C                   movel(P)  'HRA'         pln3
013300100315     C                   endif
013400100315      *
013500100315     C                   movel     mcpefd        icpeff
013600100518     C                   movel     mcptrd        icptrm
013700100609     C                   eval      icsts = '2'
013800091001     C                   move      '0.00'        iceypp
013900091001     C                   move      '0.00'        icerpp
014000091002     C                   eval      wkamt = %EDITW(mcrate:'      .  ')
014100091002     C                   move      wkamt         icefrf
014200091002     C                   if        mctfdt = 0
014300091002     C                   eval      icetrm = *blanks
014400091002     C                   else
014500100518     C                   movel     mctfdt        wkdat
014600100518     C                   subdur    1:*D          wkdat
014700120918     C******             movel     wkdat         icetrmn
014800091002     C                   endif
014900100429     C*******            movel     mcefdt        iceeff
015000100429     C                   movel     icpeff        iceeff
015100091001    * *     Write IC rec
015200091001     C                   write     mbicr
015300091008     C                   clear                   mbcmbr
015400091008     C                   movel     icrec         mcdata
015500091008     C                   write     mbcmbr
015600091001     C                   eval      recct = recct + 1
015700091001    * *
015800100429     C                   endsr
0159000910130107  ********************************************************************************
0160000910130107  *
0161000910130107  *     INZSR - Preprocessing
0162000910130107  *
0163000910130107  ********************************************************************************
016400071108     C     *Inzsr        Begsr
016500091001    * *   SET DEFAULT FIELDS
0166000910010297 C                   clear                   mbicr
0167001001150297 C                   eval      icrcid = 'IC'
0168001001150297 C                   eval      ictpa = 'T00025'
016900091001    * *   Get IA rec
017000091001     C                   read      mbiap
0171000910010297 C                   eval      recct = 0
017200091001    * *
017300091001     C                   endsr
