0001000204020002  *****************************************************************************
000200100518      * DW448      Group Benefit Services                                         *
000300020402      *            WRITTEN BY - R.L.J.                                            *
000400100518      *            DATE - 05/2010                                                 *
000500100518      *  DESCRIPTION - Create MBI update files for Group Terms                    *
000600100430      * NOTE!! When you make a chg to MBICP files - change D-specs here           *
0007000204020002  *****************************************************************************
0008000204020015  *  Change Log:                                                              *
000900020402      *                                                                *
0010009102150018 F******************************************************************
0011001004290020 FMBCUR2L   IF   E           K DISK
0012000910010020 FMBIAP     UF   E             DISK
0013000910010020 FMBICP     O    E             DISK
0014001005180020 FMBIZP     O    E             DISK
0015000910080020 FMBCMBP    O    E             DISK
0016000707230025  *
0017000204030250 D                 DS
0018000910020251 D  mcarea                 1      3  0
0019000910020251 D   areac                 1      3
0020000910020025  *
0021000910020250 D                 DS
0022001005140251 D  kgrp                   1     15
0023001005140251 D   kgrp4                 1      4
0024001005140025  *
0025001005140250 D                 DS
0026001005140251 D  mcgrp#                 1     15
0027001005140251 D   grp4                  1      4
0028001004210251 D   grp1                  1      1
0029001004210251 D   grp24                 2      4
0030000912030251 D   grp12                 1     12
0031000912030251 D   grp13                13     15
0032001003260025  *
0033001003260250 D                 DS
0034001003260251 D  mbgrp#                 1      9
0035001003260251 D   bgrp1                 1      3    INZ('GBS')
0036001003260251 D   bgrp2                 4      7
0037000711080029  *
0038000711080250 D                 DS
003900091002     D  recct                  1      6S 0
004000091002     D  reccta                 1      6
004100090108    * *
0042000901080053 D                 DS
0043000910020054 D  wkamt          S              9
0044001005180054 D  wkdat          S               D   DATFMT(*ISO)
0045000910130251 D  cntf           S              2  0 INZ(0)
0046000910130251 D  cntt           S              2  0 INZ(0)
0047000910130251 D  cntl           S              2  0 INZ(0)
0048000910130251 D  fnm1           S              1
0049000711080111  *
0050000910080029  *   Format Output Records
0051000910080250 D                 DS
0052000910150251 D  icrec                  1    138
0053000910080251 D   icrcid                1      2
0054000910080251 D   ictpa                 3      8
0055000910080251 D   icemlr                9     17
0056000910150251 D   icplan               18     35
0057000912030251 D     pln12              18     29
0058000912030251 D     pln4               18     21
0059000912030251 D     pln3               22     24
0060000910150251 D   icemly               36     44
0061000910150251 D   icactp               45     48
0062000910150251 D   icpeff               49     56
0063000910150251 D   icptrm               57     64
0064000910150251 D   icsts                65     65
0065000910150251 D   iceypp               66     84
0066000910150251 D   icerpp               85    103
0067000910150251 D   icefrf              104    122
0068000910150251 D   icetrm              123    130
0069001005180251 D   icetrmn             123    130  0
0070000910150251 D   iceeff              131    138
0071000508240291  *
0072001005180250 D                 DS
0073001005180251 D  izrec                  1     42
0074001005180251 D   izrcid                1      2
0075001005180251 D   iztpa                 3      8
0076001005180251 D   izemlr                9     17
0077001005180251 D   izemly               18     26
0078001005180251 D   iztrm                27     34
0079001005180251 D   iztrmn               27     34  0
0080001005180251 D   izelig               35     42
0081001005180291  *
0082001004300291  *         Group shit
0083001006110296 C                   movel(P)  '9409'        kgrp
0084001004290297 C     kgrp          setll     mbcur2l                                21
0085000910020296 C                   dou       *in21 = '1'
0086001005140297 C                   read      mbcur2l                                21
0087000911040291  *          Group shit
0088001005140296 C                   if        *in21 = '0'
0089000809260291  *
0090001005140296 C                   if        grp4 <> kgrp4
0091001005140296 C                   eval      *in21 = '1'
0092001005140296 C                   else
0093001005140291  *
0094001005180296 C                   If        mcseq# = 0
0095000809260291  *      DEBUG
0096001004290296 C                   If        mcmid# = 212061187
0097001004290296 C                   movel     mcmid#        mcmid#
0098000910020296 C                   endif
0099001005190291  *      Only 1 mbr process - Mbr shit
0100001006010296 C*****              If        mcmid# <> 213629327
0101001006010296 C*                  iter
0102001006010296 C*****              endif
010300080926      *
010400100429     C                   exsr      putc
010500091001      *
010600100518     C                   exsr      putz
010700100518      *
010800080725     C                   endif
010900100514     C                   endif
011000080725     C                   endif
011100091002      *
011200091002     C                   enddo
011300100429      *
011400100429     C                   eval      recct = recct + 1
011500100429     C                   movel     reccta        iarcnt
011600100429     C                   update    mbiar
011700091002      *
0118000910020297 C                   movel     '1'           *inlr
0119000910020297 C                   return
0120000705300107  ********************************************************************************
0121000705300107  *
0122001004290107  *     PUTC - Write the New record to MBI Import files
0123000705300107  *
0124000705300107  ********************************************************************************
012500100429     C     putc          begsr
012600070530    * *
0127000910010291  *     IC Rec
012800100429     C                   movel     grp4          bgrp2
012900100429     C                   movel(P)  mbgrp#        icemlr
013000091001     C                   movel     mcmid#        icemly
013100091001     C                   movel(P)  'HRA'         icactp
013200091203     C                   if        grp13 <> '   '
013300091204     C******?            movel(P)  grp13         pln3
013400100315     C                   movel(P)  grp13         icactp
013500091014     C                   endif
013600100315      *
013700100315     C                   movel(P)  grp12         pln12
013800100315     C                   if        pln3 = *blanks
013900100315     C                   movel(P)  'HRA'         pln3
014000100315     C                   endif
014100100315      *
014200100315     C                   movel     mcpefd        icpeff
014300100518     C                   movel     mcptrd        icptrm
014400100518     C                   eval      icsts = '5'
014500091001     C                   move      '0.00'        iceypp
014600091001     C                   move      '0.00'        icerpp
014700091002     C                   eval      wkamt = %EDITW(mcrate:'      .  ')
014800091002     C                   move      wkamt         icefrf
014900091002     C                   if        mctfdt = 0
015000091002     C                   eval      icetrm = *blanks
015100091002     C                   else
015200100518     C                   movel     mctfdt        wkdat
015300100518     C                   subdur    1:*D          wkdat
015400120918     C******             movel     wkdat         icetrmn
015500091002     C                   endif
015600100429     C*******            movel     mcefdt        iceeff
015700100429     C                   movel     icpeff        iceeff
015800091001    * *     Write IC rec
015900091001     C                   write     mbicr
016000091008     C                   clear                   mbcmbr
016100091008     C                   movel     icrec         mcdata
016200091008     C                   write     mbcmbr
016300091001     C                   eval      recct = recct + 1
016400091001    * *
016500100429     C                   endsr
0166001005180107  ********************************************************************************
0167001005180107  *
0168001005180107  *     PUTZ - Write the New record to MBI Import files
0169001005180107  *
0170001005180107  ********************************************************************************
017100100518     C     putz          begsr
0172001005180291  *     IZ Rec
017300100518     C                   movel(P)  mbgrp#        izemlr
017400100518     C                   movel     mcmid#        izemly
017500100518     C                   if        mctfdt = 0
017600100518     C                   eval      iztrm = *blanks
017700100518     C                   else
017800100518     C                   movel     mctfdt        wkdat
017900100518     C                   subdur    1:*D          wkdat
018000100518     C                   movel     wkdat         iztrmn
018100100518     C                   endif
018200100518     C                   movel     mcefdt        izelig
018300100518    * *     Write IZ rec
018400100518     C                   write     mbizr
018500100518     C                   clear                   mbcmbr
018600100518     C                   movel     izrec         mcdata
018700100518     C                   write     mbcmbr
018800100518     C                   eval      recct = recct + 1
018900100518      *
019000100518     C                   endsr
0191000910130107  ********************************************************************************
0192000910130107  *
0193000910130107  *     INZSR - Preprocessing
0194000910130107  *
0195000910130107  ********************************************************************************
019600071108     C     *Inzsr        Begsr
019700091001    * *   SET DEFAULT FIELDS
0198000910010297 C                   clear                   mbicr
0199001005180297 C                   clear                   mbizr
0200001001150297 C                   eval      icrcid = 'IC'
0201001005180297 C                   eval      izrcid = 'IZ'
0202001001150297 C                   eval      ictpa = 'T00025'
0203001005180297 C                   eval      iztpa = 'T00025'
020400091001    * *   Get IA rec
020500091001     C                   read      mbiap
0206000910010297 C                   eval      recct = 0
020700091001    * *
020800091001     C                   endsr
