0001000204020002  *****************************************************************************
000200090226      * DW446      Group Benefit Services                                         *
000300020402      *            WRITTEN BY - R.L.J.                                            *
000400090226      *            DATE - 02/2009                                                 *
000500020403      *  DESCRIPTION - Compare Hold file with Current file to produce             *
000600050525      *                Change file                                                *
0007000204020002  *****************************************************************************
0008000204020015  *  Change Log:                                                              *
000900020402      *                                                                *
0010009102150018 F******************************************************************
0011001004220020 FMBCUR2P   IP   E             DISK
0012000902260020 FDCOV1     IF   E           K DISK
0013000902260020 FPLNMST    IF   E           K DISK
0014000902260020 FMBFNMPP   O  A E             DISK
001500090226      *
001600090226     C     dckey         klist
001700090226     C                   kfld                    mcmid#
001800090226     C                   kfld                    mcseq#
001900090226      *
002000090226     C     plkey         klist
002100090226     C                   kfld                    dvtrst
002200090226     C                   kfld                    dvsub#
002300090226     C                   kfld                    dvplan
002400080904      *
002500090226     C     ' JR'         scan      mcfnme                                 21
0026000807210296 C                   If        *in21 = '1'
0027000902260296 C                   exsr      lkpln
0028000303310296 C                   endif
002900090226      *
003000090226     C     ' SR'         scan      mcfnme                                 21
0031000902260296 C                   If        *in21 = '1'
0032000902260296 C                   exsr      lkpln
0033000902260296 C                   endif
003400090226      *
003500090226     C     ' II'         scan      mcfnme                                 21
0036000902260296 C                   If        *in21 = '1'
0037000902260296 C                   exsr      lkpln
0038000902260296 C                   endif
003900090226      *
004000090226     C     ' IV'         scan      mcfnme                                 21
0041000902260296 C                   If        *in21 = '1'
0042000902260296 C                   exsr      lkpln
0043000902260296 C                   endif
0044000902260107  ********************************************************************************
004500090226     C     lkpln         begsr
0046000902260297 C     dckey         setll     dcov1                              33
0047000902260296 C                   dou       *in33 = '1'
0048000902260297 C     dckey         reade     dcov1                                  33
0049000902260296 C                   If        *in33 = '0'
0050000902260291  *
0051000902260297 C     plkey         chain     plnmst                             34
0052000902260296 C                   If        *in34 = '0'and plncat = 'PMM'
0053000902260291 C                   eval      mcmpln = plplan
0054000902260291 C                   eval      mcmpds = pdescr
0055000902260291 C                   eval      mcterm = ccandt
0056000902260291 C                   write     mbfnmpr
0057000902260291 C                   endif
0058000508240291  *
0059000902260291 C                   endif
0060000902260291  *
0061000902260291 C                   enddo
0062000902260291 C                   endsr
