000100200922       Ctl-opt option(*nodebugio:*srcstmt:*nounref)
000102200922         bnddir('GBSBIND');
000103200921
000104200921      *-------------------------------------------------------------------------
000105200921      *
000106211207      *  Description: Maintain the EASE Class File.
000107200921      *  Programmer.: Brian Rees
000108200921      *  Date.......: 09/21/2020
000109200921      *
000110200921      *-------------------------------------------------------------------------
000111200921
000112200921      *-------------------------------------------------------------------------
000113200921      *
000114200921      * Declare Files
000115200921      *
000116200921      *-------------------------------------------------------------------------
000117200922       Dcl-f EaseClasD WorkStn
000118200921          Handler('PROFOUNDUI(HANDLER)')
000119200921          SFILE(LstSfl:rrn);
000120200921
000121200921       Dcl-f AccMst keyed ExtDesc('F.ACCMST') ExtFile(*extdesc);
000122200922       dcl-f EaseClasL1 keyed usage(*Update:*output:*input:*Delete);
000123200921
000124200921
000125200921
000126200921
000127200921      *-------------------------------------------------------------------------
000128200921      *
000129200921      * Global Variables
000130200921      *
000131200921      *-------------------------------------------------------------------------
000132200921
000133200921       dcl-ds pgmd
000134200921          ExtName('IOPGMD') PSDS;
000135200922         @pgmq *proc;
000136200921       end-ds;
000137200921
000138200921
000139200921       dcl-s rrn Zoned(5);
000140200921
000155211207       dcl-s  pTrst Zoned(3);
000156211207       dcl-s  pSub  Zoned(3);
000157211207       dcl-s  pAcct Zoned(4);
000158211207
000159211207       dcl-s Load_1Group Char(1);
000160211207
000161211207      *-------------------------------------------------------------------------
000162211207      *
000163211207      * *Entry Procedure
000164211207      *
000165211207      *-------------------------------------------------------------------------
000166211207       Dcl-pr Main ExtPgm;
000167211207         *N  Char(10) Options(*NoPass);
000168211207       End-Pr;
000169211207
000170211207       dcl-pi Main;
000171211207         pKey Char(10) Options(*NoPass);
000172211207       End-Pi;
000173200921
000174200921
000175211207      *-------------------------------------------------------------------------
000176211207      *
000177211207      * Initialize
000178211207      *
000179211207      *-------------------------------------------------------------------------
000180211207         Load_1Group = 'N';
000181211207
000182211207         if %Parms > 0;
000183211207           pTrst = %Dec( %Subst( pKey : 1 : 3 ) : 3 : 0 );
000184211207           pSub  = %Dec( %Subst( pKey : 4 : 3 ) : 3 : 0 );
000185211207           pAcct = %Dec( %Subst( pKey : 7 : 4 ) : 4 : 0 );
000186211207
000187211207           Load_1Group = 'Y';
000188211207         EndIf;
000189211207
000190211207
000191200921      *-------------------------------------------------------------------------
000192200921      *
000193200921      * Mainline Program
000194200921      *
000195200921      *-------------------------------------------------------------------------
000200200921       Dou btnExit = *on;
000201200921
000202200922         ClearS1();
000203211207
000204200922         LoadS1();
000205200921
000206211207         exfmt LstCtl;
000207200921
000208200921
000209200922         //?Process Selections
000210200922         Select;
000211200921
000212200921
000213200922         When btnReset = *on;
000214200922           s1Search = *blanks;
000215200921
000216200922         other;
000217200922           ReadChangedS1();
000218200921
000219200922         EndSl;
000220200921
000221200921
000222200921       enddo;
000223200921
000224200921       *inlr = *on;
000225200921
000226200921
000227200921
000228200921       // ----------------------------------------------------------------
000229200921       dcl-proc CLEARS1;
000230200921
000231200922         //-------------------------
000232200922         //
000233200922         // Clear the Subfile
000234200922         //
000235200922         //-------------------------
000236200921
000237200922         SflClr = *on;
000238200922         Write LstCtl;
000239200922         SflClr= *off;
000240200922         rrn = 0;
000241200921
000242200921       End-Proc;
000243200921       // ----------------------------------------------------------------
000244200921       Dcl-Proc LoadS1;
000245200921
000246200922         Setll *loval EaseClasl1;
000247200922         Dou %eof(EaseClasl1);
000248200921
000249200922           read(n) EaseClasl1;
000250200922           if %eof(EaseClasl1);
000251200922             leave;
000252200922           endif;
000253200921
000254200922           s1FulAcct = %Editc(  c_Trst:'X' ) + '-' +
000255200922                       %Editc(  c_Sub#:'X' ) + '-' +
000256200922                       %Editc(  c_Acct:'X' );
000257200921
000258211207
000259211207
000260211207           // If we are only loading 1 group,
000261211207           // skip if this isn't the passed in group
000262211207           if Load_1Group = 'Y';
000263211207
000264211207             if c_Trst <> pTrst or
000265211207                c_Sub# <> pSub or
000266211207                c_Acct <> pAcct;
000267211207
000268211207               iter;
000269211207             EndIf;
000270211207           EndIf;
000271211207
000272211207
000273211207
000274211207
000275200922           s1Trst = c_Trst;
000276200922           s1Sub# = c_Sub#;
000277200922           s1Acct = c_Acct;
000278200922           s1Descr = c_Descr;
000279200922           s1Code = c_Code;
000280200922           s1GbsClas = c_GbsClas;
000281200921
000282200921
000283200922           if s1Search = *blanks;
000284200922             rrn = rrn + 1;
000285200922             write LstSfl;
000286200921
000287200922           else;   //?Search Field
000288200922             if %scan( %Trim(s1Search) : s1FulAcct ) > 0 or
000289211207                %scan( %Trim(s1Search) : %Upper(s1Descr) ) > 0 or
000290211207                %scan( %Trim(s1Search) : %Upper(s1Code) ) > 0 or
000291211207                %scan( %Trim(s1Search) : %Upper(s1GbsClas) ) > 0 ;
000292200921
000293200922               rrn = rrn + 1;
000294200922               write LstSfl;
000295200922             endif;
000296200922           endif;
000297200921
000298200922           If rrn >= 9999;
000299200922             leave;
000300200922           endIf;
000301200921
000302200922         enddo;
000303200921
000304200921       End-Proc;
000305200921
000306200921       // ----------------------------------------------------------------
000307200921       Dcl-Proc ReadChangedS1;
000308200921
000309200922         Dou *in95 = *ON;
000310200922           READC LstSfl;
000311200922           *in95 = %EOF;
000312200921
000313200922           If *in95 = *OFF;
000314200921
000315200921
000316200922             //?Edit Job Record
000317200922             if btnEdit = *on;
000318200922               Load_Data();
000319200922               Chg_Data();
000320200922             endIf;
000321200921
000322200922             if btnView = *on;
000323200922               Load_Data();
000324200922               Protect = *on;
000325200922               View_Data();
000326200922               Protect = *off;
000327200922             endIf;
000328200922
000329200921
000330200922             if btnDelete = *on;
000331200922               load_Data();
000332200922               Delete r_EaseClas;
000333200922             EndIf;
000334200922
000335200922             btnEdit = *off;
000336200922             btnDelete= *off;
000337200922             btnView = *off;
000338200922             update LstSfl;
000339200921
000340200922           endIf;
000341200921
000342200922         enddo;
000343200921
000344200921       End-Proc;
000345200921
000346200921       // ----------------------------------------------------------------
000347200921       Dcl-Proc Load_Data;
000348200921
000349200922         chain ( s1Trst : s1Sub# : s1Acct : s1Code ) EaseClasl1;
000350200922         chain ( s1Trst : s1Sub# : s1Acct ) AccMst;
000351200921
000352200922         s2FulAcct = s1FulAcct;
000353200922         s2FulName =  acNam1;
000354200922         s2Descr = s1Descr;
000355200922         s2Code = s1Code;
000356200922
000357200922         s2GbsClas = c_GbsClas;
000358200921
000359211207
000360211207          if c_CrtDt > 0;
000361211207            s2CrtMsg = 'Record was created by ' +
000362211207            %Trim( c_CrtBy ) + ' on ' +
000363211207              %Char(%date(c_CrtDt) :*usa) + ' at ' +
000364211207              %Char(%Time(c_CrtTm) :*usa);
000365211207          endif;
000366211207
000367211207          if c_ChgDt > 0;
000368211207            s2ChgMsg = 'Record was changed by ' +
000369211207            %Trim( c_ChgBy ) + ' on ' +
000370211207              %Char(%date(c_ChgDt) :*usa) + ' at ' +
000371211207              %Char(%Time(c_ChgTm) :*usa);
000372211207          endif;
000373211207
000374211207
000375200921       End-Proc;
000376200921
000377200922
000378200922       // ----------------------------------------------------------------
000379200922       Dcl-Proc Chg_Data;
000380200922
000381200922         dou btnCancel = *on;
000382211207
000383211207           Header = 'Edit Data';
000384211207           HideAccept = *off;
000385200922           exfmt EditScreen;
000386200922
000387200922           if btnCancel = *on;
000388200922             leave;
000389200922           EndIf;
000390200922
000391200922           if btnAccept = *on;
000392200922             c_GbsClas = s2GbsClas;
000393211207
000394211207             c_ChgBy = wqUsrn;
000395211207             c_ChgDt = %Dec(%Date);
000396211207             c_ChgTm = %Dec(%Time);
000397211207
000398200922             update   r_EaseClas;
000399200922             leave;
000400200922           EndIf;
000401200922
000402200922         EndDo;
000403200922
000404200922         btnCancel = *off;
000405200922       End-Proc;
000406200922
000407200922       // ----------------------------------------------------------------
000408200922       Dcl-Proc View_Data;
000409200922
000410200922         dou btnCancel = *on;
000411200922
000412211207           Header = 'View Data';
000413211207           HideAccept = *on;
000414200922           exfmt EditScreen;
000415200922
000416200922           if btnCancel = *on or
000417200922              btnAccept = *on;
000418200922             leave;
000419200922           EndIf;
000420200922
000421200922
000422200922         EndDo;
000423200922
000424200922         btnCancel = *off;
000425200922       End-Proc;
000426200922
