000100221219     FEASECDSP  IPE  E           K DISK
000200221219     FEASECCSVP O  A F 2000        DISK
000300050823   X***X
000400060315     D @OUTPUT         S           2000A   INZ
000500051108     D @C              C                   CONST('","')
000600051108    ***
0007000704030025  *
0008002108050025  *
0009000811140250 D                 DS
0010002212190251 D  c_ssn                  1      9  0
0011002211020251 D   ssna                  1      9
0012000704030025  *
0013000704030250 D                 DS
0014002212190251 D  c_seq                  1      2  0
0015002211020251 D   seqa                  1      2
0016000704030025  *
0017000704030250 D                 DS
0018002212190251 D  c_trst                 1      3  0
0019002211020251 D   trsta                 1      3
0020000704030025  *
0021000704030250 D                 DS
0022002212190251 D  c_sub#                 1      3  0
0023002211020251 D   sub#a                 1      3
0024000704030025  *
0025000704030250 D                 DS
0026002212190251 D  c_acct                 1      4  0
0027002211020251 D   accta                 1      4
0028000704030025  *
0029000704030250 D                 DS
0030000809090251 D  mxdate                 1      8  0
0031000809090251 D   mndate                9     16
0032000811140025  *
0033000811140250 D                 DS
0034000811140251 D  mzhrate                1     10
0035000811140251 D  mzcrate               11     20
003600210804    * *
003700210804     D                 DS
003800210804     D wkdat           S               D
003900210804     D usadt           S               D   DATFMT(*USA/)
004000221102     D datrec          S             10
004100221102     D datfnd          S             10
004200210805     D rect            S              1
004300210804      *
004400081114   X* *
004500110720      *
004600221219     C                   movel     c_datrec      wkdat
004700210804     C                   eval      usadt = wkdat
004800221102     C                   movel     usadt         datrec
004900210804      *
005000221219     C                   movel     c_datfnd      wkdat
005100221102     C                   eval      usadt = wkdat
005200221102     C                   movel     usadt         datfnd
005300221102      *
005400080313      *
005500081114      *
005600080313     C                   CLEAR                   @OUTPUT
005700221102     C                   EVAL      @OUTPUT = %TRIM(trsta) + ',' +
005800221102     C                             %TRIM(sub#a) + ',' +
005900221102     C                             %TRIM(accta) + ',' + '"' +
006000221219     C                             %TRIM(c_accnam) + '"' + ',' +
006100221219     C                             %TRIM(c_aacod) + ',' +
006200221219     C                             %TRIM(c_aafnm) + ',' +
006300221219     C                             %TRIM(c_aalnm) + ',' +
006400221102     C                             %TRIM(ssna) + ',' +
006500221104     C                             %TRIM(seqa) + ',' + '"' +
006600221219     C                             %TRIM(c_lname) + '"' + ',' + '"' +
006700221219     C                             %TRIM(c_fname) + '"' + ',' +
006800221219     C                             %TRIM(c_plan#) + ',' +
006900221219     C                             %TRIM(c_fldnam) + ',' + '"' +
007000221219     C                             %TRIM(c_easval) + '"' + ',' + '"' +
007100221219     C                             %TRIM(c_gbsval) + '"' + ',' +
007200221219     C                             %TRIM(datrec) + ',' +
007300221102     C                             %TRIM(datfnd)
007400201006    * *
007500060315     C                   EXCEPT    OUTFA
007600201006   S* *
007700201006     C     *INZSR        BEGSR
007800201006    * *
007900221102     C                   EVAL      @OUTPUT = 'TRUST,' +
008000221102     C                             'SUB#,' +
008100221102     C                             'ACCT,' +
008200221102     C                             'ACCOUNT NAME,' +
008300221104     C                             'AA,' +
008400221104     C                             'AA FIRST NAME,' +
008500221104     C                             'AA LAST NAME,' +
008600221102     C                             'MBR SSN,' +
008700221102     C                             'SEQ,' +
008800210804     C                             'LAST NAME,' +
008900221102     C                             'FIRST NAME,' +
009000221219     C                             'GBS PLAN,' +
009100221102     C                             'FIELD NAME,' +
009200221102     C                             'EASE VALUE,' +
009300221102     C                             'GBS VALUE,' +
009400221102     C                             'DATE REC,' +
009500221102     C                             'DT FOUND '
009600201006    * *
009700201006     C                   EXCEPT    OUTFA
009800201006    * *
009900201006     C                   ENDSR
010000201006    * *
010100201006     C
010200060315    ***
010300221219     OEASECCSVP EADD         OUTFA
010400060315     O                       @OUTPUT           2000
