000100000000      *_________________________________________________________________________
000200000000      *
000300000000      *_________________________________________________________________________
000400160809     FEDTMCOV   IF   E           K Disk
000500160809     FDEPEND    IF   E           K Disk    extfile('F.DEPEND')
000600160810     FHIST      UF   E           K DISK    extfile('F.HIST')
000700160809
000800160810     D  ssn            s              9s 0 inz
000900160725     D  pos            s              3s 0 inz
001000160809     D w80date         S              8S 0
001100160809     D  depflg         s              1a   inz
001200160809
001300160809     D  msmcva         C                   'Coverage Add From EDT Conversion '
001400160725
001500160809     D                 DS
001600160809     D  suba                   1      9
001700160809     D  subn                   1      9  0
001800160809
001900000000      * Program status data structure
002000000000     D PGMD          ESDS                  EXTNAME(IOPGMD)
002100160725
002200160810
002300160810     C     ssn           setll     EDTMCOV
002400160810     C                   read      EDTMCOV
002500160810     C                   dow       not %eof(EDTMCOV)
002600160810
002700160810     C                   exsr      dependents
002800160810
002900160810     C                   read      EDTMCOV
003000160810     C                   enddo
003100160725
003200160725     C                   eval      *inlr = *on
003300160725     C                   return
003400160809      *___________________________________________________________________
003500160809      * dependents
003600160809      *___________________________________________________________________
003700160809     C     dependents    BEGSR
003800160810     C     edtssn        setll     DEPEND
003900160810     C     edtssn        reade     DEPEND
004000160809     C                   dow       not %eof(DEPEND)
004100160809
004200160810     C                   movel     edtssn        subn
004300160810     C                   move      suba          hkey
004400160810     C                   exsr      updhist
004500160809
004600160810     C     edtssn        reade     DEPEND
004700160809     C                   enddo
004800160809     C                   ENDSR
004900160810      *___________________________________________________________________
005000160810      * update history
005100160810      *___________________________________________________________________
005200160810     C     updhist       BEGSR
005300160810
005400160810     C     hkey          setll     HIST
005500160810     C     hkey          reade     HIST
005600160810     C                   dow       not %eof(HIST)
005700160810     C                   if        trcode = 'MDA'  and
005800160810     C                             hdseq# = 0
005900160810     C                   eval      hdseq# = dpseq#
006000160810     C                   update    histr
006100160810     C                   LeaveSR
006200160810     C                   end
006300160810     C     hkey          reade     HIST
006400160810     C                   enddo
006500160810
006600160810     C                   ENDSR
006700160725      *___________________________________________________________________
006800160725      * Key Lists
006900160725      *___________________________________________________________________
007000160725     C     KLIST         BEGSR
007100160725     C                   ENDSR
007200000000      *___________________________________________________________________
007300000000      * Program open
007400000000      *___________________________________________________________________
007500000000     C     *INZSR        BEGSR
007600000000     C                   ENDSR
007700000000      *___________________________________________________________________
007800000000      * Program error handler
007900000000      *___________________________________________________________________
008000000000     C     *PSSR         BEGSR
008100000000     C                   CALL      'SNDRPGM'                            50
008200000000     C                   PARM                    WQPGMN
008300000000     C                   PARM                    WQSTSC
008400000000     C                   PARM                    WQRPGS
008500000000     C                   PARM                    WQMSG
008600000000     C                   ENDSR     '*CANCL'
