000100170522      *========================================================================
000200170522     H option(*noDebugIo)
000300170522      *========================================================================
000400170614      * EDTRELETR - EDT Renewal Rates
000500170614      *============================================================================
000600170614      * Date        Int   Description
000700170614      * ----------  ---   -------------------------------------------------------------
000800170614      * 06/14/2017  JT    Original creation
000900170614      *============================================================================
001000170522
001100170614     Fedtrewrat if   e             disk    rename(edtrlr:mainFile)
001200170614      * Incoming rates...
001300170522
001400170614     Fgratex    if a e           k disk    rename(grater:rateFile)
001500170629     F                                     extfile('F.GRATEX')
001600170614      * Rate file...
001700170522
001800170614     Fplnauxp   if   e           k disk    rename(plnauxr:auxFile)
001900170614      * Plan Auxiliary...
002000170614
002100170522      //=======================================================================
002200170522
002300170613     d trust           s              3  0
002400170613     d sub             s              3  0
002500170613     d plan            s              4
002600170613     d fromDate        s              8  0
002700170614     d type            s              3
002800170614     d rate            s             11  6
002900170614     D work_date       s               d
003000170614     D pos             s              2  0
003100170614     D string          s             30
003200170522
003300170522      //=======================================================================
003400170522      // mainline
003500170522      //=======================================================================
003600170522
003700170522       exsr init;
003800170522       exsr main;
003900170522       exsr exit;
004000170522
004100170522       //=======================================================================
004200170522       // main subr
004300170522       //=======================================================================
004400170522
004500170522       begsr main;
004600170522
004700170613        setll 1 mainFile;
004800170613        read mainFile;
004900170522
005000170522        dow not %eof;
005100170522
005200170614         exsr checkBlanks;
005300170614
005400170614         fromDate = %dec( %char( %date(awrendate:*usa):*iso0):8:0);
005500170614
005600170614         chain (trust : sub : plan : 00 : 'TIN' : fromDate) rateFile;
005700170614         if not %found;
005800170614          type = 'TIN';
005900170614           rate = %dec(aweonrate:6:2);
006000170614          exsr writeRecord;
006100170614         endif;
006200170522
006300170614         chain (trust : sub : plan : 00 : 'TPC' : fromDate) rateFile;
006400170614         if not %found;
006500170614          type = 'TPC';
006600170614           rate = %dec(awechrate:6:2);
006700170614          exsr writeRecord;
006800170614         endif;
006900170614
007000170614         chain (trust : sub : plan : 00 : 'TP2' : fromDate) rateFile;
007100170614         if not %found;
007200170614          type = 'TP2';
007300170614           rate = %dec(awechrate:6:2);
007400170614          exsr writeRecord;
007500170614         endif;
007600170614
007700170614         chain (trust : sub : plan : 00 : 'THW' : fromDate) rateFile;
007800170614         if not %found;
007900170614          type = 'THW';
008000170614           rate = %dec(awesprate:6:2);
008100170614          exsr writeRecord;
008200170614         endif;
008300170614
008400170614         chain (trust : sub : plan : 00 : 'TFA' : fromDate) rateFile;
008500170614         if not %found;
008600170614          type = 'TFA';
008700170614           rate = %dec(awcfmrate:6:2);
008800170614          exsr writeRecord;
008900170614         endif;
009000170614
009100170613        read mainFile;
009200170522        enddo;
009300170522
009400170522       endsr;
009500170522
009600170614       //=======================================================================
009700170614       // write record;
009800170614       //=======================================================================
009900170614
010000170614       begsr checkBlanks;
010100170614
010200170614        pos = %scan(' ':awtsplan:1);
010300170614
010400170614        if pos = 0;
010500170614         trust = %dec(%subst(awtsplan:1:3):3:0);
010600170614          sub = %dec(%subst(awtsplan:4:3):3:0);
010700170614         plan = %subst(awtsplan:7:4);
010800170614        else;
010900170614         trust = %dec(%subst(awtsplan:1:1):1:0);
011000170614          sub = %dec(%subst(awtsplan:2:3):3:0);
011100170614         plan = %subst(awtsplan:5:4);
011200170614        endif;
011300170614
011400170614       endsr;
011500170614
011600170614       //=======================================================================
011700170614       // write record;
011800170614       //=======================================================================
011900170614
012000170614       begsr writeRecord;
012100170614
012200170614        clear rateFile;
012300170614
012400170614        grtrst = trust;
012500170614        grsub# = sub;
012600170614        grplan = plan;
012700170614        agebnd = 0;
012800170614        typecd = type;
012900170614        grfil8 = ' ';
013000170614
013100170614        chain (trust : sub : plan) auxFile;
013200170614        if %found ;
013300170614         group# = pxgroup;
013400170614        endif;
013500170614
013600170614        fill3a = ' ';
013700170614        netrte = rate;
013800170614        bilrte = rate;
013900170614        grdltd = 'A';
014000170614        frmdat = fromDate;
014100170614
014200170614        todat = %dec(%char(%date(awrendate:*usa):*iso0):8:0);
014300170614        work_date = %date(%dec(todat : 8 : 0) : *iso);
014400170614        work_date = work_date + %years(1) - %days(1);
014500170614        todat = %dec(work_date:*iso);
014600170614
014700170614        write rateFile;
014800170614
014900170614       endsr;
015000170614
015100170522       //=======================================================================
015200170522       // exit subr
015300170522       //=======================================================================
015400170522
015500170522       begsr exit;
015600170522
015700170522        *inlr = '1';
015800170522        return;
015900170522
016000170522       endsr;
016100170522
016200170522       //=======================================================================
016300170522       // init subr
016400170522       //=======================================================================
016500170522
016600170522       begsr init;
016700170629
016800170522       endsr;
016900170522
017000170522       //=======================================================================
