000100180314
000200180314       Ctl-Opt option(*noDebugIo)  DftActGrp(*No) bnddir('GBSBIND') ;
000300171229
000400171229      *-------------------------------------------------------------------------
000500171229      *
000600180314      *  Description:  Email List Window
000700171229      *  Programmer.:  Brian Rees
000800180314      *  Date.......:  03/14/2018
000900171229      *
001000171229      *-------------------------------------------------------------------------
001100171229
001200171229      *-------------------------------------------------------------------------
001300171229      *
001400171229      * Declare Files
001500171229      *
001600171229      *-------------------------------------------------------------------------
001700180314       Dcl-f EmlListd WorkStn
001800180314          SFILE(EmailSfl:rrn)
001900171229          Handler('PROFOUNDUI(HANDLER)');
002000171229
002100180314       Dcl-f EmailAddr keyed;
002200180314
002300171229
002400171229      *-------------------------------------------------------------------------
002500171229      *
002600171229      * Global Variables
002700171229      *
002800171229      *-------------------------------------------------------------------------
002900180314       dcl-s pEmail  Char(30);
003000171229       dcl-s pCancel Char(1);
003100180314       dcl-s rrn     Zoned(5);
003200180314       dcl-s Done    ind;
003300170420
003400171229
003500180314
003600180314      *-------------------------------------------------------------------------
003700180314      *
003800180314      * Procedures
003900180314      *
004000180314      *-------------------------------------------------------------------------
004100180314       dcl-pr RtvUsrText ExtPgm('RTVAALCL');
004200180314          oUser Char(10);
004300180314          oText Char(50);
004400180314       End-Pr;
004500180314
004600180314       /COPY *LIBL/QMODSRC,PR0001RPR            // Case Functions
004700171229      *-------------------------------------------------------------------------
004800171229      *
004900171229      * Mainline Program
005000171229      *
005100171229      *-------------------------------------------------------------------------
005200170919     C     *entry        plist
005300180314     C                   parm                    pEmail
005400170919     C                   parm                    pCancel
005500170606
005600171229
005700180314       Dou btnExit =  *on;
005800180314
005900180314          if btnExit = *on;
006000180314             pCancel = 'Y';
006100180314             leave;
006200180314          EndIf;
006300180314
006400180314          ClearS1();
006500180314          LoadS1();
006600180314          DisplyS1();
006700180314
006800180314
006900180314          // Process Selections
007000180314          Select;
007100180314
007200180314          other;
007300180314             ReadChangedS1();
007400180314             if done;
007500180314                leave;
007600180314             EndIf;
007700180314
007800180314
007900180314          EndSl;
008000180314
008100180314       EndDo;
008200170905
008300180314       *inlr = *on;
008400180314
008500180314       //----------------------------------------------------------------
008600180314       //
008700180314       // Clear the Subfile
008800180314       //
008900180314       //----------------------------------------------------------------
009000180314
009100180314       dcl-proc ClearS1;
009200180314
009300180314          // Clear the Subfile
009400180314          ClrSfl = *on;
009500180314          Write Screen1;
009600180314          ClrSfl = *off;
009700180314          rrn = 0;
009800180314
009900180314       end-Proc;
010000180314
010100180314
010200180314       // ----------------------------------------------------------------
010300180314
010400180314       dcl-proc LoadS1;
010500180314
010600180314
010700180314          Setll *Loval EmailAddr;
010800180314
010900180314          Dou %Eof(EmailAddr);
011000180314             read EmailAddr;
011100180314             if %eof(EmailAddr);
011200180314                leave;
011300180314             endif;
011400180314
011500180314             s1emladdr = eaEmail;
011600180314             RtvUsrText( eausrprf : s1fulname );
011700180314
011800180314
011900180314             if srchvalue = '';
012000180314                rrn = rrn + 1;
012100180314                write EmailSfl;
012200180314
012300180314             EndIf;
012400180314
012500180314
012600180314             if srchvalue > '';
012700180314                If %Scan( %Trim(srchvalue) : uCase(s1emladdr) ) > 0  or
012800180314                   %Scan( %Trim(srchvalue) : uCase(s1fulname) ) > 0 ;
012900180314
013000180314                   rrn = rrn + 1;
013100180314                   write EmailSfl;
013200180314
013300180314                endif;
013400180314
013500180314             EndIf;
013600180314
013700180314
013800180314          Enddo;
013900180314
014000180314
014100180314       end-proc;
014200180314       // ----------------------------------------------------------------
014300180314
014400180314
014500180314       dcl-proc DisplyS1;
014600180314
014800180314          exfmt Screen1;
015000180314
015100180314       end-proc;
015200180314
015300180314
015400180314       // ----------------------------------------------------------------
015500180314
015600180314       dcl-proc ReadChangedS1;
015700180314
015800180314          Done = *off;
015900180314          Dou *in95 = *ON;
016000180314             READC EmailSfl;
016100180314             *in95 = %EOF;
016200180314
016300180314             If *in95 = *OFF;
016400180314
016500180314
016600180314                if s1Check = 'Y';
016700180314                   pemail = s1emladdr;
016800180314                   done = *on;
016900180314                   leave;
017000180314                EndIf;
017100180314
017200180314
017300180314                s1Check = '';
017400180314                update EmailSfl;
017500180314
017600180314             endIf;
017700180314
017800180314
017900180314          enddo;
018000180314       end-proc;
018100180314
018200180314
