000100170111     H option(*noDebugIo)
000200170111      *================================================================
000300170111
000400170711     Fevrgrenxpfuf   e           k disk    rename(EVGXPTF:everFile)
000500170111
000600170111      *================================================================
000700170111
000800170111       exsr init;
000900170111       exsr main;
001000170111       exsr exit;
001100170111
001200170111      //========================
001300170111      // main
001400170111      //========================
001500170111
001600170111       begsr main;
001700170111
001800170406       setll *loval everFile;
001900170112       read everFile;
002000170111
002100170111       dow not %eof;
002200170111
002300170711       if evmbrdep = 'DEP';
002400170711
002500170711        if evcoveff < evdob;
002600170711         evcoveff = evdob;
002700170711         //update everFile;
002800170711        endif;
002900170112
003000170112       endif;
003100170112
003200170112       read everFile;
003300170111       enddo;
003400170111
003500170111       endsr;
003600170111
003700170111      //========================
003800170111      // exit
003900170111      //========================
004000170111
004100170111       begsr exit;
004200170111
004300170111       *inlr = *on;
004400170111       return;
004500170111
004600170111       endsr;
004700170111
004800170111      //========================
004900170111      // init
005000170111      //========================
005100170111
005200170111       begsr init;
005300170111
005400170111       endsr;
005500170111
005600170111      //========================
