000100170111     H option(*noDebugIo)
000200170111      *================================================================
000300170111
000400170124     Fevrgrenxpfuf   e             disk    rename(EVGXPTF:mainFile)
000500170112
000600170111      *================================================================
000700170213
000800170213     d $pos            S              2  0
000900170213
001000170213
001100170213      *================================================================
001200170111
001300170111       exsr init;
001400170111       exsr main;
001500170111       exsr exit;
001600170111
001700170111      //========================
001800170111      // main
001900170111      //========================
002000170111
002100170111       begsr main;
002200170111
002300170124       setll 1 mainFile;
002400170124       read mainFile;
002500170111
002600170111       dow not %eof;
002700170124
002800170213       if evprdct <> 'DEN';
002900170213
003000170214       $pos = %scan(' ' : evplancd);
003100170214        if $pos = 15;
003200170213         evplancd = %trim(evplancd) + %trim('-00');
003300170214         update mainFile;
003400170213        endif;
003500170213
003600170214       endif;
003700170214
003800170124       read mainFile;
003900170111       enddo;
004000170111
004100170111       endsr;
004200170111
004300170111      //========================
004400170111      // exit
004500170111      //========================
004600170111
004700170111       begsr exit;
004800170111
004900170111       *inlr = *on;
005000170111       return;
005100170111
005200170111       endsr;
005300170111
005400170111      //========================
005500170111      // init
005600170111      //========================
005700170111
005800170111       begsr init;
005900170111
006000170111       endsr;
006100170111
006200170111      //========================
