000100170111     H option(*noDebugIo)
000200170111      *================================================================
000300170111
000400170112     Fhioserror1if   e           k disk    rename(HIOSER:hiosFile)
000500170111
000600170406     Fevrgrenxpnuf   e           k disk    rename(EVGXPTF:everFile)
000700170111
000800170112     Fplnauxp   if   e           k disk    rename(PLNAUXR:planFile)
000900170112
001000170111      *================================================================
001100170111
001200170111       exsr init;
001300170111       exsr main;
001400170111       exsr exit;
001500170111
001600170111      //========================
001700170111      // main
001800170111      //========================
001900170111
002000170111       begsr main;
002100170111
002200170406       setll *loval everFile;
002300170112       read everFile;
002400170111
002500170111       dow not %eof;
002600170111
002700170112       if evplancd = ' ';
002800170111
002900170112        chain EVSUBSCR hiosFile;
003000170112        if %found;
003100170112
003200170112         chain (trust : sub# : plan) planFile;
003300170112         if %found;
003400170112          evplancd = PXCARPLN;
003500170112          update everfile;
003600170112         endif;
003700170112
003800170112        endif;
003900170112
004000170112       endif;
004100170112
004200170112       read everFile;
004300170111       enddo;
004400170111
004500170111       endsr;
004600170111
004700170111      //========================
004800170111      // exit
004900170111      //========================
005000170111
005100170111       begsr exit;
005200170111
005300170111       *inlr = *on;
005400170111       return;
005500170111
005600170111       endsr;
005700170111
005800170111      //========================
005900170111      // init
006000170111      //========================
006100170111
006200170111       begsr init;
006300170111
006400170111       endsr;
006500170111
006600170111      //========================
