000100170111     H option(*noDebugIo)
000200170111      *================================================================
000300170111
000400170131     Fevrgrenxpnif   e             disk    rename(evgxptf:mainFile)
000500170112
000600170131     Fhioserror if   e           k disk    rename(hioser:ssnFile)
000700170131
000800170131     Fhioserror2if   e           k disk    rename(hioser:dssnFile)
000900170131
001000170131     Ftsaplan   o    e             disk    rename(tsapr:errorFile)
001100170131
001200170111      *================================================================
001300170111
001400170111       exsr init;
001500170111       exsr main;
001600170111       exsr exit;
001700170111
001800170111      //========================
001900170111      // main
002000170111      //========================
002100170111
002200170111       begsr main;
002300170111
002400170124       setll 1 mainFile;
002500170124       read mainFile;
002600170111
002700170111       dow not %eof;
002800170124
002900170131       if evprdct <> 'DEN';
003000170131
003100170131        if evplancd = ' ';
003200170131
003300170131         if evssnmbr > ' ';
003400170131          chain evssnmbr ssnFile;
003500170131          if %found;
003600170131           truste = %char(trust);
003700170131            sub#e = %char(sub#);
003800170131            plane = plan;
003900170131           write errorFile;
004000170131          endif;
004100170131
004200170131         endif;
004300170131
004400170131         if evssndep > ' ';
004500170131          chain evssndep dssnFile;
004600170131          if %found;
004700170131           truste = %char(trust);
004800170131            sub#e = %char(sub#);
004900170131            plane = plan;
005000170131           write errorFile;
005100170131          endif;
005200170131
005300170131         endif;
005400170131
005500170131        endif;
005600170131
005700170131       endif;
005800170124
005900170124       read mainFile;
006000170111       enddo;
006100170111
006200170111       endsr;
006300170111
006400170111      //========================
006500170111      // exit
006600170111      //========================
006700170111
006800170111       begsr exit;
006900170111
007000170111       *inlr = *on;
007100170111       return;
007200170111
007300170111       endsr;
007400170111
007500170111      //========================
007600170111      // init
007700170111      //========================
007800170111
007900170111       begsr init;
008000170111
008100170111       endsr;
008200170111
008300170111      //========================
