000100170111     H option(*noDebugIo)
000200170111      *================================================================
000300170111
000400170216     Fevrgrenxpnuf   e             disk    rename(EVGXPTF:mainFile)
000500170112
000600170111      *================================================================
000700170213
000800170213     d $pos            S              2  0
000900170213
001000170213
001100170213      *================================================================
001200170111
001300170111       exsr init;
001400170111       exsr main;
001500170111       exsr exit;
001600170111
001700170111      //========================
001800170111      // main
001900170111      //========================
002000170111
002100170111       begsr main;
002200170111
002300170124       setll 1 mainFile;
002400170124       read mainFile;
002500170111
002600170111       dow not %eof;
002700170124
002800170213       if evprdct <> 'DEN';
002900170213
003000170515        if evplancd > ' ';
003100170515
003200170515         $pos = %scan(' ' : evplancd);
003300170515          if $pos = 15;
003400170515           evplancd = %trim(evplancd) + %trim('-00');
003500170515           update mainFile;
003600170515          endif;
003700170515
003800170515        endif;
003900170213
004000170214       endif;
004100170214
004200170124       read mainFile;
004300170111       enddo;
004400170111
004500170111       endsr;
004600170111
004700170111      //========================
004800170111      // exit
004900170111      //========================
005000170111
005100170111       begsr exit;
005200170111
005300170111       *inlr = *on;
005400170111       return;
005500170111
005600170111       endsr;
005700170111
005800170111      //========================
005900170111      // init
006000170111      //========================
006100170111
006200170111       begsr init;
006300170111
006400170111       endsr;
006500170111
006600170111      //========================
