000100150326      *========================================================================
000200150323
000300150528      * Description:  Eliminate ssn with 0 and create error report
000400150323
000500150326      * (c)Copyright 2015 by GBS Inc.
000600150326      * This document contains restricted materials of GBS, Inc.
000700150326
000800150528      *   Created by:  J. Torres - May 28, 2015
000900150326      *========================================================================
001000150323
001100150501     Fevgaltrcvfuf a e             disk
001200150430      * Received records from Evergreen
001300150430     F                                     rename(memaltr:recvFile)
001400150430
001500150527     Fevgerr    if a e             disk
001600150527      * Error records from Evergreen
001700150527     F                                     rename(evgerrr:errorFile)
001800150527
001900150430      //=======================================================================
002000150430      // mainline
002100150430      //=======================================================================
002200150323
002300150323       exsr init;
002400150323       exsr main;
002500150323       exsr exit;
002600150323
002700150324       //===================
002800150323       // main subr
002900150324       //===================
003000150323
003100150323       begsr main;
003200150324
003300150430       setll 1 recvFile;
003400150430       read recvFile;
003500150430        dow not %eof;
003600150326
003700150326         exsr process;
003800150330
003900150430        read recvFile;
004000150324        enddo;
004100150326
004200150323       endsr;
004300150323
004400150430       //===================
004500150430       // process subr
004600150430       //===================
004700150430
004800150430       begsr process;
004900150430
005000150611        if ssn = '000000000';
005100150527         exsr errorReport;
005200150527         delete recvFile;
005300150430        endif;
005400150430
005500150430       endsr;
005600150430
005700150527       //===================
005800150527       // errorReport subr
005900150527       //===================
006000150527
006100150527       begsr errorReport;
006200150527
006300150527        erroref = %trim(altid) + ',' + %trim(fname) + ',' +
006400150527                 %trim(lname) + ',' +  %trim(ssn);
006500150527
006600150527        write errorFile;
006700150527
006800150527       endsr;
006900150527
007000150324       //===================
007100150324       // exit subr
007200150324       //===================
007300150323
007400150323       begsr exit;
007500150323
007600150323        *inlr = *on;
007700150323        return;
007800150323
007900150323       endsr;
008000150323
008100150324       //===================
008200150323       // init subr
008300150324       //===================
008400150323
008500150323       begsr init;
008600150527
008700150527        // Write column headers on error file...
008800150528        erroref = %trim('Name') + ',' + %trim('First_Name_c') + ',' +
008900150527                 %trim('Last_Name_c') + ',' + %trim('SSN');
009000150323
009100150527        write errorFile;
009200150527
009300150323       endsr;
009400150323
009500150413       //===================
