000100150626      *=================================================================
000200150626      * EVRGRENRPG - Evergreen 834 Extract
000300150626      *=================================================================
000400140827     *** A            EVGRPSEQ      30A         TEXT('MASTER SORT SEQ')
000500140903     ******** TRS/SUB/ACCT = 10 + SSN/SEQ = 21 + PDT = 24 + A/B/C
000600140903   X***X      GROUP#         15             26         27
000700150626      *=================================================================
000800150626
000900150626      *  CARRIER CONTROL #114
001000150626      *  SSK AUG, 2014
001100150626
001200150626      *  ADD MEMALT FOR FAKE SSN TO REAL SSN RETRIEVAL
001300150626      *
001400150626      *  CREATE FAKE DEPENDENT PLANS FOR EVERGREEN
001500150626
001600150626      *============================================================================
001700150626      * Date       Int Description
001800150626      * ---------- --- ------------------------------------------------------------
001900150626      * 06/26/2015 JT  From Evergreen - They now want the term dates to be prior
002000150626      *                                 day end of the month (ex.: 07/01/2015 to
002100150626      *                                 06/30/2015)
002200150626      *============================================================================
002300150626
002400140904     FEVRGRENCTLUF   E           K DISK
002500140904     FEVRGRENTRMIF A E           K DISK
002600140904     FEVRGRENXPTIF A E           K DISK
002700140919    ***
002800141003     FCARACCP   IF   E           K DISK
002900140919     FCARPLNP   IF   E           K DISK
003000140827    ***
003100140903     FACMUNIQUE IF   E           K DISK
003200140903     FAC2MSTL2  IF   E           K DISK
003300140829     FGRATEINQ  IF   E           K DISK
003400141216     FPLNAUXP   IF   E           K DISK
003500140904     FDCOVA     IF   E           K DISK
003600140904     FDEPNDC    IF   E           K DISK
003700140829     FCODESL1   IF   E           K DISK
003800140829     FMEMAC#1   IF   E           K DISK
003900140904     FMCOVMPLN  IF   E           K DISK
004000140904     FSMOKE     IF   E           K DISK
004100141027     FMEMALT    IF   E           K DISK
004200140829    ***
004300140827   X***X
004400141113     D #XSX            S              8S 0
004500140904     D H#TRS           S                   LIKE(ECTRST)
004600140904     D H#SUB           S                   LIKE(ECSUB#)
004700140904     D H#ACC           S                   LIKE(ECACCT)
004800140827     D KF@TRS          S                   LIKE(ECTRST)
004900140827     D KF@SUB          S                   LIKE(ECSUB#)
005000140827     D KF@ACC          S                   LIKE(ECACCT)
005100140827     D KF@PLN          S                   LIKE(ECPLAN)
005200140919     D KF@CCTR         S                   LIKE(CCFLG)
005300140903     D KF@SS           S              9S 0
005400140903     D KF@SQ           S              2S 0
005500140903     D KF@TRM          S              8S 0
005600140903     D KF@ENR          S              3A
005700140903    ***
005800140919     D DS@CARPLN     E DS                  EXTNAME(CARPLNP)
005900140919    ***
006000140919     D CARR#CTL        S             10A   INZ('0000000114')
006100140903     D KF@GSEQ         S             30A
006200140903    ***
006300140903     D DS@EVG        E DS                  EXTNAME(EVRGRENXPT)
006400140909     D  RMVL                   1    433A
006500140827    ***
006600140903     D DS@INIT       E DS                  EXTNAME(EVRGRENXPT) PREFIX(XX:2)
006700140903    ***
006800140903     D #ISO            S               D   DATFMT(*ISO)
006900140903     D #TODAY          S              8S 0 INZ(0)
007000140904     D #CANCEL         S              8S 0 INZ(0)
007100140904     D #EFFDTE         S              8S 0 INZ(0)
007200140904     D @ENRIN          S              3A
007300141027    ***
007400141027     D ISO#TODAY       S               D   DATFMT(*ISO)
007500141027     D ISO#DOB         S               D   DATFMT(*ISO)
007600140827    ***
007700140909     D PPO#CNE         S              3S 0
007800140909     D PPO@PLN         S              4A   DIM(80)
007900140909     D PPO@ENR         S              3A   DIM(80)
008000140909     D PPO@FRM         S              8S 0 DIM(80)
008100140909     D PPO@TRM         S              8S 0 DIM(80)
008200140909     D PPO@VP          S              4A
008300140909     D PPO@VE          S              3A
008400140909     D PPO@VF          S              8S 0
008500140909     D PPO@VT          S              8S 0
008600140909     D PPO@MP          S              4A
008700140909     D PPO@ME          S              3A
008800140909     D PPO@MF          S              8S 0
008900140909     D PPO@MT          S              8S 0
009000140827    ***
009100140903     D DEN#CNE         S              3S 0
009200140903     D DEN@PLN         S              4A   DIM(80)
009300140903     D DEN@ENR         S              3A   DIM(80)
009400140903     D DEN@FRM         S              8S 0 DIM(80)
009500140903     D DEN@TRM         S              8S 0 DIM(80)
009600140903     D DEN@VP          S              4A
009700140903     D DEN@VE          S              3A
009800140903     D DEN@VF          S              8S 0
009900140903     D DEN@VT          S              8S 0
010000140904     D DEN@MP          S              4A
010100140904     D DEN@ME          S              3A
010200140904     D DEN@MF          S              8S 0
010300140904     D DEN@MT          S              8S 0
010400140903    ***
010500140903     D VIS#CNE         S              3S 0
010600140903     D VIS@PLN         S              4A   DIM(80)
010700140903     D VIS@ENR         S              3A   DIM(80)
010800140903     D VIS@FRM         S              8S 0 DIM(80)
010900140903     D VIS@TRM         S              8S 0 DIM(80)
011000140903     D VIS@VP          S              4A
011100140903     D VIS@VE          S              3A
011200140903     D VIS@VF          S              8S 0
011300140903     D VIS@VT          S              8S 0
011400140904     D VIS@MP          S              4A
011500140904     D VIS@ME          S              3A
011600140904     D VIS@MF          S              8S 0
011700140904     D VIS@MT          S              8S 0
011800140827    ***
011900140903     D PLN@          E DS                  EXTNAME(EVRGRENCTL)
012000140903     D                                     OCCURS(300) PREFIX(EZ:2)
012100140903    ***
012200140903     D LOAD@         E DS                  EXTNAME(EVRGRENCTL)
012300140903     D CNE             S              3S 0
012400140903     D NDX             S              3S 0
012500140903    ***
012600140922     D @@DIV           S             10A
012700140922     D @@PLN           S             10A
012800140904     D @PROC           S             10A
012900141023     D @9              S              9A
013000141023     D ALT@SSN         S              9A
013100140904     D ENR@834         S              3A
013200140903     D @PLANIN         S              4A
013300140903     D SMOKING         S               N
013400140903     D GOOD_PLN        S               N
013500140903     D YES             S               N   INZ(*ON)
013600140903     D NO              S               N   INZ(*OFF)
013700150626     D work_date       S               d
013800150626     D PrevMthEnd      S               d
013900140903    ***
014000140903     D H@TRS           S              3S 0
014100140903     D H@SUB           S              3S 0
014200140903     D H@ACC           S              4S 0
014300150626
014400150626      *============================================================================
014500150626
014600140908     C                   EVAL      #ISO = %DATE
014700140908     C                   MOVE      #ISO          #TODAY
014800140903    ***
014900140903     C     KL#SQTSA      KLIST
015000140903     C                   KFLD                    KF@SS
015100140903     C                   KFLD                    KF@SQ
015200140903     C                   KFLD                    KF@TRS
015300140903     C                   KFLD                    KF@SUB
015400140903     C                   KFLD                    KF@ACC
015500140903    ***
015600140903     C     KL#TSA        KLIST
015700140903     C                   KFLD                    KF@TRS
015800140903     C                   KFLD                    KF@SUB
015900140903     C                   KFLD                    KF@ACC
016000140904    ***
016100140904     C     KL#SSQ        KLIST
016200140904     C                   KFLD                    KF@SS
016300140904     C                   KFLD                    KF@SQ
016400140903    ***
016500140903     C     KL#TSP        KLIST
016600140903     C                   KFLD                    KF@TRS
016700140903     C                   KFLD                    KF@SUB
016800140903     C                   KFLD                    KF@PLN
016900141003    ***
017000141003     C     KL#CACC       KLIST
017100141003     C                   KFLD                    CARR#CTL
017200141003     C                   KFLD                    KF@TRS
017300141003     C                   KFLD                    KF@SUB
017400141003     C                   KFLD                    KF@ACC
017500140903    ***
017600140919     C     KL#CPLN       KLIST
017700140919     C                   KFLD                    CARR#CTL
017800140919     C                   KFLD                    KF@TRS
017900140919     C                   KFLD                    KF@SUB
018000140919     C                   KFLD                    KF@ACC
018100140919     C                   KFLD                    KF@CCTR
018200140919     C                   KFLD                    KF@PLN
018300140919    ***
018400140903     C     KL#MTR        KLIST
018500140903     C                   KFLD                    KF@SS
018600140903     C                   KFLD                    KF@SQ
018700140903     C                   KFLD                    KF@TRM
018800140903     C                   KFLD                    KF@PLN
018900140903     C                   KFLD                    KF@ENR
019000140903     C                   KFLD                    KF@TRS
019100140903     C                   KFLD                    KF@SUB
019200140903     C                   KFLD                    KF@ACC
019300140903    ***
019400140827     C                   EVAL      @PROC = 'RESET CTL '
019500140827    ***
019600140827     C                   DOU       @PROC = 'LEAVE PROG'
019700140827     C     @PROC         CASEQ     'RESET CTL '  $CONTROL
019800140827     C     @PROC         CASEQ     'SET UP CTL'  $SETUP
019900140827     C     @PROC         CASEQ     'LOOP CTL  '  $LOOPCTL
020000140827     C                   ENDCS
020100140827     C                   ENDDO
020200140827    ***
020300140827       EXSR $PROC;
020400140903    ***
020500140827     C                   EVAL      *INLR = *ON
020600140903    ***
020700140903    ***
020800140903    ***
020900140827    ***
021000140827   S***S
021100140827    ***
021200140827     C     $CONTROL      BEGSR
021300140827    ***
021400140827       @PROC = 'SET UP CTL';
021500140827    ***
021600140819       KF@TRS = 1;
021700140819       SETLL (KF@TRS) EVGCTLF;
021800140827    ***
021900140819       DOU %EOF(EVRGRENCTL);
022000140827    ***
022100140819          READ EVGCTLF;
022200140819          IF NOT %EOF(EVRGRENCTL);
022300140904    ***
022400140904             IF ECTRST = 0;
022500140904                ECGROUP# = 'SKIPME';
022600140904                UPDATE EVGCTLF;
022700140904                ITER;
022800140904             ENDIF;
022900140827    ***
023000140827             IF ECCARR = *BLANKS;
023100140827                ECGROUP# = 'SKIPME';
023200140827                UPDATE EVGCTLF;
023300140827                ITER;
023400140827             ENDIF;
023500140827    ***
023600140819             KF@TRS = ECTRST;
023700140819             KF@SUB = ECSUB#;
023800140819             KF@PLN = ECPLAN;
023900140903             KF@ACC = ECACCT;
024000140827    ***
024100140819             CHAIN KL#TSP GRATER;
024200140819             IF NOT %FOUND(GRATEINQ);
024300140819                ECGROUP# = 'SKIPME';
024400140827                UPDATE EVGCTLF;
024500140827                ITER;
024600140827             ENDIF;
024700140827    ***
024800140827             SETGT KL#TSP GRATER;
024900140827             READPE KL#TSP GRATER;
025000140919             ECGROUP# = %SUBST(GROUP#:1:4);
025100140827    ***
025200140819             CHAIN (ECPLNCAT) CODESR;
025300140819             IF %FOUND(CODESL1);
025400140819                SELECT;
025500140819                   WHEN ACTION = 'M';
025600140909                      ECPLNCAT = 'PPO';
025700140819                   WHEN ACTION = 'D';
025800140819                      ECPLNCAT = 'DEN';
025900140819                   WHEN ACTION = 'V';
026000140819                      ECPLNCAT = 'VIS';
026100140819                   OTHER;
026200140819                      ECGROUP# = 'SKIPME';
026300140819                ENDSL;
026400140819             ELSE;
026500140819                ECGROUP# = 'SKIPME';
026600140819             ENDIF;
026700140903    ***
026800140903             IF ECGROUP# <> 'SKIPME';
026900140903                IF ACTRST <> ECTRST OR ACSUB# <> ECSUB# OR ACACCT <> ECACCT;
027000140903                   CHAIN KL#TSA ACCMSR;
027100140903                   CHAIN KL#TSA ACCMSR2;
027200140903                ENDIF;
027300140903                ECACNAME = %TRIM(ACNAM1) + ' ' + %TRIM(ACNAM2);
027400140904                IF A2TAX_ID# > 0;
027500140904                   ECTAXID = %EDITC(A2TAX_ID#:'X');
027600140903                ELSE;
027700140903                   ECTAXID = *BLANKS;
027800140903                ENDIF;
027900140903             ENDIF;
028000140903    ***
028100140819             UPDATE EVGCTLF;
028200140827    ***
028300140819          ENDIF;
028400140819       ENDDO;
028500140827    ***
028600140827     C                   ENDSR
028700140827    ***
028800140827   S***S
028900140827    ***
029000140827     C     $SETUP        BEGSR
029100140827    ***
029200140827       @PROC = 'LOOP CTL  ';
029300140827    ***
029400140827       KF@TRS = 1;
029500140827    ***
029600140827       SETLL (KF@TRS) EVGCTLF;
029700140827    ***
029800140827     C                   ENDSR
029900140827    ***
030000140827   S***S
030100140827    ***
030200140827     C     $LOOPCTL      BEGSR
030300140827    ***
030400140827       READ EVGCTLF;
030500140827    ***
030600140827       IF %EOF(EVRGRENCTL);
030700140827          @PROC = 'LEAVE PROG';
030800140827          LEAVESR;
030900140827       ENDIF;
031000140827    ***
031100140827       IF ECGROUP# = 'SKIPME';
031200140827          LEAVESR;
031300140827       ENDIF;
031400140827    ***
031500140827       IF H#TRS = 0;
031600140827          EXSR $CLRSTG;
031700140827       ENDIF;
031800140827    ***
031900140827       IF H#TRS = ECTRST AND H#SUB = ECSUB# AND H#ACC = ECACCT;
032000140827          EXSR $ADDOCC;
032100140904          LEAVESR;
032200140827       ENDIF;
032300140827       IF H#TRS <> ECTRST OR H#SUB <> ECSUB# OR H#ACC <> ECACCT;
032400140827          EXSR $PROC;
032500140827          EXSR $CLRSTG;
032600140905          EXSR $ADDOCC;
032700140827       ENDIF;
032800140827    ***
032900140827     C                   ENDSR
033000140827    ***
033100140827   S***S
033200140903    ***
033300140819    *** ADD OCCURRENCE TO PLAN STORAGE
033400140819    ***
033500140819     C     $ADDOCC       BEGSR
033600140819    ***
033700140819     C                   ADD       1             CNE
033800140819     C     CNE           OCCUR     PLN@
033900140819     C                   EVAL      PLN@ = LOAD@
034000140819    ***
034100140819     C                   ENDSR
034200140819    ***
034300140819   S***S
034400140903    ***
034500140819    *** CLEAR PLAN STORAGE AND RESET HOLD VALUES
034600140819    ***
034700140819     C     $CLRSTG       BEGSR
034800140819    ***
034900140819       CNE = 0;
035000140819       NDX = 0;
035100140819     C                   DO        300
035200140819     C                   ADD       1             NDX
035300140819     C     NDX           OCCUR     PLN@
035400140819     C                   CLEAR                   PLN@
035500140819     C                   ENDDO
035600140819       NDX = 0;
035700140819    ***
035800140819       H#TRS = ECTRST;
035900140819       H#SUB = ECSUB#;
036000140819       H#ACC = ECACCT;
036100140819    ***
036200140819     C                   ENDSR
036300140819    ***
036400140819   S***S
036500140827    *** PROCESS ACCOUNT
036600140819    ***
036700140819     C     $PROC         BEGSR
036800140819    ***
036900140819       KF@TRS = H#TRS;
037000140819       KF@SUB = H#SUB;
037100140819       KF@ACC = H#ACC;
037200140819    ***
037300140827       IF CNE = 0;
037400140827          LEAVESR;
037500140827       ENDIF;
037600140827    ***
037700141003       CHAIN KL#CACC CARACCR;
037800141003       IF NOT %FOUND(CARACCP) OR (%FOUND(CARACCP) AND CASTATUS <> 'Y');
037900141003          LEAVESR;
038000141003       ENDIF;
038100141003    ***
038200140819       CHAIN KL#TSA MEMBR;
038300140819       IF NOT %FOUND(MEMAC#1);
038400140819          LEAVESR;
038500140819       ENDIF;
038600140819    ***
038700141113       CHAIN KL#TSA ACCMSR;
038800140819       SETLL KL#TSA MEMBR;
038900140819       DOU %EOF(MEMAC#1);
039000140820          READE KL#TSA MEMBR;
039100140820          IF NOT %EOF(MEMAC#1);
039200140820    ***
039300140820             EXSR $MCOV;
039400140820    ***
039500140820             EXSR $MBRWRT;
039600140820    ***
039700140909             IF PPO#CNE > 0 OR DEN#CNE > 0 OR VIS#CNE > 0;
039800140903                EXSR $DEPEND;
039900140903             ENDIF;
040000140820    ***
040100140820          ENDIF;
040200140820    ***
040300140820       ENDDO;
040400140820    ***
040500140820     C                   ENDSR
040600140820    ***
040700140820   S***S
040800140820    *** MEMBER COVERAGE
040900140820    ***
041000140820     C     $MCOV         BEGSR
041100140903    ***
041200140904       EXSR $CLRCOVG;
041300140904       EXSR $CLRMCOV;
041400140820    ***
041500140819       KF@SS = MBSSNO;
041600140819       KF@SQ = 0;
041700140820    ***
041800140819       CHAIN KL#SQTSA MCOVR;
041900140819       IF NOT %FOUND(MCOVMPLN);
042000140904          LEAVESR;
042100140819       ENDIF;
042200140820    ***
042300140819       SETLL KL#SQTSA MCOVR;
042400140819       DOU %EOF(MCOVMPLN);
042500140820          READE KL#SQTSA MCOVR;
042600140820          IF NOT %EOF(MCOVMPLN);
042700140820    ***
042800140820             @PLANIN = MCPLAN;
042900140820             EXSR $CHKPLAN;
043000140820    ***
043100140820             IF GOOD_PLN = NO;
043200140820                ITER;
043300140820             ENDIF;
043400140820    ***
043500140820             IF CANDT = 0;
043600140820                #CANCEL = 99999999;
043700140820             ELSE;
043800140820                #CANCEL = CANDT;
043900140820             ENDIF;
044000140820    ***
044100140820             @ENRIN = MCOVTP;
044200140820             #EFFDTE = ENRLDT;
044300140820    ***
044400140820             EXSR $AD2MARY;
044500140820    ***
044600140820          ENDIF;
044700140820    ***
044800140820       ENDDO;
044900140904    ***
045000140904     C                   ENDSR
045100140904    ***
045200140904   S***S
045300140904    ***
045400140904     C     $CLRCOVG      BEGSR
045500140904    ***
045600140904       CLEAR VIS#CNE;
045700140904       CLEAR VIS@PLN;
045800140904       CLEAR VIS@ENR;
045900140904       CLEAR VIS@FRM;
046000140904       CLEAR VIS@TRM;
046100140904       CLEAR VIS@VP;
046200140904       CLEAR VIS@VE;
046300140904       CLEAR VIS@VF;
046400140904       CLEAR VIS@VT;
046500140904    ***
046600140909       CLEAR PPO#CNE;
046700140909       CLEAR PPO@PLN;
046800140909       CLEAR PPO@ENR;
046900140909       CLEAR PPO@FRM;
047000140909       CLEAR PPO@TRM;
047100140909       CLEAR PPO@VP;
047200140909       CLEAR PPO@VE;
047300140909       CLEAR PPO@VF;
047400140909       CLEAR PPO@VT;
047500140904    ***
047600140904       CLEAR DEN#CNE;
047700140904       CLEAR DEN@PLN;
047800140904       CLEAR DEN@ENR;
047900140904       CLEAR DEN@FRM;
048000140904       CLEAR DEN@TRM;
048100140904       CLEAR DEN@VP;
048200140904       CLEAR DEN@VE;
048300140904       CLEAR DEN@VF;
048400140904       CLEAR DEN@VT;
048500140820    ***
048600140820     C                   ENDSR
048700140820    ***
048800140820   S***S
048900140904    ***
049000140904     C     $CLRMCOV      BEGSR
049100140904    ***
049200140904       CLEAR DEN@MP;
049300140904       CLEAR DEN@ME;
049400140904       CLEAR DEN@MF;
049500140904       CLEAR DEN@MT;
049600140904    ***
049700140909       CLEAR PPO@MP;
049800140909       CLEAR PPO@ME;
049900140909       CLEAR PPO@MF;
050000140909       CLEAR PPO@MT;
050100140904    ***
050200140904       CLEAR VIS@MP;
050300140904       CLEAR VIS@ME;
050400140904       CLEAR VIS@MF;
050500140904       CLEAR VIS@MT;
050600140904    ***
050700140904     C                   ENDSR
050800140904    ***
050900140904   S***S
051000140819    ***
051100140819     C     $CHKPLAN      BEGSR
051200140819    ***
051300140819       GOOD_PLN = NO;
051400140819       NDX = 0;
051500140819    ***
051600140819     C                   DO        CNE
051700140819     C                   ADD       1             NDX
051800140819     C     NDX           OCCUR     PLN@
051900140819     C                   IF        EZPLAN = @PLANIN
052000140819     C                   EVAL      GOOD_PLN = YES
052100140819     C                   LEAVESR
052200140819     C                   ENDIF
052300140819     C                   ENDDO
052400140819    ***
052500140819     C                   ENDSR
052600140819    ***
052700140819   S***S
052800140819    ***
052900140819     C     $AD2MARY      BEGSR
053000140819    ***
053100140909       IF EZPLNCAT = 'PPO';
053200140819          IF #EFFDTE = #CANCEL;
053300140909             PPO@VP = @PLANIN;
053400140909             PPO@VE = @ENRIN;
053500140909             PPO@VF = #EFFDTE;
053600140909             PPO@VT = #CANCEL;
053700140819             LEAVESR;
053800140819          ENDIF;
053900140909          IF PPO#CNE = 0;
054000140909             PPO#CNE +=1;
054100140909             PPO@PLN(PPO#CNE) = @PLANIN;
054200140909             PPO@ENR(PPO#CNE) = @ENRIN;
054300140909             PPO@FRM(PPO#CNE) = #EFFDTE;
054400140909             PPO@TRM(PPO#CNE) = #CANCEL;
054500140903             LEAVESR;
054600140903          ENDIF;
054700140909          IF PPO@TRM(PPO#CNE) = #EFFDTE AND PPO@PLN(PPO#CNE) = @PLANIN AND
054800140909               PPO@ENR(PPO#CNE) = @ENRIN;
054900140909             PPO@TRM(PPO#CNE) = #CANCEL;
055000140903             LEAVESR;
055100140903          ENDIF;
055200140909          PPO#CNE +=1;
055300140909          PPO@PLN(PPO#CNE) = @PLANIN;
055400140909          PPO@ENR(PPO#CNE) = @ENRIN;
055500140909          PPO@FRM(PPO#CNE) = #EFFDTE;
055600140909          PPO@TRM(PPO#CNE) = #CANCEL;
055700140819       ENDIF;
055800140819    ***
055900140903       IF EZPLNCAT = 'VIS';
056000140903          IF #EFFDTE = #CANCEL;
056100140903             VIS@VP = @PLANIN;
056200140903             VIS@VE = @ENRIN;
056300140903             VIS@VF = #EFFDTE;
056400140903             VIS@VT = #CANCEL;
056500140903             LEAVESR;
056600140903          ENDIF;
056700140903          IF VIS#CNE = 0;
056800140903             VIS#CNE +=1;
056900140903             VIS@PLN(VIS#CNE) = @PLANIN;
057000140903             VIS@ENR(VIS#CNE) = @ENRIN;
057100140903             VIS@FRM(VIS#CNE) = #EFFDTE;
057200140903             VIS@TRM(VIS#CNE) = #CANCEL;
057300140903             LEAVESR;
057400140903          ENDIF;
057500140904          IF VIS@TRM(VIS#CNE) = #EFFDTE AND VIS@PLN(VIS#CNE) = @PLANIN AND
057600140904               VIS@ENR(VIS#CNE) = @ENRIN;
057700140903             VIS@TRM(VIS#CNE) = #CANCEL;
057800140903             LEAVESR;
057900140903          ENDIF;
058000140903          VIS#CNE +=1;
058100140903          VIS@PLN(VIS#CNE) = @PLANIN;
058200140903          VIS@ENR(VIS#CNE) = @ENRIN;
058300140903          VIS@FRM(VIS#CNE) = #EFFDTE;
058400140903          VIS@TRM(VIS#CNE) = #CANCEL;
058500140903       ENDIF;
058600140819    ***
058700140903       IF EZPLNCAT = 'DEN';
058800140903          IF #EFFDTE = #CANCEL;
058900140903             DEN@VP = @PLANIN;
059000140903             DEN@VE = @ENRIN;
059100140903             DEN@VF = #EFFDTE;
059200140903             DEN@VT = #CANCEL;
059300140903             LEAVESR;
059400140903          ENDIF;
059500140903          IF DEN#CNE = 0;
059600140903             DEN#CNE +=1;
059700140903             DEN@PLN(DEN#CNE) = @PLANIN;
059800140903             DEN@ENR(DEN#CNE) = @ENRIN;
059900140903             DEN@FRM(DEN#CNE) = #EFFDTE;
060000140903             DEN@TRM(DEN#CNE) = #CANCEL;
060100140903             LEAVESR;
060200140903          ENDIF;
060300140904          IF DEN@TRM(DEN#CNE) = #EFFDTE AND DEN@PLN(DEN#CNE) = @PLANIN AND
060400140904               DEN@ENR(DEN#CNE) = @ENRIN;
060500140903             DEN@TRM(DEN#CNE) = #CANCEL;
060600140903             LEAVESR;
060700140903          ENDIF;
060800140903          DEN#CNE +=1;
060900140903          DEN@PLN(DEN#CNE) = @PLANIN;
061000140903          DEN@ENR(DEN#CNE) = @ENRIN;
061100140903          DEN@FRM(DEN#CNE) = #EFFDTE;
061200140903          DEN@TRM(DEN#CNE) = #CANCEL;
061300140903       ENDIF;
061400140819    ***
061500140819     C                   ENDSR
061600140819    ***
061700140819   S***S
061800140903     C     $MBRWRT       BEGSR
061900140903    ***
062000140903       EXSR $VOIDCHK;
062100140903    ***
062200140909       IF PPO#CNE = 0 AND DEN#CNE = 0 AND VIS#CNE = 0;
062300140903          LEAVESR;
062400140903       ENDIF;
062500140903    ***
062600140903       EXSR $TERMCHK;
062700140903    ***
062800140909       IF PPO#CNE = 0 AND DEN#CNE = 0 AND VIS#CNE = 0;
062900140903          LEAVESR;
063000140903       ENDIF;
063100140903    ***
063200141023       EXSR $ALTIDCK;
063300141023    ***
063400140903       CLEAR DS@EVG;
063500140903       CLEAR DS@INIT;
063600140903    ***
063700140903       EXSR $MBRBASE;
063800141113    ***
063900141113       EXSR $COBRA;
064000140903    ***
064100140904       EXSR $BYPLANM;
064200140903    ***
064300140903     C                   ENDSR
064400140903    ***
064500140903   S***S
064600140903    ***
064700140903     C     $VOIDCHK      BEGSR
064800140903    ***
064900140909       IF PPO@VP <> *BLANKS AND PPO#CNE = 0;
065000140909          PPO#CNE +=1;
065100140909          PPO@PLN(PPO#CNE) = PPO@VP;
065200140909          PPO@ENR(PPO#CNE) = PPO@VE;
065300140909          PPO@FRM(PPO#CNE) = PPO@VF;
065400140909          PPO@TRM(PPO#CNE) = PPO@VT;
065500140903       ENDIF;
065600140903    ***
065700140903       IF DEN@VP <> *BLANKS AND DEN#CNE = 0;
065800140903          DEN#CNE +=1;
065900140903          DEN@PLN(DEN#CNE) = DEN@VP;
066000140903          DEN@ENR(DEN#CNE) = DEN@VE;
066100140903          DEN@FRM(DEN#CNE) = DEN@VF;
066200140903          DEN@TRM(DEN#CNE) = DEN@VT;
066300140903       ENDIF;
066400140903    ***
066500140903       IF VIS@VP <> *BLANKS AND VIS#CNE = 0;
066600140903          VIS#CNE +=1;
066700140903          VIS@PLN(VIS#CNE) = VIS@VP;
066800140903          VIS@ENR(VIS#CNE) = VIS@VE;
066900140903          VIS@FRM(VIS#CNE) = VIS@VF;
067000140903          VIS@TRM(VIS#CNE) = VIS@VT;
067100140903       ENDIF;
067200141023    ***
067300141023     C                   ENDSR
067400141023    ***
067500141023   S***S
067600141023    ***
067700141023     C     $ALTIDCK      BEGSR
067800141023    ***
067900141023       ALT@SSN = *BLANKS;
068000141023     C                   MOVE      KF@SS         @9
068100141023       IF %SUBST(@9:1:4) <> '1111';
068200141023          LEAVESR;
068300141023       ENDIF;
068400141023    ***
068500141023       CHAIN (KF@SS:'MIS') MEMALTR;
068600141023       IF NOT %FOUND(MEMALT);
068700141023          LEAVESR;
068800141023       ENDIF;
068900141023    ***
069000141023       SETLL (KF@SS:'MIS') MEMALTR;
069100141023       DOU %EOF(MEMALT);
069200141023          READE (KF@SS:'MIS') MEMALTR;
069300141023          IF NOT %EOF(MEMALT) AND %SUBST(MAALTID:11:9) = 'EVERGREEN';
069400141023             ALT@SSN = %SUBST(MAALTID:1:9);
069500141023             LEAVESR;
069600141023          ENDIF;
069700141027       ENDDO;
069800140903    ***
069900140903     C                   ENDSR
070000140903    ***
070100140903   S***S
070200140903    ***
070300140903     C     $TERMCHK      BEGSR
070400140903    ***
070500140909       IF PPO#CNE > 0;
070600140909          IF PPO@TRM(PPO#CNE) <> 99999999;
070700140909             KF@TRM = PPO@TRM(PPO#CNE);
070800140909             KF@PLN = PPO@PLN(PPO#CNE);
070900140909             KF@ENR = PPO@ENR(PPO#CNE);
071000140903             CHAIN KL#MTR EVGTRMF;
071100140903             IF %FOUND(EVRGRENTRM);
071200140909                PPO#CNE = 0;
071300140903             ELSE;
071400140903                EXSR $WRTERM;
071500140903             ENDIF;
071600140903          ENDIF;
071700140903       ENDIF;
071800140903    ***
071900140903       IF DEN#CNE > 0;
072000140903          IF DEN@TRM(DEN#CNE) <> 99999999;
072100140903             KF@TRM = DEN@TRM(DEN#CNE);
072200140903             KF@PLN = DEN@PLN(DEN#CNE);
072300140903             KF@ENR = DEN@ENR(DEN#CNE);
072400140903             CHAIN KL#MTR EVGTRMF;
072500140903             IF %FOUND(EVRGRENTRM);
072600140903                DEN#CNE = 0;
072700140903             ELSE;
072800140903                EXSR $WRTERM;
072900140903             ENDIF;
073000140903          ENDIF;
073100140903       ENDIF;
073200140903    ***
073300140903       IF VIS#CNE > 0;
073400140903          IF VIS@TRM(VIS#CNE) <> 99999999;
073500140903             KF@TRM = VIS@TRM(VIS#CNE);
073600140903             KF@PLN = VIS@PLN(VIS#CNE);
073700140903             KF@ENR = VIS@ENR(VIS#CNE);
073800140903             CHAIN KL#MTR EVGTRMF;
073900140903             IF %FOUND(EVRGRENTRM);
074000140903                VIS#CNE = 0;
074100140903             ELSE;
074200140903                EXSR $WRTERM;
074300140903             ENDIF;
074400140903          ENDIF;
074500140903       ENDIF;
074600140903    ***
074700140904     C                   ENDSR
074800140904    ***
074900140903   S***S
075000140903    ***
075100140903    *C     $WRTERM       BEGSR
075200140903    ***
075300140903       CLEAR EVGTRMF;
075400140903    ***
075500140903       ETSSNO = KF@SS;
075600140903       ETDEPNO = KF@SQ;
075700140903       ETTERMDT = KF@TRM;
075800140903       ETPLAN = KF@PLN;
075900140903       ETCOVTP = KF@ENR;
076000140903       ETTRST = KF@TRS;
076100140903       ETSUB# = KF@SUB;
076200140903       ETACCT = KF@ACC;
076300140903       ETTRANSDT = #TODAY;
076400140903    ***
076500140903       WRITE EVGTRMF;
076600140903    ***
076700140903    *C                   ENDSR
076800140903    ***
076900140903   S***S
077000140903    ***
077100140903     C     $MBRBASE      BEGSR
077200140903    ***
077300140904       XXMBRDEP = 'MBR';
077400140908       XXRELCODE = '18';
077500140904       XXSTUD = 'N';
077600140904       XXLNAM = %TRIM(MLNAME);
077700140904       XXFNAM = %TRIM(MFNAME);
077800140904       XXMNAM = %TRIM(MMI);
077900140904       XXEMAIL = %SUBST(FILL66:1:30);
078000140903    ***
078100140903       SELECT;
078200140909          WHEN MEDADT > 0 AND MEDBDT > 0;
078300140909             XXMEDIND = 'C';
078400140909          WHEN MEDADT > 0 AND MEDBDT = 0;
078500140909             XXMEDIND = 'A';
078600140909          WHEN MEDADT = 0 AND MEDBDT > 0;
078700140909             XXMEDIND = 'B';
078800140909          WHEN MEDADT = 0 AND MEDBDT = 0;
078900140909             XXMEDIND = 'E';
079000140903       ENDSL;
079100140903    ***
079200140903       IF TERMDT = 0;
079300140904          XXEMPSTS = 'FT';
079400140903       ELSE;
079500140904          XXEMPSTS = 'TE';
079600140903       ENDIF;
079700140903    ***
079800140903       IF HNDICP = '3';
079900140904          XXHNDCP = 'Y';
080000140903       ELSE;
080100140904          XXHNDCP = 'N';
080200140903       ENDIF;
080300140903    ***
080400141023     C                   IF        ALT@SSN = *BLANKS
080500140904     C                   MOVE      MBSSNO        XXSUBSCR
080600140904     C                   MOVE      MBSSNO        XXSSNMBR
080700141023     C                   ELSE
080800141023     C                   EVAL      XXSUBSCR = ALT@SSN
080900141023     C                   EVAL      XXSSNMBR = ALT@SSN
081000141023     C                   ENDIF
081100141023    ***
081200140904     C                   MOVE      EMPDT         XXHIRE
081300140904     C                   MOVE      MBENRL        XXENRL
081400140904     C                   MOVE      BIRTH         XXDOB
081500140903    ***
081600140903     C                   IF        TERMDT > 0
081700140904     C                   MOVE      TERMDT        XXTERM
081800140903     C                   ENDIF
081900140903    ***
082000140903       IF AREA > 0 AND PHONE > 0;
082100140904          XXPHONE = %EDITC(AREA:'X') + %EDITC(PHONE:'X');
082200140903       ENDIF;
082300140903    ***
082400140904       XXADDR1 = %TRIM(ADDR1);
082500140904       XXADDR2 = %TRIM(ADDR2);
082600140904       XXCITY = %TRIM(CITY);
082700140904       XXSTATE = %TRIM(STATE);
082800140904       XXZIP = %EDITC(ZIP:'X');
082900140903    ***
083000140904       XXGENDR = SEX;
083100140903    ***
083200140904       XXSALRY = %EDITC(SALARY:'X') + '.00';
083300140903    ***
083400140903       EXSR $TOKER;
083500140903       IF SMOKING = YES;
083600140904          XXSMOKE = 'T';
083700140903       ELSE;
083800140904          XXSMOKE = 'N';
083900140903       ENDIF;
084000141113    ***
084100141113    *C                   ENDSR
084200141113    ***
084300141113   S***S
084400141113    ***
084500141113     C     $COBRA        BEGSR
084600141113    ***                          OVERRIDE FOR COBRA FOR EVERGREEN
084700141113       IF EMPST <> 'C';
084800141113          LEAVESR;
084900141113       ENDIF;
085000141113    ***
085100141113       IF FCSTFL <> 'F' AND FCSTFL <> 'S';
085200141113          LEAVESR;
085300141113       ENDIF;
085400141113    ***
085500141113       IF QEDT = 0;
085600141113          LEAVESR;
085700141113       ENDIF;
085800141113    ***
085900141113     C                   MOVE      QEDT          #ISO
086000141113     C                   SUBDUR    1:*D          #ISO
086100141113     C                   MOVE      #ISO          #XSX
086200141113     C                   MOVE      #XSX          XXTERM
086300141113    ***
086400141113       XXEMPSTS = 'TE';
086500140903    ***
086600140903    *C                   ENDSR
086700140903    ***
086800140903   S***S
086900140903    ***
087000140904     C     $BYPLANM      BEGSR
087100140903    ***
087200140909       IF PPO#CNE > 0;
087300140904    *** *
087400140904          DS@EVG = DS@INIT;
087500140904    *** *
087600140909          @PLANIN = PPO@PLN(PPO#CNE);
087700140903          EXSR $CHKPLAN;
087800140904    *** *
087900141023          IF ALT@SSN = *BLANKS;
088000141023             KF@GSEQ = EZGROUP# + %EDITC(KF@SS:'X') + %EDITC(KF@SQ:'X') + 'A';
088100141023          ELSE;
088200141023             KF@GSEQ = EZGROUP# + ALT@SSN + %EDITC(KF@SQ:'X') + 'A';
088300141023          ENDIF;
088400140903     C     ' ':'0'       XLATE     KF@GSEQ       KF@GSEQ
088500140904    *** *
088600140904          EVGRPSEQ = KF@GSEQ;
088700140903          EVACCNAME = EZACNAME;
088800140903          EVTAXID = EZTAXID;
088900140919          EVGRPNBR = %SUBST(EZGROUP#:1:4);
089000140904    *** *
089100140909          EVPRDCT = 'PPO';
089200140904    *** *
089300140909          KF@ENR = PPO@ENR(PPO#CNE);
089400140904          EXSR $ENRCONV;
089500140904          EVCOVLVL = ENR@834;
089600140919    *** *
089700140922          EXSR $DIVPLN;
089800140922          EVDIVISN = @@DIV;
089900140922          EVPLANCD = @@PLN;
090000140904    *** *
090100140909          #EFFDTE = PPO@FRM(PPO#CNE);
090200140904     C                   MOVE      #EFFDTE       EVCOVEFF
090300140904    *** *
090400140909          #CANCEL = PPO@TRM(PPO#CNE);
090500140904     C                   IF        #CANCEL > 0 AND #CANCEL < 99999999
090600140904     C                   MOVE      #CANCEL       EVCOVEND
090700140904     C                   ENDIF
090800140904    *** *
090900140909          PPO@MP = PPO@PLN(PPO#CNE);
091000140909          PPO@ME = PPO@ENR(PPO#CNE);
091100140909          PPO@MF = PPO@FRM(PPO#CNE);
091200140909          PPO@MT = PPO@TRM(PPO#CNE);
091300140904    *** *
091400140909     C     ':':' '       XLATE     RMVL          RMVL
091500150626
091600150626       exsr check_term_date;
091700150626
091800140904          WRITE EVGXPTF;
091900140904    *** *
092000140904       ENDIF;
092100140904    ***
092200140904       IF DEN#CNE > 0;
092300140904    *** *
092400140904          DS@EVG = DS@INIT;
092500140904    *** *
092600140904          @PLANIN = DEN@PLN(DEN#CNE);
092700140904          EXSR $CHKPLAN;
092800140904    *** *
092900141023          IF ALT@SSN = *BLANKS;
093000141023             KF@GSEQ = EZGROUP# + %EDITC(KF@SS:'X') + %EDITC(KF@SQ:'X') + 'B';
093100141023          ELSE;
093200141023             KF@GSEQ = EZGROUP# + ALT@SSN + %EDITC(KF@SQ:'X') + 'B';
093300141023          ENDIF;
093400140904     C     ' ':'0'       XLATE     KF@GSEQ       KF@GSEQ
093500140904    *** *
093600140904          EVGRPSEQ = KF@GSEQ;
093700140904          EVACCNAME = EZACNAME;
093800140904          EVTAXID = EZTAXID;
093900140904          EVGRPNBR = EZGROUP#;
094000140904    *** *
094100140904          EVPRDCT = 'DEN';
094200140904    *** *
094300140904          KF@ENR = DEN@ENR(DEN#CNE);
094400140904          EXSR $ENRCONV;
094500140904          EVCOVLVL = ENR@834;
094600140904    *** *
094700140922          EXSR $DIVPLN;
094800140922          EVDIVISN = @@DIV;
094900140922          EVPLANCD = @@PLN;
095000140922    *** *
095100140904          #EFFDTE = DEN@FRM(DEN#CNE);
095200140904     C                   MOVE      #EFFDTE       EVCOVEFF
095300140904    *** *
095400140904          #CANCEL = DEN@TRM(DEN#CNE);
095500140904     C                   IF        #CANCEL > 0 AND #CANCEL < 99999999
095600140904     C                   MOVE      #CANCEL       EVCOVEND
095700140904     C                   ENDIF
095800140904    *** *
095900140904          DEN@MP = DEN@PLN(DEN#CNE);
096000140904          DEN@ME = DEN@ENR(DEN#CNE);
096100140904          DEN@MF = DEN@FRM(DEN#CNE);
096200140904          DEN@MT = DEN@TRM(DEN#CNE);
096300140904    *** *
096400140909     C     ':':' '       XLATE     RMVL          RMVL
096500150626
096600150626       exsr check_term_date;
096700150626
096800140904          WRITE EVGXPTF;
096900140904    *** *
097000140904       ENDIF;
097100140904    ***
097200140904       IF VIS#CNE > 0;
097300140904    *** *
097400140904          DS@EVG = DS@INIT;
097500140904    *** *
097600140904          @PLANIN = VIS@PLN(VIS#CNE);
097700140904          EXSR $CHKPLAN;
097800140904    *** *
097900141023          IF ALT@SSN = *BLANKS;
098000141023             KF@GSEQ = EZGROUP# + %EDITC(KF@SS:'X') + %EDITC(KF@SQ:'X') + 'C';
098100141023          ELSE;
098200141023             KF@GSEQ = EZGROUP# + ALT@SSN + %EDITC(KF@SQ:'X') + 'C';
098300141023          ENDIF;
098400140904     C     ' ':'0'       XLATE     KF@GSEQ       KF@GSEQ
098500140904    *** *
098600140904          EVGRPSEQ = KF@GSEQ;
098700140904          EVACCNAME = EZACNAME;
098800140904          EVTAXID = EZTAXID;
098900140904          EVGRPNBR = EZGROUP#;
099000140904    *** *
099100140904          EVPRDCT = 'VIS';
099200140904    *** *
099300140922          EXSR $DIVPLN;
099400140922          EVDIVISN = @@DIV;
099500140922          EVPLANCD = @@PLN;
099600140922    *** *
099700140904          KF@ENR = VIS@ENR(VIS#CNE);
099800140904          EXSR $ENRCONV;
099900140904          EVCOVLVL = ENR@834;
100000140904    *** *
100100140904          #EFFDTE = VIS@FRM(VIS#CNE);
100200140904     C                   MOVE      #EFFDTE       EVCOVEFF
100300140904    *** *
100400140904          #CANCEL = VIS@TRM(VIS#CNE);
100500140904     C                   IF        #CANCEL > 0 AND #CANCEL < 99999999
100600140904     C                   MOVE      #CANCEL       EVCOVEND
100700140904     C                   ENDIF
100800140904    *** *
100900140904          VIS@MP = VIS@PLN(VIS#CNE);
101000140904          VIS@ME = VIS@ENR(VIS#CNE);
101100140904          VIS@MF = VIS@FRM(VIS#CNE);
101200140904          VIS@MT = VIS@TRM(VIS#CNE);
101300140904    *** *
101400140909     C     ':':' '       XLATE     RMVL          RMVL
101500150626
101600150626       exsr check_term_date;
101700150626
101800140904          WRITE EVGXPTF;
101900140904    *** *
102000140904       ENDIF;
102100140922    ***
102200140922     C                   ENDSR
102300140922    ***
102400140922   S***S
102500140922    ***
102600140922     C     $DIVPLN       BEGSR
102700140922    ***
102800140922       KF@PLN = @PLANIN;
102900140922       @@DIV = *BLANKS;
103000140922       @@PLN = *BLANKS;
103100140922    ***
103200140922       IF KF@ENR = 'TIN';
103300140922          KF@CCTR = 'IND';
103400140922       ELSE;
103500140922          KF@CCTR = 'FAM';
103600140922       ENDIF;
103700141216    ***
103800141216       EVCOMPST = 'N';
103900141216       CHAIN KL#TSP PLNAUXR;
104000141216       IF %FOUND(PLNAUXP) AND PXACAR = 'C';
104100141216          EVCOMPST = 'Y';
104200141216       ENDIF;
104300140922    ***
104400140922       CHAIN KL#CPLN CARPLNR;
104500140922    ***
104600140922       IF NOT %FOUND(CARPLNP);
104700140922          @@DIV = %CHAR(KF@TRS) + %CHAR(KF@SUB) + %CHAR(KF@ACC);
104800140922          @@PLN = KF@PLN + KF@CCTR;
104900140922       ELSE;
105000140922          @@DIV = %SUBST(CPCID1:1:10);
105100140922          @@PLN = %SUBST(CPCID2:1:10);
105200141113       // IF EMPST = 'C';
105300141113       //    %SUBST(@@DIV:5:2) = '99';
105400141113       // ENDIF;
105500140922       ENDIF;
105600140904    ***
105700140904     C                   ENDSR
105800140904    ***
105900140904   S***S
106000140904    ***
106100140904     C     $ENRCONV      BEGSR
106200140904    ***
106300140904       ENR@834 = *BLANKS;
106400140904       SELECT;
106500140904          WHEN KF@ENR = 'TIN';
106600140904             ENR@834 = 'EMP';
106700140904          WHEN KF@ENR = 'THW';
106800140905             ENR@834 = 'ESP';
106900140904          WHEN KF@ENR = 'TPC';
107000140905             ENR@834 = 'E1D';
107100140904          WHEN KF@ENR = 'TP2';
107200140905             ENR@834 = 'ECH';
107300140904          WHEN KF@ENR = 'TFA';
107400140905             ENR@834 = 'FAM';
107500140904          OTHER;
107600140904             ENR@834 = 'XXX';
107700140904       ENDSL;
107800140903    ***
107900140903     C                   ENDSR
108000140903    ***
108100140903   S***S
108200140904    ***
108300140904     C     $TOKER        BEGSR
108400140904    ***
108500140904       SMOKING = NO;
108600140904    ***
108700140904       CHAIN (KF@SS:KF@SQ) SMOKER;
108800140904    ***
108900140904       IF NOT %FOUND(SMOKE);
109000140904          LEAVESR;
109100140904       ENDIF;
109200140904    ***
109300140904       SETLL (KF@SS:KF@SQ) SMOKER;
109400140904       DOU %EOF(SMOKE);
109500140904          READE (KF@SS:KF@SQ) SMOKER;
109600140904          IF SKRATETO = 0 AND SKRATEFR <= #TODAY;
109700140904             SMOKING = YES;
109800140904             LEAVESR;
109900140904          ELSEIF SKRATEFR <= #TODAY AND SKRATETO >= #TODAY;
110000140904             SMOKING = YES;
110100140904             LEAVESR;
110200140904          ENDIF;
110300140904       ENDDO;
110400140904    ***
110500140904     C                   ENDSR
110600140904    ***
110700140904   S***S
110800140819    ***
110900140904     C     $DEPEND       BEGSR
111000140819    ***
111100140904       CHAIN (KF@SS) DEPENR;
111200140819    ***
111300140904       IF NOT %FOUND(DEPNDC);
111400140904          LEAVESR;
111500140904       ENDIF;
111600140904    ***
111700140904       SETLL (KF@SS) DEPENR;
111800140904    ***
111900140904       DOU %EOF(DEPNDC);
112000140904          READE (KF@SS) DEPENR;
112100140904          IF NOT %EOF(DEPNDC);
112200140904    ***
112300140904             KF@SQ = DPSEQ#;
112400140904    ***
112500140904             EXSR $DCOV;
112600140904    ***
112700140904             EXSR $DEPWRT;
112800140904    ***
112900140904          ENDIF;
113000140904    ***
113100140904       ENDDO;
113200140904    ***
113300140819     C                   ENDSR
113400140819    ***
113500140819   S***S
113600140903    ***
113700140904     C     $DCOV         BEGSR
113800140904    ***
113900140904       EXSR $CLRCOVG;
114000140904    ***
114100140904       CHAIN KL#SSQ DCOVR;
114200140904       IF NOT %FOUND(DCOVA);
114300140904          LEAVESR;
114400140904       ENDIF;
114500140904    ***
114600140904       SETLL KL#SSQ DCOVR;
114700140904       DOU %EOF(DCOVA);
114800140904          READE KL#SSQ DCOVR;
114900140904          IF NOT %EOF(DCOVA);
115000140904    ***
115100140904             @PLANIN = DVPLAN;
115200140904             EXSR $CHKPLAN;
115300140904    ***
115400140904             IF GOOD_PLN = NO;
115500140904                ITER;
115600140904             ENDIF;
115700140904    ***
115800140904             IF CCANDT = 0;
115900140904                #CANCEL = 99999999;
116000140904             ELSE;
116100140904                #CANCEL = CCANDT;
116200140904             ENDIF;
116300140904    ***
116400140904             @ENRIN = 'XXX';
116500140904             #EFFDTE = DENRDT;
116600140904    ***
116700140904             EXSR $AD2MARY;
116800140904    ***
116900140904          ENDIF;
117000140904    ***
117100140904       ENDDO;
117200140904    ***
117300140904     C                   ENDSR
117400140904    ***
117500140904   S***S
117600140904     C     $DEPWRT       BEGSR
117700140904    ***
117800140904       EXSR $VOIDCHK;
117900140904    ***
118000140909       IF PPO#CNE = 0 AND DEN#CNE = 0 AND VIS#CNE = 0;
118100140904          LEAVESR;
118200140904       ENDIF;
118300140904    ***
118400140904       EXSR $TERMCHK;
118500140904    ***
118600140909       IF PPO#CNE = 0 AND DEN#CNE = 0 AND VIS#CNE = 0;
118700140904          LEAVESR;
118800140904       ENDIF;
118900140904    ***
119000140904       CLEAR DS@EVG;
119100140904       CLEAR DS@INIT;
119200140904    ***
119300140904       EXSR $DEPBASE;
119400140904    ***
119500140904       EXSR $BYPLAND;
119600140904    ***
119700140904     C                   ENDSR
119800140904    ***
119900140904   S***S
120000140904    ***
120100140904     C     $DEPBASE      BEGSR
120200140904    ***
120300140904       XXMBRDEP = 'DEP';
120400140904       XXEMPSTS = *BLANKS;
120500140904    ***
120600140904       SELECT;
120700140904          WHEN DRELCD = 'RDA' OR DRELCD = 'RSO';
120800140904             XXRELCODE = '19';
120900140904          WHEN DRELCD = 'RWI' OR DRELCD = 'RHU';
121000140904             XXRELCODE = '01';
121100140904          WHEN DRELCD = 'RPA';
121200140904             XXRELCODE = '53';
121300140904          OTHER;
121400140904             XXRELCODE = '38';
121500140904       ENDSL;
121600140904    ***
121700140904       IF DSTUDN = 'Y';
121800140904          XXSTUD = 'F';
121900140904       ELSE;
122000140904          XXSTUD = 'N';
122100140904       ENDIF;
122200140904    ***
122300140904       XXLNAM = %TRIM(DLNAME);
122400140904       XXFNAM = %TRIM(DFNAME);
122500140904       XXMNAM = %TRIM(DMI);
122600140904       XXEMAIL = *BLANKS;
122700140904    ***
122800140904       SELECT;
122900140909          WHEN DMEDAD > 0 AND DMEDBD > 0;
123000140909             XXMEDIND = 'C';
123100140909          WHEN DMEDAD > 0 AND DMEDBD = 0;
123200140909             XXMEDIND = 'A';
123300140909          WHEN DMEDAD = 0 AND DMEDBD > 0;
123400140909             XXMEDIND = 'B';
123500140909          WHEN DMEDAD = 0 AND DMEDBD = 0;
123600140909             XXMEDIND = 'E';
123700140904       ENDSL;
123800140904    ***
123900140904       IF DHNDCP = '3';
124000140904          XXHNDCP = 'Y';
124100140904       ELSE;
124200140904          XXHNDCP = 'N';
124300140904       ENDIF;
124400140904    ***
124500141023     C                   IF        ALT@SSN = *BLANKS
124600140904     C                   MOVE      MBSSNO        XXSUBSCR
124700141023     C                   ELSE
124800141023     C                   EVAL      XXSUBSCR = ALT@SSN
124900141023     C                   ENDIF
125000141023    ***
125100140904     C                   MOVE      DEPSS#        XXSSNDEP
125200140904     C                   MOVE      DBIRTH        XXDOB
125300140904    ***
125400140904       XXHIRE = *BLANKS;
125500140904       XXENRL = *BLANKS;
125600140904       XXTERM = *BLANKS;
125700140904    ***
125800140904       IF DAREA > 0 AND DPHONE > 0;
125900140904          XXPHONE = %EDITC(DAREA:'X') + %EDITC(DPHONE:'X');
126000140904       ELSEIF AREA > 0 AND PHONE > 0;
126100140904          XXPHONE = %EDITC(AREA:'X') + %EDITC(PHONE:'X');
126200140904       ENDIF;
126300140904    ***
126400140904       IF DADDR1 <> *BLANKS AND DCITY <> *BLANKS AND DSTATE <> *BLANKS AND
126500140904            DZIP <> 0;
126600140904          XXADDR1 = %TRIM(DADDR1);
126700140904          XXADDR2 = %TRIM(DADDR2);
126800140904          XXCITY = %TRIM(DCITY);
126900140904          XXSTATE = %TRIM(DSTATE);
127000140904          XXZIP = %EDITC(DZIP:'X');
127100140904       ELSE;
127200140904          XXADDR1 = %TRIM(ADDR1);
127300140904          XXADDR2 = %TRIM(ADDR2);
127400140904          XXCITY = %TRIM(CITY);
127500140904          XXSTATE = %TRIM(STATE);
127600140904          XXZIP = %EDITC(ZIP:'X');
127700140904       ENDIF;
127800140904    ***
127900140904       XXGENDR = DSEX;
128000140904    ***
128100140904       XXSALRY = *BLANKS;
128200141027    ***
128300141027     C                   MOVE      *ZEROS        #AGE              5 0
128400141027     C                   MOVE      DBIRTH        ISO#DOB
128500141027       ISO#TODAY = %DATE;
128600141027       #AGE = %diff(ISO#TODAY:ISO#DOB:*Y);
128700140904    ***
128800140904       EXSR $TOKER;
128900140904       IF SMOKING = YES;
129000140904          XXSMOKE = 'T';
129100140904       ELSE;
129200140904          XXSMOKE = 'N';
129300140904       ENDIF;
129400140904    ***
129500140904    *C                   ENDSR
129600140904    ***
129700140904   S***S
129800140904    ***
129900140904     C     $BYPLAND      BEGSR
130000140904    ***
130100140909       IF PPO#CNE > 0;
130200140904    *** *
130300140904          DS@EVG = DS@INIT;
130400140904    *** *
130500140909          @PLANIN = PPO@PLN(PPO#CNE);
130600140904          EXSR $CHKPLAN;
130700140904    *** *
130800141023          IF ALT@SSN = *BLANKS;
130900141023             KF@GSEQ = EZGROUP# + %EDITC(KF@SS:'X') + %EDITC(KF@SQ:'X') + 'A';
131000141023          ELSE;
131100141023             KF@GSEQ = EZGROUP# + ALT@SSN + %EDITC(KF@SQ:'X') + 'A';
131200141023          ENDIF;
131300140904     C     ' ':'0'       XLATE     KF@GSEQ       KF@GSEQ
131400140904    *** *
131500140904          EVGRPSEQ = KF@GSEQ;
131600140904          EVACCNAME = EZACNAME;
131700140904          EVTAXID = EZTAXID;
131800140904          EVGRPNBR = EZGROUP#;
131900140904    *** *
132000140909          EVPRDCT = 'PPO';
132100140904    *** *
132200140909          KF@ENR = PPO@ME;
132300140904          EXSR $ENRCONV;
132400140904          EVCOVLVL = ENR@834;
132500140922    *** *
132600140922          EXSR $DIVPLN;
132700140922          EVDIVISN = @@DIV;
132800140922          EVPLANCD = @@PLN;
132900140904    *** *
133000140909          #EFFDTE = PPO@FRM(PPO#CNE);
133100140904     C                   MOVE      #EFFDTE       EVCOVEFF
133200140904    *** *
133300140909          #CANCEL = PPO@TRM(PPO#CNE);
133400140904     C                   IF        #CANCEL > 0 AND #CANCEL < 99999999
133500140904     C                   MOVE      #CANCEL       EVCOVEND
133600140904     C                   ENDIF
133700140904    *** *
133800140909     C     ':':' '       XLATE     RMVL          RMVL
133900150626
134000150626       exsr check_term_date;
134100150626
134200140904          WRITE EVGXPTF;
134300141027    *** *
134400141027          IF #AGE < 19;
134500141027             %SUBST(EVGRPSEQ:30:1) = '1';
134600141027             EVPRDCT = 'DEN';
134700141027             EVPLANCD = 'DXN';
134800150626
134900150626       exsr check_term_date;
135000150626
135100141027             WRITE EVGXPTF;
135200141027          ENDIF;
135300140904    *** *
135400140904       ENDIF;
135500140904    ***
135600140904       IF DEN#CNE > 0;
135700140904    *** *
135800140904          DS@EVG = DS@INIT;
135900140904    *** *
136000140904          @PLANIN = DEN@PLN(DEN#CNE);
136100140904          EXSR $CHKPLAN;
136200140904    *** *
136300141023          IF ALT@SSN = *BLANKS;
136400141023             KF@GSEQ = EZGROUP# + %EDITC(KF@SS:'X') + %EDITC(KF@SQ:'X') + 'B';
136500141023          ELSE;
136600141023             KF@GSEQ = EZGROUP# + ALT@SSN + %EDITC(KF@SQ:'X') + 'B';
136700141023          ENDIF;
136800140904     C     ' ':'0'       XLATE     KF@GSEQ       KF@GSEQ
136900140904    *** *
137000140904          EVGRPSEQ = KF@GSEQ;
137100140904          EVACCNAME = EZACNAME;
137200140904          EVTAXID = EZTAXID;
137300140904          EVGRPNBR = EZGROUP#;
137400140904    *** *
137500140904          EVPRDCT = 'DEN';
137600140904    *** *
137700140904          KF@ENR = DEN@ME;
137800140904          EXSR $ENRCONV;
137900140904          EVCOVLVL = ENR@834;
138000140904    *** *
138100140922          EXSR $DIVPLN;
138200140922          EVDIVISN = @@DIV;
138300140922          EVPLANCD = @@PLN;
138400140922    *** *
138500140904          #EFFDTE = DEN@FRM(DEN#CNE);
138600140904     C                   MOVE      #EFFDTE       EVCOVEFF
138700140904    *** *
138800140904          #CANCEL = DEN@TRM(DEN#CNE);
138900140904     C                   IF        #CANCEL > 0 AND #CANCEL < 99999999
139000140904     C                   MOVE      #CANCEL       EVCOVEND
139100140904     C                   ENDIF
139200140904    *** *
139300140909     C     ':':' '       XLATE     RMVL          RMVL
139400150626
139500150626       exsr check_term_date;
139600150626
139700140904          WRITE EVGXPTF;
139800140904    *** *
139900140904       ENDIF;
140000140904    ***
140100140904       IF VIS#CNE > 0;
140200140904    *** *
140300140904          DS@EVG = DS@INIT;
140400140904    *** *
140500140904          @PLANIN = VIS@PLN(VIS#CNE);
140600140904          EXSR $CHKPLAN;
140700140904    *** *
140800141023          IF ALT@SSN = *BLANKS;
140900141023             KF@GSEQ = EZGROUP# + %EDITC(KF@SS:'X') + %EDITC(KF@SQ:'X') + 'C';
141000141023          ELSE;
141100141023             KF@GSEQ = EZGROUP# + ALT@SSN + %EDITC(KF@SQ:'X') + 'C';
141200141023          ENDIF;
141300140904     C     ' ':'0'       XLATE     KF@GSEQ       KF@GSEQ
141400140904    *** *
141500140904          EVGRPSEQ = KF@GSEQ;
141600140904          EVACCNAME = EZACNAME;
141700140904          EVTAXID = EZTAXID;
141800140904          EVGRPNBR = EZGROUP#;
141900140904    *** *
142000140904          EVPRDCT = 'VIS';
142100140904    *** *
142200140904          KF@ENR = VIS@ME;
142300140904          EXSR $ENRCONV;
142400140904          EVCOVLVL = ENR@834;
142500140904    *** *
142600140922          EXSR $DIVPLN;
142700140922          EVDIVISN = @@DIV;
142800140922          EVPLANCD = @@PLN;
142900140922    *** *
143000140904          #EFFDTE = VIS@FRM(VIS#CNE);
143100140904     C                   MOVE      #EFFDTE       EVCOVEFF
143200140904    *** *
143300140904          #CANCEL = VIS@TRM(VIS#CNE);
143400140904     C                   IF        #CANCEL > 0 AND #CANCEL < 99999999
143500140904     C                   MOVE      #CANCEL       EVCOVEND
143600140904     C                   ENDIF
143700140904    *** *
143800140909     C     ':':' '       XLATE     RMVL          RMVL
143900150626
144000150626       exsr check_term_date;
144100150626
144200140904          WRITE EVGXPTF;
144300140904    *** *
144400140904       ENDIF;
144500140904    ***
144600140904     C                   ENDSR
144700150626
144800150626      //===================================================================
144900150626      // Check term date - Subtract one day to make it end of month
145000150626      //===================================================================
145100150626
145200150626       begsr check_term_date;
145300150626
145400150626        if evterm > ' ';
145500150626         work_date = %date(%dec(evterm:8:0)) ;
145600150626
145700150626          if %subdt(work_date:*d) = 01 ;
145800150626           PrevMthEnd = work_date - %days(1) ;
145900150626          else ;
146000150626           PrevMthEnd = work_date - %days(%subdt(work_date: *days));
146100150626          endif ;
146200150626
146300150626         evterm = %char(%dec(PrevMthEnd));
146400150626        endif ;
146500150626
146600150626        if evcovend > ' ';
146700150626         work_date = %date(%dec(evcovend:8:0)) ;
146800150626
146900150626          if %subdt(work_date:*d) = 01 ;
147000150626           PrevMthEnd = work_date - %days(1) ;
147100150626          else ;
147200150626           PrevMthEnd = work_date - %days(%subdt(work_date: *days));
147300150626          endif ;
147400150626
147500150626         evcovend = %char(%dec(PrevMthEnd));
147600150626        endif ;
147700150626
147800150626       endsr;
147900150626
148000150626      //===================================================================
