000100160513      *===========================================================================
000200160512     H option(*noDebugIo)
000300160513      *===========================================================================
000400020523      *
000500160513      *             GROUP BENIFIT SERVICES SOFTWARE
000600160513      *
000700160513      *  Written by:   J. Torres
000800160513      *  Date Written: 05/12/16
000900160525      *  Description:  Generate XLS file for EyeMed
001000160513      *
001100160513      *
001200160513      *===========================================================================
001300160512
001400160523     Fcaraccp   if a e           k disk
001500160518
001600160523     Fcarplnl   if a e           k disk
001700160518
001800160518     Feyemedqry if   e             disk    rename(eyemedqry:queryFile)
001900160520
002000160512      *=================================================================
002100061017
002200160520     d vision          S              3A   Inz('PVS')
002300160520     d unique          s             10    inz('0000000161')
002400150820
002500160511      //==================================================================
002600160511      // mainline
002700160511      //===================================================================
002800150820
002900160511       exsr init;
003000160511       exsr main;
003100160511       exsr exit;
003200160511
003300160511      //===================================================================
003400160511      // main
003500160511      //===================================================================
003600160511
003700160511       begsr main;
003800160511
003900160518        setll 1 queryFile;
004000160518        read queryFile;
004100160511
004200160511        dow not %eof;
004300160520
004400160520          if plncat = vision;
004500160511
004600160520           chain (unique : cmtrst : csubdv : cmacct) caraccr;
004700160520           if not %found;
004800160520            cauniq = unique;
004900160520             catrst = cmtrst;
005000160520              casub# = csubdv;
005100160525              caacct = cmacct;
005200160525             castatus = 'Y';
005300160520            write caraccr;
005400160520           endif;
005500160518
005600160520           chain (unique : cmtrst : csubdv : cmplan : cmacct) carplnr;
005700160520           if not %found;
005800160520            cpuniq = unique;
005900160520             cptrst = cmtrst;
006000160525              cpsub# = csubdv;
006100160525              cpacct = cmacct;
006200160525             cpplan = cmplan;
006300160520            write carplnr;
006400160520           endif;
006500160520
006600160520          endif;
006700160511
006800160518        read queryFile;
006900160511        enddo;
007000160511
007100160511       endsr;
007200160520
007300160511      //===================================================================
007400160511      // exit
007500160511      //===================================================================
007600160511
007700160511       begsr exit;
007800160511
007900160511        *inlr = '1';
008000160511        return;
008100160511
008200160511       endsr;
008300160511
008400160511      //===================================================================
008500160511      // init
008600160511      //===================================================================
008700160511
008800160511       begsr init;
008900160520
009000160511       endsr;
009100010412
009200160511       //==============================================================
