000101211216      *================================================================================
000102211216     H option(*noDebugIo)
000103211216      *================================================================================
000104211216      * FM121BR - Agency Master App - Next Agency Number
000105211216      *================================================================================
000106211216      * Date        Int   Description
000107211216      * ----------  ---   -------------------------------------------------------------
000108211216      * 12/16/2021  jt    Original creation
000109211216      *================================================================================
000111211216
001400211221     fgratex    if   e           k disk    extfile('F.GRATEX') prefix(C)
001401211221     f                                     rename(grater:curRates)
001402211216
001403211221     fextrarate1if   e           k disk    rename(extrarates:goodRates)
001404211221     f
001405211221
001406211221     fdeleterateo    e             disk    rename(extrarates:delRates)
001407211221     f
001408211221
001409211221      //=======================================================================
001410211221
001500211221     d john            s              3  0
001501211221
002104211216      //=======================================================================
002105211216      // mainline
002106211216      //=======================================================================
002107211216
002108211216       exsr init;
002109211216       exsr main;
002110211216       exsr exit;
002111211216
002126211216       //=======================================================================
002127211216       // main2subr
002128211216       //=======================================================================
002129211216
002130211216       begsr main;
002131211216
002132211221        setll (5) curRates;
002133211221        reade (5) curRates;
002137211221        dow not %eof;
002138211221
002139211221         if cfrmdat = 20220101 and ctodat = 20221231
004302211221          and %subst(cgrplan:1:1) = 'V';
004303211221
004304211221          chain (cgrtrst:cgrsub#:cgrplan:cagebnd:
004305211221            ctypecd:20211231) goodRates;
004306211221          if not %found;
004307211221           john = john + 1;
004308211221            GRTRST = cGRTRST;
004313211221            GRSUB# = cGRSUB#;
004314211221            GRPLAN = cGRPLAN;
004315211221            AGEBND = cAGEBND;
004316211221            TYPECD = cTYPECD;
004317211221            GRFIL8 = cGRFIL8;
004318211221            GROUP# = cGROUP#;
004319211221            FILL3A = cFILL3A;
004320211221            NETRTE = cNETRTE;
004321211221            BILRTE = cBILRTE;
004322211221            GRDLTD = cGRDLTD;
004323211221            FRMDAT = cFRMDAT;
004324211221            TODAT  = cTODAT;
004325211221
004330211221           write delRates;
004331211221          //delete rates;
004332211221          endif;
004333211221
004334211221         endif;
004335211221
004336211221        reade (5) curRates;
004601211216        enddo;
005700211216
005800211216       endsr;
005801211216
005904211216       //=======================================================================
005905211216       // exit
005906211216       //=======================================================================
005907211216
005908211216       begsr exit;
005909211216
005910211216        *inlr = '1';
005911211216        return;
005912211216
005913211216       endsr;
005914211216
005915211216       //=======================================================================
005916211216       // init subr
005917211216       //=======================================================================
005918211216
005919211216       begsr init;
005920211216
005921211216       endsr;
005922211216
005923211216       //=======================================================================
