000101201210      *===========================================================================
000102201210     H option(*noDebugIo)
000103201210      *===========================================================================
000104201210      * FL020BR - List Subivision Master (re-write)
000105201210      *===========================================================================
000106201210      * Date        Int   Description
000107201210      * ----------  ---   --------------------------------------------------------
000108201210      * 12/10/2020  jt    Original creation
000109201210      //==========================================================================
000110201210
000111201210     ftrsmst    if   e           k disk    extfile('F.TRSMST')
000112201210     f                                     rename(trsmsr:trustFile)
000113201210
001800201210     fsubmst    if   e           k disk    extfile('F.SUBMST')
001801201210     f                                     rename(submsr:subFile)
001802201210
001803201210     fsubml1    if   e           k disk    extfile('F.SUBMST')
001804201210     f                                     rename(submsr:subFile1)
001805201210
001806201210     fodfacp    if   e           k disk    rename(odfacr:denFile)
001807201210
001808201210     fodrgnp    if   e           k disk    rename(odrgnr:denRegion)
001809201210
001810201210     ffl020     if a e           k disk    rename(fl020r:outfile)
001811201210
001812201210     ffl021     if a e           k disk    rename(fl021r:parmFile)
001813201210
002101201210      //==================================================================
005400201210
006502201210     d fl020br         pi
006503201210     d  inTrust                       3
006504201210     d  inSub                         3
006505201210     d  userID                       10
006506201210
006601201210      //===================================================================
006602201210      // mainline
006603201210      //===================================================================
006604201210
006605201210       exsr init;
006606201210       exsr main;
006607201210       exsr exit;
006608201210
006609201210      //===================================================================
006610201210
006611201210       begsr main;
006612201210
006613201210        exsr setllTrust;
006615201210        exsr readTrust;
006616201210
006617201210        dow not %eof;
006618201210
006619201210         exsr writeFile;
006620201210
006621201210        exsr readTrust;
006622201210        enddo;
006623201210
006624201210       endsr;
006625201210
006627201210      //===================================================================
006628201210      // setll to file
006629201210      //===================================================================
006630201210
006631201210       begsr setllTrust;
006632201210
006633201210        select;
006634201210         when inTrust = 'ALL';
006635201210          setll *loval trustFile;
006636201210
006637201210         when inTrust <> 'ALL';
006638201210          setll (%dec(inTrust:3:0)) trustFile;
006639201210
006645201210        endsl;
006646201210
006647201210       endsr;
006648201210
006649201210      //===================================================================
006650201210      // read or reade to file
006651201210      //===================================================================
006652201210
006653201210       begsr readTrust;
006654201210
006655201210        select;
006656201210         when inTrust = 'ALL';
006657201210         read trustFile;
006659201210
006660201210         when inTrust <> 'ALL';
006661201210          reade (%dec(inTrust:3:0)) trustFile;
006668201210        endsl;
006669201210
006675201210       endsr;
006676201210
006677201210      //===================================================================
006678201210      // setll to file
006679201210      //===================================================================
006680201210
006681201210       begsr setllSub;
006682201210
006683201210        select;
006684201210         when inTrust = 'ALL' and inSub = 'ALL';
006685201210          setll trtrst subFile;
006686201210
006687201210         //when inTrust = 'ALL' and inSub <> 'ALL';
006688201210         // setll (%dec(inSub:3:0)) subFile1;
006689201210
006690201210         when inTrust <> 'ALL' and inSub = 'ALL';
006691201210          setll (%dec(inTrust:3:0)) subFile;
006692201210
006693201210         when inTrust <> 'ALL' and inSub <> 'ALL';
006694201210          setll (%dec(inTrust:3:0) : %dec(inSub:3:0)) subFile;
006696201210        endsl;
006697201210
006698201210       endsr;
006699201210
006700201210      //===================================================================
006701201210      // read or reade to file
006702201210      //===================================================================
006703201210
006704201210       begsr readSub;
006705201210
006706201210        select;
006707201210         when inTrust = 'ALL' and inSub = 'ALL';
006708201210          reade trtrst subFile;
006709201210
006710201210         //when inTrust = 'ALL' and inSub <> 'ALL';
006711201210         // reade (%dec(inSub:3:0)) subFile1;
006712201210
006713201210         when inTrust <> 'ALL' and inSub = 'ALL';
006714201210          reade (%dec(inTrust:3:0)) subFile;
006715201210
006716201210         when inTrust <> 'ALL' and inSub <> 'ALL';
006717201210          reade (%dec(inTrust:3:0) : %dec(inSub:3:0)) subFile;
006718201210        endsl;
006719201210
006728201210       endsr;
006729201210
006730201210      //===================================================================
006731201210      //
006732201210      //===================================================================
018500201210
018501201210       begsr writeFile;
018503201210
018505201210        exsr setllSub;
018506201210        exsr readSub;
018507201210
018510201210        dow not %eof;
018511201210
018512201210         exsr moveFields;
018513201210         write outFile;
018514201210
018515201210        exsr readSub;
019702201210        enddo;
019703201210
019800201210       endsr;
019801201210
019802201210      //===================================================================
019803201210      // move fields
019804201210      //===================================================================
019805201210
019806201210       begsr moveFields;
019807201210
019808201210        chain (sbtrst : sbsub#) denFile;
019809201210        chain sbtrst denRegion;
019811201210
019812201210        if inTrust = 'ALL' and inSub <> 'ALL';
019813201210         if %dec(inSub:3:0) <> sbsub#;
019814201210          leavesr;
019815201210         endif;
019816201210        endif;
019817201210
019818201210        trst = trtrst;
019819201210        sub# = sbsub#;
019820201210        name = subnam;
019821201210        desc = subdsc;
019822201210        statuscd = sbdltd;
019823201210        duedayd = dueday;
019824201210        adminfee = sadmfe;
019825201210        comfee = comfee;
019826201210        //invdue =
019827201210        graceprd = grcprd;
019828201210        varcard = idvary;
019829201210        parchain = s2pchn;
019830201210        medregion = moofc#;
019831201210        addr1 = s2add1;
019832201210        addr2 = s2add2;
019833201210        city = s2city;
019834201210        state = s2st;
019835201210        zip = s2zip;
019836201210        phone = s2phon;
019837201210        fax = s2fax;
019838201210
019839201210        effdate = d'0001-01-01';
019840201210        if s2eff > 0;
019841201210         effdate = %date(%dec(s2eff:8:0) : *iso);
019842201210        endif;
019843201210
019844201210        termdate = d'0001-01-01';
019845201210        if s2trm > 0;
019846201210         termdate = %date(%dec(s2trm:8:0) : *iso);
019847201210        endif;
019848201210
019849201210        hyg# = s2hyg#;
019850201210        den# = s2dent;
019851201210        bed# = s2beds;
019852201210
019853201210       endsr;
019854201210
019855201210      //===================================================================
019856201210      // criteria page
019857201210      //===================================================================
019858201210
019859201210       begsr criteriaPage;
019860201210
019861201210        rfield = 'Trust -' + ' ' + inTrust;
019862201210        write parmFile;
019863201210
019864201210        rfield = 'Sub# -' +  ' '  + inSub;
019865201210        write parmFile;
019866201210
019867201210        rfield = 'Date Ran -' +  ' '  + %char(%date);
019868201210        write parmFile;
019869201210
019870201210        rfield = 'Time Ran' + ' ' + %char(%Time);
019871201210        write parmFile;
019872201210
019932201210        rfield = 'USER ID - ' + %trim(userID);
019933201210        write parmFile;
019934201210
019941201210       endsr;
019942201210
034702201210      //===================================================================
034703201210      // exit
034704201210      //===================================================================
034705201210
034706201210       begsr exit;
034707201210
034708201210        *inlr = '1';
034709201210        return;
034710201210
034711201210       endsr;
034712201210
034713201210      //===================================================================
034714201210      // init
034715201210      //===================================================================
034716201210
034717201210       begsr init;
034718201210
034719201210        exsr criteriaPage;
034720201210
034729201210       endsr;
034730201210
034731201210       //==============================================================
