0001000502280001 H*    020                      B                                     FL130
0002009903160012  *****************************************************************
0003009810010008  *  FL130 - THIS PROGRAM WILL LIST THE GROUP# / CONTRACT#  FILE
0004009810010004  *                                                               *        1
0005009810010005  *            WRITTEN BY - DAVID KETTERMAN                       *        1
0006009810010006  *            DATE - 11/08/90                                    *        1
0007009810010007  *                                                               *        1
000800981001      *       10/01/98 GSP  Y2K
0009009810010012  *****************************************************************
001000050228   X***X
001100050228   X***X conversion to RPGIV
001200050228   X***X SK
001300050228   X***X
001400050228   X***X
0015000502280013 FGRPCTRL   IP   e           k DISK
0016000502280014 FCARMST    IF   E           K DISK
0017000502280015 FREPORT    O    F  132        PRINTER OFLIND(*INOF)
0018000502280022 D*ARMST  NS  01
0019009810010023  *  CARRIER MASTER FILE
0020000502280024 D*                                       4  43 CNAME
0021009810010025  *                                      44  83 CNAMEC
0022009810010026  *
0023009102150027 D                UDS
0024009102150028 D  CONAME               201    240
0025009102150029 D  TIME                 242    247  0
0026000502280016 I*RPCTRL   NS  01
0027000502280016 IGRoupr
0028009810010017  *  GROUP# / CONTRACT# FILE
0029000502280018 I                                          GCARCD        L1
0030000502280019 I*                                 4   18  GROUP#
0031000502280020 I*                                19   27  CNTRCT
0032000502280021 I*                                48   48  DLTCD
0033009810010030  *
0034009810010031  *  GET CARRIER NAME ON L1
0035009810010032  *
0036009102150033 C   OF              SETON                                        L1
0037000502280034 C   L1gcarcd        CHAIN     CARMST                             H1
0038009102150035 C     #END          TAG
003900981001     C/EJECT
0040009810010036 OREPORT    H    1P                     1 01
0041009102150037 O         OR    OF
0042009810010050 O                                            5 'FL130'
0043009102150038 O                                           88 '**'
0044009102150039 O                       CONAME              86
0045009102150040 O                                           46 '**'
0046009810010041 O          H    1P                     1
0047009102150042 O         OR    OF
0048009810010043 O                       UDATE         Y      8
0049009810010041 O          H    1P                     2
0050009810010042 O         OR    OF
0051009810010052 O                       TIME                 8 '  :  :  '
0052009102150044 O                                           76 'GROUP# / CONTRACT# FILE '
0053009102150045 O                                           83 'LISTING'
0054009810010046 O                                          124 'PAGE:'
0055009810010047 O                       PAGE          Z    130
0056009810010053 O          H    1P                     1
0057009102150054 O         OR    OF
0058009102150055 O                                           24 '------------------------'
0059009102150056 O                                           48 '------------------------'
0060009102150057 O                                           72 '------------------------'
0061009102150058 O                                           96 '------------------------'
0062009102150059 O                                          120 '------------------------'
0063009102150060 O                                          132 '------------'
0064009102150061 O          H    1P                  1
0065009102150062 O         OR    OF
0066009102150063 O                                            4 'CODE'
0067009102150064 O                                           32 '----------   CARRIER NAM'
0068009102150065 O                                           48 'E   ------------'
0069009102150066 O                                           65 'GROUP NUMBER'
0070009102150067 O                                           83 'CONTRACT #'
0071009102150068 O          H    1P                  1  2
0072009102150069 O         OR    OF
0073009102150070 O                                           24 '------------------------'
0074009102150071 O                                           48 '------------------------'
0075009102150072 O                                           72 '------------------------'
0076009102150073 O                                           96 '------------------------'
0077009102150074 O                                          120 '------------------------'
0078009102150075 O                                          132 '------------'
0079000502280076 O          D                           1
0080000502280077 O               L1      gcarcd               3
0081009102150078 O               L1      CNAME               48
0082000502280079 O                       ggroup              68
0083009102150080 O                       CNTRCT              82
