000100950328     H DFTNAME(FL140)
000200981001      * FL140 - AA CODES FILE LIST
000300981001      *       10/01/98 GSP  Y2K
000301020425      * szz  4/25/02 Converted to ILE and added direct dial field.
000400981001      *
0005010204250034 FAACODE    IP   E           K DISK
0006009503280018 FREPORT    O    F  132        PRINTER OFLIND(*INOF)
0007009102150028 D                UDS
0008009102150029 D  CONAME               201    240
0009009102150030 D  TIME                 242    247  0
0015009810010051 OREPORT    H    1P                     1 01
0016009102150052 O         OR    OF
0017009810010065 O                                            5 'FL140'
0018009102150053 O                                           45 '**'
0019009102150054 O                       CONAME              86
0020009102150055 O                                           88 '**'
0021009810010063 O          H    1P                     1
0022009810010064 O         OR    OF
0023009810010058 O                       UDATE         Y      8
0024009810010056 O          H    1P                     1
0025009102150057 O         OR    OF
0026009810010067 O                       TIME                 8 '  :  :  '
0027009503280059 O                                           76 'AA CODES FILE LISTING'
0028009810010061 O                                          124 'PAGE:'
0029009810010062 O                       PAGE          Z    130
0030009810010068 O          H    1P                     1
0031009102150069 O         OR    OF
0032009102150070 O                                           24 '------------------------'
0033009102150071 O                                           48 '------------------------'
0034009102150072 O                                           72 '------------------------'
0035009102150073 O                                           96 '------------------------'
0036009102150074 O                                          120 '------------------------'
0037009102150075 O                                          132 '------------'
0038009102150076 O          H    1P                  1
0039009102150077 O         OR    OF
0040009503280078 O                                            7 'AA CODE'
0041009503280080 O                                           27 'FIRST NAME'
0042009503280080 O                                           49 'LAST NAME'
0043000004060080 O                                           70 'E MAIL'
004301020425     O                                          109 'DIRECT DIAL#'
0044009503280081 O          H    1P                  1  2
0045009102150082 O         OR    OF
0046009102150083 O                                           24 '------------------------'
0047009102150084 O                                           48 '------------------------'
0048009102150085 O                                           72 '------------------------'
0049009102150086 O                                           96 '------------------------'
0050009102150087 O                                          120 '------------------------'
0051009102150088 O                                          132 '------------'
0052000204250089 O****      D    01                     1
0052010204250089 O          D                           1
0053009503280090 O                       ACODE                5
0054000204250092 O                       AFNAM               37
0055000204250091 O                       ALNAM               60
0056000004060091 O                       AEMLA               89
005700020425     O                       ADDIAL             109 '   -   -    '
