0001009903160031  ****************************************************************    FL150
0002009809280008  *  FL150 - THIS PROGRAM WILL PRODUCE A LISTING OF CODES, (ADD    *  FL150
0003009809280009  *           CHANGE DELETE). THE TYPE AND DESCRIPTION FOR THE CODE*  FL150
0004009809280010  *           TYPE ARE IN LDA. IT WILL PRINT SELECT OR ALL CODES,  *  FL150
0005009809280011  *           OCL CONTROLLED
0006009809280004  *                                                                *  FL150
0007009809280005  * WRITTEN BY - DAVE GOBEL DATE - 06/88
0008000408100027  *                                                                *
0009000408100027  * 08/09/04 dlk - convert to rpgle, add plan cat type description *
0010000503010027  * 03/01/05 ssk - ignore master type enteries.                    *
0011000408100027  *                                                                *
0012000408090031  ****************************************************************
0013000408100033 FCODES     IP   e           k DISK                                         FL150
001400050301     FCODESL1   IF   E           K DISK    RENAME(CODESR:FL1) PREFIX(Z)
0015000408090015 Fpctmst    if   e           k DISK
0016000408090034 FREPORT    O    F  132        PRINTER OFLIND(*INOF)                        FL150
0017000503020035 D*TAB1************S**************1****DIM(24)*CTDATA*PERRCD(1)********                      FL1
0018000503020035 D*TAB2************S*************25****DIM(24)*ALT(TAB1)***************
001900050302     d key@            s              3a
0020009102150044 D                UDS                                                       FL150
0021009102150045 D  CODUDS                 1      1                                         FL150
0022009102150046 D  DESUDS                 3     32                                         FL150
0023009102150047 D  NAME                 201    240                                         FL150Y
0024009102150049 D  TOD                  242    247  0                                      FL150Y
0025000408100036 ICODESr                                                                    FL150
0026000408100037 I                                          TYPE          L1                FL150
002700040809
002800040809     c                   if        coduds <> *blanks and coduds <> type
002900040809     c                   goto      #end
003000040809     c                   end
003100040809
003200050301     c                   if        type = '*'
003300050301     c                   goto      #end
003400050301     c                   end
003500050301
003600040809     c                   if        *inl1
003700050301     C                   EVAL      KEY@ = '*' + TYPE
003800050301     C     KEY@          CHAIN     FL1
003900050302     c                   if        %found(codesl1)
004000050302     c                   eval      *in12 = *on
004100050302     c                   movel(p)  zLDESCR       tab2             25
004200050302     c                   else
004300050302     c                   eval      *in12 = *off
004400050302     c                   endif
0045000503020061 C*****TYPE**********LOOKUP****TAB1**********TAB2*********************12                   FL150
004600040810     c                   eval      *in20 = *off
004700040810     c                   except    l1tot
004800040809     c                   end
004900040809
0050000408090060 C                   ADD       1             CNT               3 0                         FL150
005100040809
005200040809     c                   if        type = 'P'
005300040810     c                   eval      *in20 = *on
0054000408100162 C                   clear                   pcdesout         30
0055000408090100 C     action        chain     pctmst
005600040809     c                   if        %found(pctmst)
0057000408100162 C                   movel     pcdes         pcdesout
005800040809     c                   end
005900040809     c                   end
006000040809
006100040809     c   of              except    head
006200040809     c                   except    detail
006300040809     c     #end          tag
006400040809
006500040809     c     *inzsr        begsr
006600040809     c                   except    head
006700040809     c                   endsr
006800040809
0069000408090063 OREPORT    e            head           1 01                                FL150
0070009809280082 O                                            5 'FL150'
0071009102150065 O                                           47 '****'                      FL150
0072009102150066 O                       NAME                86                             FL150
0073009102150067 O                                           90 '****'                      FL150
0074000408090068 O          e            head           1                                   FL150
0075009809280073 O                       UDATE         Y      8                             FL150
0076000408090068 O          e            head           2                                   FL150
0077009809280084 O                       TOD                  8 '  :  :  '                  FL150
0078009102150070 O                                           75 'CODE FILE LISTING'         FL150
0079000408090068 O          e            head           2                                   FL150
0080009810010078 O                                          126 'PAGE:'
0081009810010079 O                       PAGE          Z    130                             FL150
0082000408090068 O          e            head           1                                   FL150
0083009102150087 O                                           24 '------------------------'  FL150
0084009102150088 O                                           48 '------------------------'  FL150
0085009102150089 O                                           72 '------------------------'  FL150
0086009102150090 O                                           96 '------------------------'  FL150
0087009102150091 O                                          120 '------------------------'  FL150
0088009102150092 O                                          132 '------------'              FL150
0089000408090068 O          e            head           1                                   FL150
0090000408100095 O                                            4 'PRE-'                      FL150
0091000408100101 O                                           17 'DESCRIPTION'               FL150
0092000408100095 O                                           38 'CODE'                      FL150
0093000408100096 O                                           45 'SHORT'                     FL150
0094000408100097 O                                           57 'LONG'                      FL150
0095000408100098 O                                           91 'STATUS'                    FL150
0096000408100099 O                                           99 'ACTION'                    FL150
0097000408090068 O          e            head           1                                   FL150
0098000408100095 O                                            4 'FIX '                      FL150
0099000408100104 O                                           51 'DESCRIPTION'               FL150
0100000408100105 O                                           64 'DESCRIPTION'               FL150
0101000408090068 O          e            head           1                                   FL150
0102009102150110 O                                           24 '------------------------'  FL150
0103009102150111 O                                           48 '------------------------'  FL150
0104009102150112 O                                           72 '------------------------'  FL150
0105009102150113 O                                           96 '------------------------'  FL150
0106009102150114 O                                          120 '------------------------'  FL150
0107009102150115 O                                          132 '------------'              FL150
0108000408090116 O          e            detail         1                                   FL150
0109000408100124 O                       TYPE                 2                             FL150
0110000503020125 O                  12   TAB2                30                             FL150
0111000408100126 O                 N12                       24 '* UNDEFINED CODE *'
0112000408100117 O                       CODE                37                             FL150
0113000408100118 O                       SDESCR              50                             FL150
0114000408100119 O                       LDESCR              83                             FL150
0115000408100120 O                       cddltd              89                             FL150
0116000408100121 O                       ACTION              95                             FL150
0117000408100122 O                                           96 '-'
0118000408100123 O                       actn2               97
0119000408100125 O                  20   pcdesout           132                             FL150
0120000408100127 O          e            l1tot          1                                   FL150
0121009102150128 O                                           10 ' '                         FL150
0122009102150129 O          T    LR                  3                                      FL150
0123009102150130 O                                           50 '*** TOTAL NUMBER CODES :'  FL150
0124009102150131 O                       CNT           Z     66                             FL150
