000100210805      *========================================================================
000200210709     h dftactgrp(*no) option(*noDebugIo) bnddir('GBSBIND')
000300201221      *========================================================================
000400220727      * FM050R2 - Declining Life Benefit Rate Maintenancee
000500180326      *========================================================================
000600180326      * Date         Int  Description
000700201208      * ----------   ---  -----------------------------------------------------
000800220722      * 07/22/2022   jt   Original Creation
000900180326      *========================================================================
001000180628
001100220727     ffm050d2   cf   e             WorkStn Handler('PROFOUNDUI(HANDLER)')
001101201208
001107220727     fsubmst    if   e           k disk    rename(submsr:subFile)
001108220722     f                                     extfile('F.SUBMST')
001109220722
001124220727     ftrsmst    if   e           k disk    rename(trsmsr:trustFile)
001125220722     f                                     extfile('F.TRSMST')
001126220727
001127220727     fplnmst    if   e           k disk    rename(plnmsr:planFile)
001128220727     f                                     extfile('F.PLNMST')
001129220727
001130220727     fdeclif    uf a e           k disk    rename(declir:declinFile)
001131220727     f                                     extfile('F.DECLIF')
001132220727
001133220727     fdlfhist1  uf a e           k disk    rename(rdlfhist:histFile)
001134220727     f                                     extfile('F.DLFHIST1')
001135220721
001300201221      //=======================================================================
001400180323
001500180323     d psds           sds
001600201221     d  proc_name        *proc
001601201221     d  jobName              244    253
001602201221     d  userName             254    263
001603201221     d  jobNumber            264    269
001604210709
001610220721     d process         s              1
001618201221     d valid           s              1
001619220721     d strustc         s              3
001621220727     d invalid         s              1
001624210706     d cancel          s              1
001625220721     d changed         s              1
001638220722     d continue        s              1
001639220817     d e1envir         s             15
001640220817     d e1libl          s             10
001641220817     d e1Lib2          s             10
001642220817     d envColor        s             10
001643220817     d e1Acnm          s             40
001644220817
001645220817     d getEnv          pr                  ExtPgm('GETENVR')
001646220817     d  e1envir                      15
001647220817     d  e1libl                       10
001648220817     d  e1Lib2                       10
001649220817     d  envColor                     10
001650220817     d  e1Acnm                       40
001651220727
001652220727     D @PARM           DS
001653220727     D  #TRST                  1      3S 0
001654220727     D  #SUB                   4      6S 0
001655220727     D  @PLAN                  7     10A
001656220722
001657220722     d ChkPgmAuth      pr                  extpgm('CHKPGMAUTH')
001658220722     d  pgmname                      10
001659220722     d  continue                      1
001660220722
001714220727     d dclinHist       pr                  ExtPgm('FM051R')
001715220727     d  @parm                        10
001718210716
002103220727     d fm050r2         pi
002104220721     d  inTrust                       3  0
002105220722     d  inSub                         3  0
002106220727     d  inPlan                        4
002107220722     d  inMode                        1
002108201208
002200201221      //=======================================================================
002300180323      // mainline
002400201221      //=======================================================================
002500180323
002600180323       exsr init;
002700180323       exsr main;
002800180323       exsr exit;
002900180323
003000201221      //=======================================================================
003100180323      // main
003200201221      //=======================================================================
003300180323
003400180323       begsr main;
003500180323
003501210709        exsr loadFields;
003502210709
003600180323        dow btnExit = '0';
003702201221
003703201221         exfmt screen1;
003900180323
004000180323         exsr checkButton;
004100180323
004200180323        enddo;
004300180323
004400180323       endsr;
004500180323
004566201221      //=======================================================================
004567201208      // checkButton
004568201221      //=======================================================================
004569201208
004570201208       begsr checkButton;
004571201208
004572201208        if btnExit = '1';
004573201208         leavesr;
004574201208        endif;
004661210805
004671220721        if btnGreen = '1';
004672220721         exsr validRcd;
004673220721         if valid = '0';
004674220721          exsr moveFields;
004675220721         endif;
004676220721         btnGreen = '0';
004677220721        endif;
004678220721
004679220727        if btnDelete = '1';
004680220727         exsr deleteRcd;
004681220727        endif;
004683220727
004684220721        if btnHist = '1';
004685220721         strustc = %editc(strust:'X');
004686220727          #trst = inTrust;
004687220727           #sub = inSub;
004688220727           @plan = inPlan;
004689220727          dclinHist(@parm);
004690220721         btnHist = '0';
004691220721        endif;
004692220721
004693201208       endsr;
004694201208
004695201221      //=======================================================================
004700210716      // load fields
004800201221      //=======================================================================
004900180323
005000201208       begsr loadFields;
005001220722
005002220722        chain strust trustFile;
005003220722        if %found;
005004220722         strustname = tname;
005005220722        endif;
005006220727
005007220727        chain (strust : ssub#) subFile;
005102210716        if %found;
005103220727         ssubname = subnam;
005105220727        endif;
005106220722
005107220727        chain (strust : ssub# : splan) planFile;
005108220727        if %found;
005109220727         splandesc = pdescr;
005110220727        endif;
005111220727
005112220727        chain (strust : ssub#  : inplan) declinFile;
005113220727        if %found;
005114220727
005116220727         srndflg = rndflg;
005117220727         srndamt = rndamt;
005127220721
005128220727         sabf01 = abf01;
005129220727         sabf02 = abf02;
005130220727         sabf03 = abf03;
005131220727         sabf04 = abf04;
005132220727         sabf05 = abf05;
005133220727         sabf06 = abf06;
005134220727         sabf07 = abf07;
005135220727         sabf08 = abf08;
005136220727         sabf09 = abf09;
005137220727         sabf10 = abf10;
005138220727
005139220727         sabt01 = abt01;
005140220727         sabt02 = abt02;
005141220727         sabt03 = abt03;
005142220727         sabt04 = abt04;
005143220727         sabt05 = abt05;
005144220727         sabt06 = abt06;
005145220727         sabt07 = abt07;
005146220727         sabt08 = abt08;
005147220727         sabt09 = abt09;
005148220727         sabt10 = abt10;
005149220727
005150220727         sdper01 = dper01;
005151220727         sdper02 = dper02;
005152220727         sdper03 = dper03;
005153220727         sdper04 = dper04;
005154220727         sdper05 = dper05;
005155220727         sdper06 = dper06;
005156220727         sdper07 = dper07;
005157220727         sdper08 = dper08;
005158220727         sdper09 = dper09;
005159220727         sdper10 = dper10;
005160220722
005183210716        endif;
005184210716
005602201208       endsr;
005700180323
005701201221      //=======================================================================
005702220721      // add history
005703210805      //=======================================================================
005704201221
005705220721       begsr addHistory;
005706220721
005708220721        huserid = userName;
005709220721        hdate = %dec(%date);
005711220721        htime = %dec(%time);
005712220721        hjob  = jobName;
005713220721        hnumber = jobNumber;
005715220721
005716220721        htrst = strust;
005717220722        hsub = ssub#;
005733220721
005791220727        hbrndflg = rndflg;
005792220727        hbrndamt = rndamt;
005793220727
005794220727        hbabf01 = abf01;
005795220727        hbabf02 = abf02;
005796220727        hbabf03 = abf03;
005797220727        hbabf04 = abf04;
005798220727        hbabf05 = abf05;
005799220727        hbabf06 = abf06;
005800220727        hbabf07 = abf07;
005801220727        hbabf08 = abf08;
005802220727        hbabf09 = abf09;
005803220727        hbabf10 = abf10;
005804220727
005805220727        hbabt01 = abt01;
005806220727        hbabt02 = abt02;
005807220727        hbabt03 = abt03;
005808220727        hbabt04 = abt04;
005809220727        hbabt05 = abt05;
005810220727        hbabt06 = abt06;
005811220727        hbabt07 = abt07;
005812220727        hbabt08 = abt08;
005813220727        hbabt09 = abt09;
005814220727        hbabt10 = abt10;
005815220727
005816220727        hbdper01 = dper01;
005817220727        hbdper02 = dper02;
005818220727        hbdper03 = dper03;
005819220727        hbdper04 = dper04;
005820220727        hbdper05 = dper05;
005821220727        hbdper06 = dper06;
005822220727        hbdper07 = dper07;
005823220727        hbdper08 = dper08;
005824220727        hbdper09 = dper09;
005825220727        hbdper10 = dper10;
005826220727
005827220721        write histFile;
005828201221
006026201221       endsr;
006027201221
006028220721      //=======================================================================
006029220721      // change history
006030220721      //=======================================================================
006031220721
006032220721       begsr changeHistory;
006033220721
006034220721        changed = '0';
006035220722
006044220727        //if IH1T <> HBIH1T;
006045220727        // HAIH1T = IH1T;
006046220727        //endif;
006047220727
006048220727        huserid = userName;
006049220727        hdate = %dec(%date);
006050220727        htime = %dec(%time);
006051220727        hjob  = jobName;
006052220727        hnumber = jobNumber;
006053220727
006054220727        htrst = strust;
006055220727        hsub = ssub#;
006056220727
006057220727        if hbrndflg = rndflg;
006058220727         harndflg = rndflg;
006059220727        endif;
006060220727
006061220727        if hbrndamt = rndamt;
006062220727         harndamt = rndamt;
006063220727        endif;
006064220727
006065220727        if hbabf01 = abf01;
006066220727         haabf01 = abf01;
006067220727        endif;
006068220727
006069220727        if hbabf02 = abf02;
006070220727         haabf02 = abf02;
006071220727        endif;
006072220727
006073220727        if hbabf03 = abf03;
006074220727         haabf03 = abf03;
006075220727        endif;
006076220727
006077220727        if hbabf04 = abf04;
006078220727         haabf04 = abf04;
006079220727        endif;
006080220727
006081220727        if hbabf05 = abf05;
006082220727         haabf05 = abf05;
006083220727        endif;
006084220727
006085220727        if hbabf06 = abf06;
006086220727         haabf06 = abf06;
006087220727        endif;
006088220727
006089220727        if hbabf07 = abf07;
006090220727         haabf07 = abf07;
006091220727        endif;
006092220727
006093220727        if hbabf08 = abf08;
006094220727         haabf08 = abf08;
006095220727        endif;
006096220727
006097220727        if hbabf09 = abf09;
006098220727         haabf09 = abf09;
006099220727        endif;
006100220727
006101220727        if hbabf10 = abf10;
006102220727         haabf10 = abf10;
006103220727        endif;
006104220727
006105220727        if hbabt01 = abt01;
006106220727         haabt01 = abt01;
006107220727        endif;
006108220727
006109220727        if hbabt02 = abt02;
006110220727         haabt02 = abt02;
006111220727        endif;
006112220727
006113220727        if hbabt03 = abt03;
006114220727         haabt03 = abt03;
006115220727        endif;
006116220727
006117220727        if hbabt04 = abt04;
006118220727         haabt04 = abt04;
006119220727        endif;
006120220727
006121220727        if hbabt05 = abt05;
006122220727         haabt05 = abt05;
006123220727        endif;
006124220727
006125220727        if hbabt06 = abt06;
006126220727         haabt06 = abt06;
006127220727        endif;
006128220727
006129220727        if hbabt07 = abt07;
006130220727         haabt07 = abt07;
006131220727        endif;
006132220727
006133220727        if hbabt08 = abt08;
006134220727         haabt08 = abt08;
006135220727        endif;
006136220727
006137220727        if hbabt09 = abt09;
006138220727         haabt09 = abt09;
006139220727        endif;
006140220727
006141220727        if hbabt10 = abt10;
006142220727         haabt10 = abt10;
006143220727        endif;
006144220727
006145220727
006146220727        if hbdper01 = dper01;
006147220727         hadper01 = dper01;
006148220727        endif;
006149220727
006150220727        if hbdper02 = dper02;
006151220727         hadper02 = dper02;
006152220727        endif;
006153220727
006154220727        if hbdper03 = dper03;
006155220727         hadper03 = dper03;
006156220727        endif;
006157220727
006158220727        if hbdper04 = dper04;
006159220727         hadper04 = dper04;
006160220727        endif;
006161220727
006162220727        if hbdper05 = dper05;
006163220727         hadper05 = dper05;
006164220727        endif;
006165220727
006166220727        if hbdper06 = dper06;
006167220727         hadper06 = dper06;
006168220727        endif;
006169220727
006170220727        if hbdper07 = dper07;
006171220727         hadper07 = dper07;
006172220727        endif;
006173220727
006174220727        if hbdper08 = dper08;
006175220727         hadper08 = dper08;
006176220727        endif;
006177220727
006178220727        if hbdper09 = dper09;
006179220727         hadper09 = dper09;
006180220727        endif;
006181220727
006182220727        if hbdper10 = dper10;
006183220727         hadper10 = dper10;
006184220727        endif;
006186220727
006187220727        write histFile;
006188220722
006189220721       endsr;
006190220721
006191201221      //=======================================================================
006192210706      // valid record
006193201221      //=======================================================================
006194201221
006195210716       begsr validRcd;
006196220721
006197220721        valid = '0';
006198220727        errRound = '0';
006199220727        errAmt = '0';
006200220727
006201220727        if btnText = 'Restore';
006202220727         exsr restoreRcd;
006203220727         leavesr;
006204220727        endif;
006205220727
006211220727        if srndamt = 0;
006212220727         errAmt = '1';
006213220727          valid = '1';
006214220727         leavesr;
006215220727        endif;
006216220727
006217220727        exsr checkAges;
006218220727        if invalid  = '1';
006219220727         valid = '1';
006220220727         leavesr;
006221220727        endif;
006222220727
006223220727        if srndflg = ' ' ;
006224220727         errRound = '1';
006225220727          valid = '1';
006226220727         leavesr;
006227220727        endif;
006228220727
006458220721       endsr;
006459201221
006461220727      //=======================================================================
006462220727      // valid record
006463220727      //=======================================================================
006464220727
006465220727       begsr checkAges;
006466220727
006469220727        chain (inTrust : inSub : inPlan) declinFile;
006470220727
006471220727        invalid = '0';
006472220727
006473220727        errRow1 = '0';
006474220727        errRow2 = '0';
006475220727        errRow3 = '0';
006476220727        errRow4 = '0';
006477220727        errRow5 = '0';
006478220727        errRow6 = '0';
006479220727        errRow7 = '0';
006480220727        errRow8 = '0';
006481220727        errRow9 = '0';
006482220727        errRow10 = '0';
006483220727
006484220727        errBen1 = '0';
006485220727        errBen2 = '0';
006486220727        errBen3 = '0';
006487220727        errBen4 = '0';
006488220727        errBen5 = '0';
006489220727        errBen6 = '0';
006490220727        errBen7 = '0';
006491220727        errBen8 = '0';
006492220727        errBen9 = '0';
006493220727        errBen10 = '0';
006494220727
006495220727        if sabf01 > 0 and (sabt01 = 0 or sabt01 < sabf01);
006496220727         invalid = '1';
006497220727          errRow1 = '1';
006498220727         leavesr;
006499220727        endif;
006500220727
006501220727        if sdper01 > 0 and (sabt01 = 0 or sabt01 = 0);
006502220727         invalid = '1';
006503220727          errBen1 = '1';
006504220727         leavesr;
006505220727        endif;
006506220727
006507220727        if sabf02 > 0 and (sabt02 = 0 or sabt02 < sabf02);
006508220727         invalid = '1';
006509220727          errRow2 = '1';
006510220727         leavesr;
006511220727        endif;
006512220727
006513220727        if sdper02 > 0 and (sabt02 = 0 or sabt02 = 0);
006514220727         invalid = '1';
006515220727          errBen2 = '1';
006516220727         leavesr;
006517220727        endif;
006518220727
006519220727        if sabf03 > 0 and (sabt03 = 0 or sabt03 < sabf03);
006520220727         invalid = '1';
006521220727          errRow3 = '1';
006522220727         leavesr;
006523220727        endif;
006524220727
006525220727        if sdper03 > 0 and (sabt03 = 0 or sabt03 = 0);
006526220727         invalid = '1';
006527220727          errBen3 = '1';
006528220727         leavesr;
006529220727        endif;
006530220727
006531220727        if sabf04 > 0 and (sabt04 = 0 or sabt04 < sabf04);
006532220727         invalid = '1';
006533220727          errRow4 = '1';
006534220727         leavesr;
006535220727        endif;
006536220727
006537220727        if sdper04 > 0 and (sabt04 = 0 or sabt04 = 0);
006538220727         invalid = '1';
006539220727          errBen4 = '1';
006540220727         leavesr;
006541220727        endif;
006542220727
006543220727        if sabf05 > 0 and (sabt05 = 0 or sabt05 < sabf05);
006544220727         invalid = '1';
006545220727          errRow5 = '1';
006546220727         leavesr;
006547220727        endif;
006548220727
006549220727        if sdper05 > 0 and (sabt05 = 0 or sabt05 = 0);
006550220727         invalid = '1';
006551220727          errBen5 = '1';
006552220727         leavesr;
006553220727        endif;
006554220727
006555220727        if sabf06 > 0 and (sabt06 = 0 or sabt06 < sabf06);
006556220727         invalid = '1';
006557220727          errRow6 = '1';
006558220727         leavesr;
006559220727        endif;
006560220727
006561220727        if sdper06 > 0 and (sabt06 = 0 or sabt06 = 0);
006562220727         invalid = '1';
006563220727          errBen6 = '1';
006564220727         leavesr;
006565220727        endif;
006566220727
006567220727        if sabf07 > 0 and (sabt07 = 0 or sabt07 < sabf07);
006568220727         invalid = '1';
006569220727          errRow7 = '1';
006570220727         leavesr;
006571220727        endif;
006572220727
006573220727        if sdper07 > 0 and (sabt07 = 0 or sabt07 = 0);
006574220727         invalid = '1';
006575220727          errBen7 = '1';
006576220727         leavesr;
006577220727        endif;
006578220727
006579220727        if sabf08 > 0 and (sabt08 = 0 or sabt08 < sabf08);
006580220727         invalid = '1';
006581220727          errRow8 = '1';
006582220727         leavesr;
006583220727        endif;
006584220727
006585220727        if sdper08 > 0 and (sabt08 = 0 or sabt08 = 0);
006586220727         invalid = '1';
006587220727          errBen8 = '1';
006588220727         leavesr;
006589220727        endif;
006590220727
006591220727        if sabf09 > 0 and (sabt09 = 0 or sabt09 < sabf07);
006592220727         invalid = '1';
006593220727          errRow9 = '1';
006594220727         leavesr;
006595220727        endif;
006596220727
006597220727        if sdper09 > 0 and (sabt09 = 0 or sabt09 = 0);
006598220727         invalid = '1';
006599220727          errBen9 = '1';
006600220727         leavesr;
006601220727        endif;
006602220727
006603220727        if sabf10 > 0 and (sabt10 = 0 or sabt10 < sabf07);
006604220727         invalid = '1';
006605220727          errRow10 = '1';
006606220727         leavesr;
006607220727        endif;
006608220727
006609220727        if sdper10 > 0 and (sabt10 = 0 or sabt10 = 0);
006610220727         invalid = '1';
006611220727          errBen10 = '1';
006612220727         leavesr;
006613220727        endif;
006614220727
006615220727       endsr;
006616220727
006617210706      //=======================================================================
006618220721      // restore record
006619210706      //=======================================================================
006620210706
006621220721       begsr restoreRcd;
006622210706
006623220727        dcdltd = 'A';
006624220721        tspProtect = '0';
006625220727        update declinFile;
006626220721        msg = 'Record Restored';
006627220721        exfmt msgWindow;
006628220721        btnText = 'Update';
006629220721        valid = '1';
006630220721        exsr loadFields;
006631210706
006632210706       endsr;
006633220727
006634220727      //=======================================================================
006635220727      // delete record
006636220727      //=======================================================================
006637220727
006638220727       begsr deleteRcd;
006639220727
006640220727        dcdltd = 'D';
006641220727        tspProtect = '1';
006642220727        update declinFile;
006643220727        msg = 'Record Deleted';
006644220727        exfmt msgWindow;
006645220727        btnText = 'Restore';
006646220727        valid = '1';
006647220727        //tspDel = '0';
006648220727        exsr loadFields;
006649220727
006650220727       endsr;
006651210706
006652220721      //=======================================================================
006653220721      // move fields
006654220721      //=======================================================================
006655220721
006656220721       begsr moveFields;
006657220721
006658220727         dctrst = strust;
006659220727         dcsub# = ssub#;
006660220727         dcplan = splan;
006661220727
006662220727         rndflg = srndflg;
006663220727         rndamt = srndamt;
006664220727
006665220727         abf01 = sabf01;
006666220727         abf02 = sabf02;
006667220727         abf03 = sabf03;
006668220727         abf04 = sabf04;
006669220727         abf05 = sabf05;
006670220727         abf06 = sabf06;
006671220727         abf07 = sabf07;
006672220727         abf08 = sabf08;
006673220727         abf09 = sabf09;
006674220727         abf10 = sabf10;
006675220727
006676220727         abt01 = sabt01;
006677220727         abt02 = sabt02;
006678220727         abt03 = sabt03;
006679220727         abt04 = sabt04;
006680220727         abt05 = sabt05;
006681220727         abt06 = sabt06;
006682220727         abt07 = sabt07;
006683220727         abt08 = sabt08;
006684220727         abt09 = sabt09;
006685220727         abt10 = sabt10;
006686220727
006687220727         dper01 = sdper01;
006688220727         dper02 = sdper02;
006689220727         dper03 = sdper03;
006690220727         dper04 = sdper04;
006691220727         dper05 = sdper05;
006692220727         dper06 = sdper06;
006693220727         dper07 = sdper07;
006694220727         dper08 = sdper08;
006695220727         dper09 = sdper09;
006696220727         dper10 = sdper10;
006697220722
006698220721         if process = 'U';
006699220727          update declinFile;
006700220727           exsr changeHistory;
006701220727            msg = 'Record Updated';
006702220727           exfmt msgWindow;
006703220727          exsr loadFields;
006704220721         else;
006705220727           write declinFile;
006706220727            exsr addHistory;
006707220727             msg = 'Record Created';
006708220727            exfmt msgWindow;
006710220727           btnText = 'Update';
006711220727          exsr loadFields;
006720220721         endif;
006721220721
006722220721       endsr;
006723220721
008760210805      //=======================================================================
008800201221      // exit
008900201221      //=======================================================================
009000180323
009100180323       begsr exit;
009200180323
009300180323        *inlr = '1';
009400180323        return;
009500180323
009600180323       endsr;
009700180323
009800201221      //=======================================================================
009900180323      // init
010000201221      //=======================================================================
010100180323
010200180323       begsr init;
010300180323
010301220727        chain (inTrust : inSub : inPlan) declinFile;
010302211013        if not %found;
010303211013         clear screen1;
010304220721          tspProtect = '0';
010305220721          btnText = 'Add';
010306220721         process = 'W';
010307211013        endif;
010308220721
010309220721        if %found;
010310220727         if dcdltd = 'D';
010311220721          tspProtect = '1';
010312220721           btnText = 'Restore';
010313220721          process = 'U';
010314220721         endif;
010315220721        endif;
010316211013
010317220721        if %found;
010318220727         if dcdltd <> 'D';
010319220721          tspProtect = '0';
010320220721           btnText = 'Update';
010321220727           //tspDel = '1';
010322220721          process = 'U';
010323220721         endif;
010324220721        endif;
010325220721
010600180323        btnExit = '0';
010602201221        btnHist = '0';
010603220721        btnGreen = '0';
010604201221
010800180323        pgmname = proc_name;
010801201221
010806220721        strust = inTrust;
010807220722        ssub# = inSub;
010808220727        splan = inPlan;
010809220722        inProtect = '1';
010816220721
010822220727        chain (strust : ssub# : splan) histFile;
010823220722
010824220722        tspInq = '1';
010825220722        if inMode = 'I';
010826220722         tspInq = '0';
010827220722         tspProtect = '1';
010828220722        endif;
010829210709
010830220722        if inMode = 'M';
010831220722         ChkPgmAuth(pgmname : continue);
010832220722         if continue = 'N';
010833220722          exsr exit;
010834220722         endif;
010835220722        endif;
010836220817
010837220817        getenv(e1envir : e1libl : e1Lib2 : envColor : e1Acnm);
010838220722
011200180323       endsr;
011300180323
011400201221      //=======================================================================
