000100220823      *=========================================================================
000200180323     h dftactgrp(*no) option(*noDebugIo) bnddir('GBSBIND')
000300180323      *=========================================================================
000400220823      * FM080R1 - Carrier Master File Maintenance
000500180326      *========================================================================
000600180326      * Date         Int  Description
000700180326      * ---------    ---  -----------------------------------------------------
000800220823      * 08/23/2022   jt   Original Creation
000900180326      *========================================================================
001000180628
001101220823     ffm080d3   cf   e             WorkStn Handler('PROFOUNDUI(HANDLER)')
001102210709
001103220823     fcarmst    if   e           k disk    rename(carmsr:carrFile)
001104220823     f                                     extfile('F.CARMST')
001105220823
001106220823     fcarmst2p  uf a e           k disk    rename(carmst2r:carr2File)
001107210709
001300180323      //========================================================================
001400180323
001500180323     d psds           sds
001600180323     d proc_name         *proc
001601210830     d jobName               244    253
001602210830     d user                  254    263
001603210830     d jobNumber             264    269
001604210830
001613210709     d cancel          s              1
001615220823     d valid2          s              1
001616220727     d validCat        s              1
001617210830     d userName        s             50
001618210830     d ok_toContinue   s              1
001619210830     d return          s              1
001620220823     d recrrn          s             10
001621210830     d returnUser      s             10
001622220823     d pcarr           s              3
001623220823     d e1envir         s             15
001624220823     d e1libl          s             10
001625220823     d e1Lib2          s             10
001626220823     d envColor        s             10
001627220823     d e1Acnm          s             40
001628220823
001629220823     d getEnv          pr                  ExtPgm('GETENVR')
001630220823     d  e1envir                      15
001631220823     d  e1libl                       10
001632220823     d  e1Lib2                       10
001633220823     d  envColor                     10
001634220823     d  e1Acnm                       40
001640220817
001701220823     d carrMaint       pr                  ExtPgm('FM080R2')
001702220823     d  scarr                         3
001705220727     d  inMode                        1
001706210709
001707220823     d carrWindowD     pr                  extpgm('WNCARMSTR')
001709220823     d  pcarr                         3
001710220823     d  cancel                        1
002000180323
002039210830     d getLock         pr                  ExtPgm('RCDLCK')
002040210902     d  wqfill                       10    const
002041210902     d  wqfiln                       10    const
002042220823     d  recrrn                       10    const
002043210830     d  jobNumber                     5    const
002044210830     d  user                         10    const
002045210830     d  jobName                      10    const
002046210830     d  returnUser                   10    const
002047210830     d  return                        1    const
002048210830
002049210830     d getName         pr                  ExtPgm('GETUSRNAME')
002050210830     d  user                         10    const
002051210830     d  userName                     50    const
002052220727
002053220823     d fm080r3         pi
002055220823     d  inCarr                        3
002058220823     d  sc2coneml                    50
002059220823     d  sc2820                        1
002060220823     d  sc2remit                      1
002061220823     d  sc2acart                      1
002062220823     d  sc2pcpopt                     1
002063220823     d  sc2exchg                      1
002064220823     d  inAdded                       1
002066210830
002100180323      //========================================================================
002200180323      // mainline
002300180323      //========================================================================
002400180323
002500180323       exsr init;
002600180323       exsr main;
002700180323       exsr exit;
002800180323
002900180323      //========================================================================
003000180323      // main
003100180323      //========================================================================
003200180323
003300180323       begsr main;
003400180323
003500180323        dow btnExit = '0';
003501220823
003502220823         exsr moveFields;
003600180323
003700180323         exfmt screen1;
003800180323
003900180323         exsr checkButton;
004000180323
004100180323        enddo;
004200180323
004300220823       endsr;
004400180323
004401220823      //========================================================================
004402220823      // checkButton
004403220823      //========================================================================
004404220823
004405220823       begsr moveFields;
004406220823
004411220823        scarrcd = inCarr;
004412220823
004413220823        sc2adepadd = c2adepadd;
004429220823        sc2amaried = c2amaried;
004430220823        sc2aempsts = c2aempsts;
004431220823        sc2aspsest = c2aspsest;
004432220823        sc2acourt = c2acourt;
004433220823        sc2adisabl = c2adisabl;
004434220823        sc2adivorc = c2adivorc;
004435220823        sc2aemrelo = c2aemrelo;
004436220823        sc2astusts = c2astusts;
004437220823        sc2cbirth = c2cbirth;
004438220823        sc2cmaried = c2cmaried;
004439220823        sc2cempsts = c2cempsts;
004440220823        sc2cspsest = c2cspsest;
004441220823        sc2ccourt = c2ccourt;
004442220823        sc2cdisabl = c2cdisabl;
004443220823        sc2cdivorc = c2cdivorc;
004444220823        sc2aemrelo = c2aemrelo;
004445220823        sc2astusts = c2astusts;
004446220823        sc2cbirth = c2cbirth;
004447220823        sc2cmaried = c2cmaried;
004448220823        sc2cempsts = c2cempsts;
004449220823        sc2cspsest = c2cspsest;
004450220823        sc2ccourt = c2ccourt;
004451220823        sc2cdivorc = c2cdivorc;
004452220823        sc2cmedcar = c2cmedcar;
004453220823        sc2cstusts = c2cstusts;
004454220823        sc2cdeplos = c2cdeplos;
004455220823        sc2retrody = c2retrody;
004456220823
004457220823       endsr;
004458220823
004500180323      //========================================================================
004600180323      // checkButton
004700180323      //========================================================================
004800180323
004900180323       begsr checkButton;
005000180323
006001220823        if btnCopy = '1';
006002220823         exsr copyWindow;
006003220823          btnCopy = '0';
006004220823         btnExit = '1';
006008220823        endif;
006009220823
006042210709        if btnEnter = '1';
006043210709         exsr validCheck;
006044220823
006100220823         if valid2 = '0';
006200220823          exsr copytoRcd;
006300210709         endif;
006301210709
006500210709         btnEnter = '0';
006501210709        endif;
006600180323
006601220823        if btnExit = '1';
006602220823         leavesr;
006603220823        endif;
006604220823
006700180323       endsr;
006800180323
006900180323      //========================================================================
007000220823      // valid copy
007100180323      //========================================================================
007200210712
007300220823       begsr copyWindow;
007400180323
007401220823        btnBack = '0';
007402220823
007403220823        dow btnBack = '0';
007404220823
007405220823         exfmt copyTo;
007406220823
007407220823         if btnCopyTo = '1';
007408220823          exsr validCopy;
007409220823          if valid2 = '0';
007410220823           exsr copyToRcd;
007411220823            btnCopyTo = '0';
007412220823            btnBack = '1';
007413220823           endif;
007414220823          endif;
007415220823
007416220823          if btnCarr = '1';
007417220823           exsr carrWindow;
007418220823           btnCarr = '0';
007420220823          endif;
007421220823
007422220823        enddo;
007741210830
008100180323       endsr;
008101220823
008102220823      //========================================================================
008103220823      // valid check
008104220823      //========================================================================
008105220823
008106220823       begsr validCheck;
008107220823
008108220823        exsr writeFile;
008109220823
008110220823       endsr;
008200180323
008202220823      //========================================================================
008203220823      // valid copy
008204220823      //========================================================================
008205220823
008206220823       begsr validCopy;
008207220823
008208220823        valid2 = '0';
008209220823        errCopy = '0';
008210220823        errCopy2 = '0';
008211220823        errCopy3 = '0';
008212220823        btnBack = '0';
008213220823
008214220823        if scarrcd = scarr2;
008215220823         valid2 = '1';
008216220823         errCopy3 = '1';
008217220823          leavesr;
008218220823        endif;
008219220823
008220220823        chain scarr2 carr2File;
008221220823        if %found;
008222220823
008223220823         if c2adepadd > ' ';
008224220823          valid2 = '1';
008225220823           errCopy = '1';
008226220823          leavesr;
008227220823         endif;
008228220823
008229220823        endif;
008230220823
008231220823        chain scarr2 carrFile;
008232220823        if not %found;
008233220823         valid2 = '1';
008234220823          errCopy2 = '1';
008235220823         leavesr;
008236220823        endif;
008237220823
008238220823       endsr;
008239220823
008240220823      //========================================================================
008241220823      // copy to record
008242220823      //========================================================================
008243220823
008244220823       begsr copyToRcd;
008245220823
008246220823        chain scarr2 carr2File;
008247220823        if %found;
008248220823         delete carr2file;
008249220823        endif;
008250220823
008252220823        if btnCopyTo = '1';
008253220823         chain scarr2 carr2File;
008256220823           c2carcd = scarr2;
008257220823            write carr2File;
008258220823            inAdded = 'Y';
008259220823            msg = 'Record Copied';
008260220823           exfmt msgWindow;
008261220823          visible = '0';
008262220823         leavesr;
008263220823        endif;
008293220823
008297220823       endsr;
008332220823
008333220823      //========================================================================
008334220823      // carrier window
008335220823      //========================================================================
008336220823
008337220823       begsr writeFile;
008338220823
008339220829        chain scarrcd carr2File;
008342220823        c2carcd = scarrcd;
008344220823
008345220823        c2adepadd = sc2adepadd;
008346220823        c2amaried = sc2amaried;
008347220823        c2aempsts = sc2aempsts;
008348220823        c2aspsest = sc2aspsest;
008349220823        c2acourt = sc2acourt;
008350220823        c2adisabl = sc2adisabl;
008351220823        c2adivorc = sc2adivorc;
008352220823        c2aemrelo = sc2aemrelo;
008353220823        c2astusts = sc2astusts;
008354220823        c2cbirth = sc2cbirth;
008355220823        c2cmaried = sc2cmaried;
008356220823        c2cempsts = sc2cempsts;
008357220823        c2cspsest = sc2cspsest;
008358220823        c2ccourt = sc2ccourt;
008359220823        c2cdisabl = sc2cdisabl;
008360220823        c2cdivorc = sc2cdivorc;
008361220823        c2aemrelo = sc2aemrelo;
008362220823        c2astusts = sc2astusts;
008363220823        c2cbirth = sc2cbirth;
008364220823        c2cmaried = sc2cmaried;
008365220823        c2cempsts = sc2cempsts;
008366220823        c2cspsest = sc2cspsest;
008367220823        c2ccourt = sc2ccourt;
008368220823        c2cdivorc = sc2cdivorc;
008369220823        c2cmedcar = sc2cmedcar;
008370220823        c2cstusts = sc2cstusts;
008371220823        c2cdeplos = sc2cdeplos;
008372220823        c2retrody = sc2retrody;
008373220823
008374220829        if not %found;
008375220829         inAdded = 'Y';
008376220829         write carr2File;
008377220829        else;
008378220829         update carr2File;
008379220829        endif;
008380220829
008381220823       endsr;
008382220823
008383210712      //========================================================================
008384220823      // carrier window
008385210712      //========================================================================
008386210712
008387220823       begsr carrWindow;
008388210712
008389220823        carrWindowD(pcarr : cancel);
008390220823        if pcarr > ' ';
008391220823         scarr2 = pcarr;
008392220823        endif;
008393210712
008394210712       endsr;
008395210712
008446210712      //========================================================================
008447180323      // exit
008500180323      //========================================================================
008600210712
008700180323       begsr exit;
008800180323
008900180323        *inlr = '1';
009000180323        return;
009100180323
009200180323       endsr;
009300180323
009400180323      //========================================================================
009500180323      // init
009600180323      //========================================================================
009700180323
009800180323       begsr init;
009900180323
010000180323        btnEnter = '0';
010100180323        btnExit = '0';
010300180323        pgmname = proc_name;
010301220823        inAdded = 'N';
010302220823
010303220823        getenv(e1envir : e1libl : e1Lib2 : envColor : e1Acnm);
010304220823
010305220823        chain inCarr carr2File;
010307220823        if %found;
010308220823         tspProtec2 = '1';
010309220823        else;
010310220823         tspProtec2 = '0';
010311220823        endif;
010312220823
010313220823        visible = '1';
010314220823
010315220817
010700180323       endsr;
010800180323
010900180323      //========================================================================
