000100190418      *====================================================================
000200190417     h dftactgrp(*no) option(*noDebugIo) bnddir('GBSBIND')
000300190418      *====================================================================
000400220203      * FM104R2 - Salesman Master App - Display Only
000500190418      *====================================================================
000600190417      * Date         Int  Description
000700190418      * ---------    ---  -------------------------------------------------
000800220203      * 02/03/2022   jt   Original Creation
000900190418      *====================================================================
001000190417
001100220203     ffm104d2   cf   e             WorkStn Handler('PROFOUNDUI(HANDLER)')
001200190417
001500220203     fsman      if   e           k disk    rename(smanr:smanFile)
001501220203     f                                     extfile('F.SMAN')
001502220203
001503220203     fnpn       if   e           k disk    rename(npnr:npnFile)
001600190417
001601220203     fsmanrmgp  if   e           k disk    rename(smanrmgr:xrefFile)
001602220203
001603220203     frmgrmst3  if   e           k disk    rename(rmgrmstr:rmgrFile)
001604220203
001605220203     fmktstsp   if   e           k disk    rename(mktstsr:statusFile)
001606220203
001607220203     fsman2l1   if   e           k disk    rename(sman2r:sm2File)
001608220203     f                                     extfile('F.SMAN2L1')
001609220203
001610220203     firmmstp   if   e           k disk    rename(irmmstr:inacFile)
001611220203
001700190418      *====================================================================
001800190417
001900190417     d psds           sds
002000190417     d proc_name         *proc
002100190417
002500190417     d today           s              8  0
002501220203     d holdArea        s              3
002502220203     d holdPhone       s              7
003100190417
003103220203     d fm104r2         pi
003104220203     d  inSman                        3
004400190417
004500190418      //===================================================================
004600190417      // mainline
004700220203      //===================================================================
004800190417
004900190417       exsr init;
005000190417       exsr main;
005100190417       exsr exit;
005200190417
005300190417      //===================================================================
005400190417      // main
005500190417      //===================================================================
005600190417
005700190417       begsr main;
005800190417
005900190417        dow btnExit = '0';
006000190417
006001220203         exsr moveFields;
006100190417         exfmt screen1;
006200190417
006300190417         exsr checkButton;
006400190417
006500190417        enddo;
006600190417
006700190417       endsr;
006800190417
006801220203      //===================================================================
006802220203      // move fields
006804220203      //===================================================================
006805220203
006806220203       begsr moveFields;
006807220203
006808220203        chain inSman smanFile;
006809220203        if %found;
006810220203         ssmancd = smancd;
006811220203         if smi > ' ';
006812220203          sname = %trim(slname) + ', ' + %trim(sfname) + ' ,' +%trim(smi);
006813220203         else;
006814220203          sname = %trim(slname) + ', ' + %trim(sfname);
006816220203         endif;
006817220203
006818220203         saddress = saddr;
006819220203         sscity = scity;
006820220203         ssstate = sstate;
006821220203
006822220203         szip = %char(szipcd);
006823220203         //szip2 = %subst(%char(szipcd):6:4);
006827220203
006828220203         if sarea > 0;
006829220203          holdArea = %char(sarea);
006830220203         endif;
006831220203
006832220203         if sphone > 0;
006833220203          holdPhone = %char(sphone);
006834220203         endif;
006835220203
006836220203         ssphone = %trim(holdArea) + %trim(holdPhone);
006837220203
006838220203         ssbegdt = %date(sbegdt:*iso);
006839220203
006840220203         clear stermdt;
006841220203         if senddt > 0;
006842220203          stermdt = %date(senddt:*iso);
006843220203         endif;
006844220203
006845220203         sgroupercd = sgrp;
006846220203         sprod = fuse;
006847220203         ssmantype = %subst(stype:2:2);
006848220203         smanssn = stin;
006849220203
006850220203         chain inSman npnFile;
006851220203         if %found;
006852220203          snpn = npnumber;
006853220203         endif;
006854220203
006855220203         chain inSman xrefFile;
006856220203         if %found;
006857220203          sbrkrep = smrmgr;
006858220203
006859220203           chain smrmgr rmgrFile;
006860220203           if %found;
006861220203            sbrkrepd = rmname;
006862220203           endif;
006863220203
006864220203         endif;
006865220203
006866220203         chain ('S' : inSman) statusFile;
006867220203         if %found;
006868220203          if senddt > 0;
006869220203           sinctrs = msreasn;
006870220203          endif;
006873220203         endif;
006874220203
006875220203         chain ('S' : inSman) statusFile;
006876220203         if %found;
006881220203          if senddt > 0 and %subst(msreasn:1:1) <> 'I';
006882220203           sstatus = 'Terminated';
006883220203          endif;
006884220203          if senddt > 0 and %subst(msreasn:1:1) = 'I';
006885220203           sstatus = 'Inactive';
006886220203           chain msreasn inacFile;
006887220203           if %found;
006888220203            sinctrsd =imtext;
006889220203           endif;
006890220203          endif;
006891220203         else;
006892220203          if senddt = 0;
006893220203           sstatus = 'Active';
006894220203          endif;
006895220203         endif;
006896220203
006897220203         chain inSman sm2File;
006898220203         if %found;
006899220203          if sgrpcd = sgrp;
006900220203           sdfltbrk = 'Y';
006901220203          else;
006902220203           sdfltbrk = 'N';
006903220203          endif;
006904220203         endif;
006905220203
006906220203         sease = bkeasesubs;
006907220203
006908220203        endif;
006909220203
006910220203       endsr;
006911220203
006912190417      //===================================================================
007000190417      // check button pressed
007100190417      //===================================================================
007200190417
007300190417       begsr checkButton;
007400190417
008000190417        if btnExit = '1';
008100190417         leavesr;
008200190417        endif;
008300190417
009300190417       endsr;
009400190417
020500190417      //===================================================================
020600190417      // exit
020700190417      //===================================================================
020800190417
020900190417       begsr exit;
021000190417
021100190417        *inlr = '1';
021200190417        return;
021300190417
021400190417       endsr;
021500190417
021600190417      //===================================================================
021700190417      // init
021800190417      //===================================================================
021900190417
022000190417       begsr init;
022100190417
022200190417        clear screen1;
022300190417
023700190417
023800190417        today = %dec(%char(%date:*iso0):8:0);
023900190417
024000220203        btnExit = '0';
024102190423
024200190417        pgmname = proc_name;
024201190423
024400190417       endsr;
024500190417
024501190418      //===================================================================
