000100020613     F*-------------------------------------------------------------------------
000200030516     F* FM107R     Group Benefit Services Software 2003
000300030516     F*            FM10* SALESMAN MASTER APPLICATION
000400020613     F*            WRITTEN BY - S.S.K.
000500030512     F*            DATE - 05/03
000600030516     F*  DESCRIPTION - Next Salesman Number
000700020613     F*
000800020613     F*-------------------------------------------------------------------------
000900020613     ** MODIFICATION HISTORY                                              **
001000020613     ** ###  UUU  MMDDCCYY  X---->                                        **
001100030516     ** 000  SSK  05162003  ORIGINAL SOURCE                               **
001200020613     **                                                                   **
001300020613     ** = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = **
001400030516     FSMAN      IF   E           K DISK
001500020612   X***X
001600030512     D P@3             S              3A
001700030512     D #C              S              7S 0
001800030512     D #3              S              3S 0
001900030522     D @3              S              3A   INZ('000')
002000030522     D @36             S             36A
002100020612   X***X
002200030522     C                   DO        36
002300030512    ***
002400030522     C                   ADD       1             X                 3 0
002500180126     C                   EVAL      #C = 001
002600030522    * *
002700030522     C                   DOU       #C = 100
002800030522    * *
002900030522     C                   MOVE      #C            #2                2 0
003000030522     C                   EVAL      @3 = %SUBST(@36:X:1) + %EDITC(#2:'X')
003100030522    * *
003200030512     C
003300030516     C     @3            CHAIN     SMANR
003400030516     C                   IF        NOT %FOUND(SMAN)
003500030522     C                   MOVE      @3            P@3
003600030522     c                   return
003700030512     C                   ENDIF
003800020613    ***
003900030512     C                   ADD       1             #C
004000030513     c                   eval      @3 = *blanks
004100020613    ***
004200030522     C                   ENDDO
004300030522    * *
004400020613     C                   ENDDO
004500020613    ***
004600030512     C                   MOVE      @3            P@3
004700020612     C                   MOVE      *ON           *INLR
004800020612   S***S
004900020612     C     *INZSR        BEGSR
005000020612    ***
005100020612     C     *ENTRY        PLIST
005200030512     C                   PARM                    P@3
005300020613    ***
005400030522     C                   EVAL      @36 = '0123456789' +
005500030522     C                             'ABCDEFGHIJKLM' +
005600030522     C                             'NOPQRSTUVWXYZ'
005700020613    ***
005800020613     C                   ENDSR
005900020613   S***S
