000100020613     F*-------------------------------------------------------------------------
000200030512     F* FM121R     Group Benefit Services Software 2003
000300030512     F*            FM12* Agency Master Application
000400020613     F*            WRITTEN BY - S.S.K.
000500030512     F*            DATE - 05/03
000600030512     F*  DESCRIPTION - Next Agency Number
000700020613     F*
000800020613     F*-------------------------------------------------------------------------
000900020613     ** MODIFICATION HISTORY                                              **
001000020613     ** ###  UUU  MMDDCCYY  X---->                                        **
001100030512     ** 000  SSK  05122003  ORIGINAL SOURCE                               **
001200020613     **                                                                   **
001300020613     ** = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = **
001400030512     FAGENCY    IF   E           K DISK
001500020612   X***X
001600030522     D P@3             S              3A
001700030522     D #C              S              7S 0
001800030522     D #3              S              3S 0
001900030522     D @3              S              3A   INZ('000')
002000030522     D @36             S             36A
002100030522   X***X
002200030522     c                   eval      x = 0
002300030522     C                   DO        36
002400030522    ***
002500030522     C                   ADD       1             X                 3 0
002600030522     C                   EVAL      #C = 000
002700030522    * *
002800030522     C                   DOU       #C = 100
002900030522    * *
003000030522     C                   MOVE      #C            #2                2 0
003100030522     C                   EVAL      @3 = %SUBST(@36:X:1) + %EDITC(#2:'X')
003200030522    * *
003300030512     C     @3            CHAIN     agenr
003400030512     C                   IF        NOT %FOUND(AGENCY)
003500030522     C                   MOVE      @3            P@3
003600030522     C                   return
003700030512     C                   ENDIF
003800020613    ***
003900030522     C                   ADD       1             #C
004000030522     c                   eval      @3 = *blanks
004100030522    ***
004200030522     C                   ENDDO
004300030522    * *
004400030522     C                   ENDDO
004500030522    ***
004600030522     C                   MOVE      @3            P@3
004700030522     C                   MOVE      *ON           *INLR
004800030522   S***S
004900030522     C     *INZSR        BEGSR
005000030522    ***
005100030522     C     *ENTRY        PLIST
005200030522     C                   PARM                    P@3
005300030522    ***
005400030522     C                   EVAL      @36 = '0123456789' +
005500030522     C                             'ABCDEFGHIJKLM' +
005600030522     C                             'NOPQRSTUVWXYZ'
005700030522    ***
005800030522     C                   ENDSR
005900030522   S***S
