000100190418      *====================================================================
000200190417     h dftactgrp(*no) option(*noDebugIo) bnddir('GBSBIND')
000300190418      *====================================================================
000400220203      * FM104R2 - Salesman Master App - Display Only
000500190418      *====================================================================
000600190417      * Date         Int  Description
000700190418      * ---------    ---  -------------------------------------------------
000800220203      * 02/03/2022   jt   Original Creation
000900190418      *====================================================================
001000190417
001100220203     ffm120d2   cf   e             WorkStn Handler('PROFOUNDUI(HANDLER)')
001200190417
001500220203     fagency    if   e           k disk    rename(agenr:agencyFile)
001501220203     f                                     extfile('F.AGENCY')
001502220203
001603220203     frmgrmst3  if   e           k disk    rename(rmgrmstr:rmgrFile)
001604220203
001605220203     fmktstsp   if   e           k disk    rename(mktstsr:statusFile)
001606220203
001607220203     fsman2l1   if   e           k disk    rename(sman2r:sm2File)
001608220203     f                                     extfile('F.SMAN2L1')
001609220203
001610220203     firmmstp   if   e           k disk    rename(irmmstr:inacFile)
001611220203
001612220203     fagency2   if   e           k disk    rename(agen2r:agenc2File)
001613220203
001700190418      *====================================================================
001800190417
001900190417     d psds           sds
002000190417     d proc_name         *proc
002100190417
002500190417     d today           s              8  0
002501220203     d holdArea        s              3
002502220203     d holdPhone       s              7
003100190417
003103220203     d fm120r2         pi
003104220203     d  inAgency                      3
004400190417
004500190418      //===================================================================
004600190417      // mainline
004700220203      //===================================================================
004800190417
004900190417       exsr init;
005000190417       exsr main;
005100190417       exsr exit;
005200190417
005300190417      //===================================================================
005400190417      // main
005500190417      //===================================================================
005600190417
005700190417       begsr main;
005800190417
005900190417        dow btnExit = '0';
006000190417
006001220203         exsr moveFields;
006100190417         exfmt screen1;
006200190417
006300190417         exsr checkButton;
006400190417
006500190417        enddo;
006600190417
006700190417       endsr;
006800190417
006801220203      //===================================================================
006802220203      // move fields
006804220203      //===================================================================
006805220203
006806220203       begsr moveFields;
006807220203
006808220203        chain inAgency agencyFile;
006809220203        if %found;
006810220203         sagcode = agcode;
006817220203         sagnam1 = agnam1;
006819220203         sagnam2 = agnam2;
006820220203         sagadd1 = agadd1;
006821220203         sagadd2 = agadd2;
006822220203         sagcity = agcity;
006823220203         sagstat = agstat;
006824220203         sagzip5 = %char(agzip5);
006825220203         sagzip4 = %char(agzip4);
006826220203         sagtxid = %char(agtxid);
006827220203
006829220203         if agtlx3 > 0;
006830220203          holdArea = %char(agtlx3);
006831220203         endif;
006832220203
006833220203         if agtlx7 > 0;
006834220203          holdPhone = %char(agtlx7);
006835220203         endif;
006836220203
006837220203         sphone = %trim(holdArea) + %trim(holdPhone);
006838220203
006839220203         holdArea = ' ';
006840220203         holdPhone = ' ';
006841220203
006842220203         if agfax3 > 0;
006843220203          holdArea = %char(agfax3);
006844220203         endif;
006845220203
006846220203         if agfax7 > 0;
006847220203          holdPhone = %char(agfax7);
006848220203         endif;
006849220203
006850220203         sfax = %trim(holdArea) + %trim(holdPhone);
006851220203
006852220203         sagefdt = %date(agefdt:*iso);
006853220203
006854220203         clear sagtmdt;
006855220203         if agtmdt > 0;
006856220203          sagtmdt = %date(agtmdt:*iso);
006857220203         endif;
006858220203
006880220203         chain ('A' : inAgency) statusFile;
006881220203         if %found;
006882220203          if agtmdt > 0;
006883220203           sinctrs = msreasn;
006884220203          endif;
006885220203         endif;
006886220203
006887220203         chain ('A' : inAgency) statusFile;
006888220203         if %found;
006889220203          if agtmdt > 0 and %subst(msreasn:1:1) <> 'I';
006890220203           sstatus = 'Terminated';
006891220203          endif;
006892220203          if agtmdt > 0 and %subst(msreasn:1:1) = 'I';
006893220203           sstatus = 'Inactive';
006894220203           chain msreasn inacFile;
006895220203           if %found;
006896220203            sinctrsd = imtext;
006897220203           endif;
006898220203          endif;
006899220203         else;
006900220203          if agtmdt = 0;
006901220203           sstatus = 'Active';
006902220203          endif;
006903220203         endif;
006904220203
006905220203         select;
006906220203          when agach = 'Y';
006907220203           sagach = 'Yes';
006908220203
006909220203          when agach = 'N';
006910220203           sagach = 'No';
006911220203
006912220203          when agach = 'I';
006913220203           sagach = 'Internal';
006914220203
006915220203          when agach = 'H';
006916220203           sagach = 'Hold';
006917220203         endsl;
006918220203
006919220203         chain inAgency agenc2File;
006920220203         if %found;
006921220203          slic = a2lreq;
006922220203           sproducer = a2prod;
006923220203          sprtcomst = a2paper;
006924220203         endif;
006925220203
006926220203         sagcont = agcont;
006927220203
006928220203        endif;
006929220203
006930220203       endsr;
006931220203
006932190417      //===================================================================
007000190417      // check button pressed
007100190417      //===================================================================
007200190417
007300190417       begsr checkButton;
007400190417
008000190417        if btnExit = '1';
008100190417         leavesr;
008200190417        endif;
008300190417
009300190417       endsr;
009400190417
020500190417      //===================================================================
020600190417      // exit
020700190417      //===================================================================
020800190417
020900190417       begsr exit;
021000190417
021100190417        *inlr = '1';
021200190417        return;
021300190417
021400190417       endsr;
021500190417
021600190417      //===================================================================
021700190417      // init
021800190417      //===================================================================
021900190417
022000190417       begsr init;
022100190417
022200190417        clear screen1;
022300190417
023700190417
023800190417        today = %dec(%char(%date:*iso0):8:0);
023900190417
024000220203        btnExit = '0';
024102190423
024200190417        pgmname = proc_name;
024201190423
024400190417       endsr;
024500190417
024501190418      //===================================================================
