000100180326      *=========================================================================
000200180326     h dftactgrp(*no) option(*noDebugIo) bnddir('GBSBIND')
000300180326      *=========================================================================
000400220209      * FM120R1 - Tax Subfile
000500191209      *=========================================================================
000600180326      * Date         Int  Description
000700191209      * ---------    ---  ------------------------------------------------------
000800220202      * 02/02/2022   jt   Original Creation
000900191209      *=========================================================================
001000100520
001100220209     ffm120d1   cf   e             WorkStn Handler('PROFOUNDUI(HANDLER)')
001200220202     f                                     SFile(SFL1 : RRN)
001300180320
001309220209     fagenl5    if   e           k disk    rename(agenr:agencyFile)
001311220203
003600170829      *=========================================================================
003700170829
003800170907     d psds           sds
003900170907     d proc_name         *proc
004100210322     d jobName               244    253
004101210322     d user                  254    263
004102210322     d jobNumber             264    269
004103210322
004200170829     d rrn             s              5i 0
005611210322
006704220209     d taxScreen       pr                  ExtPgm('FM120R2')
006705220209     d  sagcode                       3
006706220203
006707220209     d fm120r1         pi
006708220209     d  inTaxID                       9  0
006709220209
007500170829      //========================================================================
007600180320      // mainline
007700180320      //========================================================================
007800170829
007900170829       exsr init;
008000170829       exsr main;
008100170829       exsr exit;
008200170829
008300170829      //========================================================================
008400170829      // main
008500170829      //========================================================================
008600170829
008700170829       begsr main;
008800170829
008900170829        dow btnEXIT = '0';
009000100520
009100180326         // Clear the subfile...
009200170829         sflclr = '1';
009300170829
009400170829         write sflctl1;
009500170829         sflclr = '0';
009600170829         rrn = 0;
009700100520
009800170829         // Load the subfile...
009900170831         exsr loadSubfile;
010000100520
010100170829         // Display the subfile.
010200170829         sfldsp = '1';
010300170829         exfmt sflctl1;
010400180323
010500170831         exsr checkButton;
010600170829
010700170829         sfldsp = '1';
010800170829
010900180326        // Check for icon click.
011000170829        readc sfl1;
011100170829        if not %eof;
011200170829
011800220202         if buttonDsp = '1';
011900220202          exsr display;
012000180622         endif;
012100180622
012600170829        endif;
012700170829       enddo;
012800170829
012900170829       endsr;
013000170829
013100170831      //========================================================================
013200170831      // load subfile
013300170831      //========================================================================
013400170831
013500170831       begsr loadSubfile;
013600170831
014300220202        select;
014301220209         when sagency = ' ';
014302220209          setll (inTaxID) agencyFile;
014304220202
014307220209         when sagency > ' ';
014308220209          setll (inTaxID : sagency) agencyFile;
014310220202        endsl;
014500180320
014501220209        reade (inTaxID) agencyFile;
014502220209
014600180409        dow not %eof;
014707200728
014901220202         rrn += 1;
014902220202          exsr moveFields;
014903220202         write sfl1;
014905200728
014913220209         reade (inTaxID) agencyFile;
014915220209
015500180320        enddo;
015600170831
015900170831       endsr;
016000170831
016100180322      //========================================================================
016200180322      // move fields
016300180322      //========================================================================
016400180322
016500180322       begsr moveFields;
016600180322
016601220209        sagcode = agcode;
016602220209        sagnam1 = agnam1;
016603220209
018103220209        sedate = %date(agefdt:*iso);
018104220202
018105220202        clear stdate;
018106220209        if agtmdt > 0;
018107220209         stdate = %date(agtmdt:*iso);
018108220202        endif;
018109220202
019000180322       endsr;
019100180322
019200180410      //========================================================================
019300180410      // checkButton
019400180410      //========================================================================
019500180410
019600180410       begsr checkButton;
019700180410
020002220202        if btnRefresh  = '1';
020003220209         sagency = ' ';
020006220202        endif;
020007220202
020900180410       endsr;
021000180410
021001220202      //========================================================================
021002220203      // display
021003220202      //========================================================================
021004220202
021005220202       begsr display;
021006220202
021007220209        taxScreen(sagcode);
021009220202
021010220202       endsr;
021011220202
060800180622      //========================================================================
060900170829      // exit
061000170829      //========================================================================
061100170829
061200170829       begsr exit;
061300170829
061400170829        *inlr = '1';
061500170829        return;
061600100520
061700170829       endsr;
061800170829
061900170829      //========================================================================
062000170829      // init
062100170829      //========================================================================
062200170829
062300170829       begsr init;
062400170829
062500220202        btnRefresh = '0';
062600220202        btnExit = '0';
062601220202        buttonDsp = '0';
063100180622
063200180622        sfldsp = '0';
063300180622        sflclr = '0';
063400180622
063500170913        pgmname = proc_name;
063600180706
063700220209        title = 'Tax ID Display';
063701220209        staxid = inTaxID;
063800180906
064100170829       endsr;
064200170829
064300170829      //========================================================================
