000100181227      *===========================================================================
000200181227     H option(*noDebugIo)
000300181227      *===========================================================================
000400190604      * fnddayofwk - Find if day falls in a certain week (Mon = 0... Sun = 6...)
000500181227      *================================================================================
000600181227      * Date        Int   Description
000700181227      * ----------  ---   -------------------------------------------------------------
000800190604      * 061/042/2019  jt    Original creation
000900181227      *===========================================================================
001000181227
001100181227     d day_of_week     s              1  0
001200181228     d today           s               d
001300181228     d todayD          s              8  0
001400181228     d day             s              2  0
001500190103     d week            s              1  0
001600190103     d weekday         s              1  0
001700181227
001800190604     d fnddayofwk      pi
001900190102     d  dayto_Search                  3
002000190102     d  weekto_Search                 1
002100181227     d  rtn                           1
002200181227
002300181227      //========================================================================
002400181227      // mainline
002500181227      //========================================================================
002600181227
002700181227       exsr init;
002800181227       exsr main;
002900181227       exsr exit;
003000181227
003100181227      //========================================================================
003200181227      // main
003300181227      //========================================================================
003400181227
003500181227       begsr main;
003600181227
003700190103        exsr determineWeek;
003800190103
003900181228        day_of_week = %rem(%diff(%date(todayD):d'0001-01-01':*days):7);
004000181227
004100190103        if day_of_week <> weekday;
004200190103         leavesr;
004300190103        endif;
004400190102
004500190103        if day_of_week = weekday and week = %dec(weekto_Search:1:0);
004600190103         rtn = 'Y';
004700190103        endif;
004800181227
004900181227       endsr;
005000181227
005100190103      //========================================================================
005200190103      // determine week
005300190103      //========================================================================
005400190103
005500190103       begsr determineWeek;
005600190103
005700190103        day = %subdt(today:*days);
005800190103
005900190103        if day <= 7;
006000190103         week = 1;
006100190103        endif;
006200190103
006300190103        if day >= 8 and day <= 14;
006400190103         week = 2;
006500190103        endif;
006600190103
006700190103        if day >= 15 and day <= 21;
006800190103         week = 3;
006900190103        endif;
007000190103
007100190103        if day >= 22 and day <= 28;
007200190103         week = 4;
007300190103        endif;
007400190103
007500190103        if day >= 29;
007600190103         week = 5;
007700190103        endif;
007800190103
007900190103       endsr;
008000190103
008100181227      //========================================================================
008200181227      // exit
008300181227      //========================================================================
008400181227
008500181227       begsr exit;
008600181227
008700181227        *inlr = '1';
008800181227        return;
008900181227
009000181227       endsr;
009100181227
009200181227      //========================================================================
009300181227      // init
009400181227      //========================================================================
009500181227
009600181227       begsr init;
009700181227
009800181228        today = %date;
009900181228        todayD = %dec(%date);
010000181227        rtn = 'N';
010100190102
010200190102        select;
010300190102         when dayto_search = 'MON';
010400190102          weekday = 0;
010500190102
010600190102         when dayto_search = 'TUE';
010700190102          weekday = 1;
010800190102
010900190102         when dayto_search = 'WED';
011000190102          weekday = 2;
011100190102
011200190102         when dayto_search = 'THU';
011300190102          weekday = 3;
011400190102
011500190102         when dayto_search = 'FRI';
011600190102          weekday =  4;
011700190102
011800190102         when dayto_search = 'SAT';
011900190102          weekday = 5;
012000190102
012100190102         when dayto_search = 'SUN';
012200190102          weekday = 6;
012300190102        endsl;
012400181227
012500181227       endsr;
012600181227
012700181227      //========================================================================
