000100211028       Ctl-opt option(*noDebugIo)   DftActGrp(*no);
000200180919
000300180919      *-------------------------------------------------------------------------
000400180919      *
000500180919      *  Description:
000600180919      *  Programmer.: Brian Rees
000700180919      *  Date.......: 09/19/2018
000800180919      *
000900180919      *-------------------------------------------------------------------------
001000180919
001100180919      *-------------------------------------------------------------------------
001200180919      *
001300180919      * Declare Files
001400180919      *
001500180919      *-------------------------------------------------------------------------
001600211027       Dcl-f GBS0077D WorkStn
001700190717         Handler('PROFOUNDUI(HANDLER)')
001800211027         SFILE(LstSfl:rrn);
002000180919
002100180919       Dcl-f AccMst keyed ExtDesc('F.ACCMST') ExtFile(*extdesc);
002300200507
002400211028       dcl-f cCntrxrefp keyed usage( *Input : *update : *Delete : *output);
002600211028       dcl-f PayfcCntrp keyed;
002601211028       dcl-f EaseCostL1 keyed;
002800180919
003200180919
003300180919
003400180919      *-------------------------------------------------------------------------
003500180919      *
003600180919      * Global Variables
003700180919      *
003800180919      *-------------------------------------------------------------------------
003900180919
004000180919       dcl-ds pgmd
004100190717         ExtName('IOPGMD') PSDS;
004200190717         @pgmq *proc;
004300180919       end-ds;
004400180919
004500190717       dcl-s rrn Zoned( 5 ) ;
004700180919       dcl-s Reload Char(1);
004900180919
005000210916       dcl-ds @Data ;
005100210916         sqTrst Zoned(3);
005200210916         sqSub# Zoned(3);
005300210916         sqAcct Zoned(4);
005400210916         sqPlan Char(4);
005500210916         sqDesc Char(40);
005600210916       End-Ds;
005700210916
005800210916
005900210916
006000180919      *-------------------------------------------------------------------------
006100180919      *
006200180919      * *Entry Procedure
006300180919      *
006400180919      *-------------------------------------------------------------------------
006500190717       Dcl-pr Main ExtPgm;
006600190717         *N  Char(10);
006700190717       End-Pr;
006800180920
006900190717       dcl-pi Main;
007000190717         pKey Char(10);
007100190717       End-Pi;
007200180920
007300190717       dcl-s  pTrst Zoned(3);
007400190717       dcl-s  pSub  Zoned(3);
007500190717       dcl-s  pAcct Zoned(4);
007600210916       dcl-s SqlStmt Char(1000) inz;
007700210916
007800211012       dcl-c q '''';
007900180919
008000180919       Reload = 'Y';
008100180919
008200180920       pTrst = %Dec( %Subst( pKey : 1 : 3 ) : 3 : 0 );
008300180920       pSub  = %Dec( %Subst( pKey : 4 : 3 ) : 3 : 0 );
008400180920       pAcct = %Dec( %Subst( pKey : 7 : 4 ) : 4 : 0 );
008500180920
008600180919      *-------------------------------------------------------------------------
008700180919      *
008800180919      * Mainline Program
008900180919      *
009000180919      *-------------------------------------------------------------------------
009100180919
009200180919       Dou btnExit = *on;
009300180919
009500211028         ClearS1();
009600211028         LoadS1();
009900180919
009901211027         exfmt LstCtl;
010100180919
010200180919
010300190717         //?Process Selections
010400190717         Select;
010500200507         When btnAddNew = *on;
010600200507           AddNew_Record();
010700200507
010800200429         When btnSearch = *on;
011000211028         // Reload
011001211028
011002211028
011100200429         When btnReset = *on;
011300200429           s1Search = *blanks;
011400180919
011500190717         other;
011600190717           ReadChangedS1();
011700180919
011800190717         EndSl;
011900180919
012000180919       enddo;
012100180919
012200180919       *inlr = *on;
012300180919
012400180919
012500180919
012600210916       // ----------------------------------------------------------------
012700180919       dcl-proc CLEARS1;
012800180919
012900190717         //-------------------------
013000190717         //
013100190717         // Clear the Subfile
013200190717         //
013300190717         //-------------------------
013400180919
013500200507         SflClr =  *on;
013600190717         Write LstCtl;
013700200507         SflClr = *off;
013800190717         rrn = 0;
013900180919
014000180919       End-Proc;
014100180919       // ----------------------------------------------------------------
014200180919       Dcl-Proc LoadS1;
014300210708
014600190717         chain ( pTrst : pSub : pAcct ) AccMst;
014700190717         if %Found( AccMst ) ;
014800200507           s1AcctName = %editc( pTrst : 'X' ) + '-' +
014900200507             %editc( pSub : 'X' ) + '-' +
015000200507             %editc( pAcct : 'X' ) + '  ' +
015100200507             %Trim( acNam1 );
015200190717         EndIf;
015300180919
015600180919
015700211028         Setll (pTrst : pSub : pAcct )  cCntrxRefp;
015800211028         Dou %eof(cCntrxRefp);
015900180919
016000211028           reade(n) (pTrst : pSub : pAcct )  cCntrxRefp;
016100211028           if %eof(cCntrxRefp);
016200190717             leave;
016300190717           endif;
016400180919
016500200507
016600211027           s1inCntr = pcinCntr;
016601211028           s1OrigCntr = pcinCntr;
016602211028
016603211028
016604211028           if %Subst(pcInCntr: 1 : 8) = 'EASE_CC_';
016605211028             chain ( pTrst : pSub : pAcct : pcInCntr ) EaseCostl1;
016606211028             if %Found( EaseCostl1 );
016608211028               s1inCntr = d_Descr;
016610211028             endif;
016611211028           endif;
016612211028
016613211028
016614211028
016700211028           s1AmCntr = pcamCntr;
017001211026
020900211028           if s1Search = *blanks;
021000211028             rrn = rrn + 1;
021100211028             write LstSfl;
021200200429
021300200429           else;   //?Search Field
021400211028             if %scan( %Trim(s1Search) : s1inCntr ) > 0 or
021500211028               %scan( %Trim(s1Search) : s1amCntr ) > 0 ;
021700200429
021800211028               rrn = rrn + 1;
021900211028               write LstSfl;
022000211028             endif;
022100211028           endif;
022200200429
022300180919
022400211028           If rrn >= 9999;
022500211028             leave;
022600211028           endIf;
022700180919
022800211028         enddo;
022900180919
023000211028       End-Proc;
023100180919
024000180919
024100211028       // ----------------------------------------------------------------
024300180919
024400211028       Dcl-Proc ReadChangedS1;
024500180919
024600211028         Dou *in95 = *ON;
024700211028           READC LstSfl;
024800211028           *in95 = %EOF;
024900180919
025000211028           If *in95 = *OFF;
025100180919
025200211028             // Delete Data
025300190717             if btnDelete = *on;
025400180919
025500211028               chain ( pTrst : pSub : pAcct :
025600211028                 s1OrigCntr ) ccntrxrefp;
025700211028               if %Found( ccntrxRefp );
025800211028                 delete r_cntrxref;
025900211028               EndIf;
026000190717             EndIf;
026100180919
026200180919
026201211028             if btnView = *on;
026204211028               View_Record();
026213211028             EndIf;
026214211028
026215211028
026216211028             if btnEdit = *on;
026217211028               Edit_Record();
026218211028             EndIf;
026219211028
026220211028
026221211028
026300211028             btnDelete = *off;
026400211028             btnView = *off;
026401211028             btnEdit = *off;
026402211028
026403211028
026404211028
026405211028
026500211028             update LstSfl;
026600211028             Reload = 'Y';
026700180919
026800211028           endIf;
026900180919
027000211028         enddo;
027100180919
027200180919       End-Proc;
027300180919
027400180919
027401211028       //----------------------------------------------------------------
027402211028       //
027403211028       //  View Record
027404211028       //
027405211028       //-----------------------------------------------------------------
027406211028       Dcl-Proc View_Record;
027407211028
027410211028         s2Acct# =  %editc( pTrst : 'X' ) + '-' +
027411211028         %editc( pSub : 'X' ) + '-' +
027412211028           %editc( pAcct : 'X' ) ;
027413211028
027414211028         s2ActName = acNam1;
027415211028
027416211028
027417211028         chain(n) ( pTrst : pSub : pAcct : s1inCntr ) CcntrxRefp;
027418211028
027419211028
027420211028           s2Incntr = pcInCntr;
027421211028           if %Subst(pcInCntr: 1 : 8) = 'EASE_CC_';
027422211028             chain ( pTrst : pSub : pAcct : pcInCntr ) EaseCostl1;
027423211028             if %Found( EaseCostl1 );
027424211028               s2inCntr = d_Descr;
027425211028             endif;
027426211028           endif;
027427211028
027428211028
027429211028         if pcCrtDt > 0;
027430211028           s2CrtMsg = 'Record was created by ' +
027431211028           %Trim( pcCrtBy ) + ' on ' +
027432211028             %Char(%date(pcCrtDt) :*usa) + ' at ' +
027433211028             %Char(%Time(pcCrtTm) :*usa);
027434211028         endif;
027435211028
027436211028         if pcChgDt > 0;
027437211028           s2ChgMsg = 'Record was changed by ' +
027438211028           %Trim( pcChgBy ) + ' on ' +
027439211028             %Char(%date(pcChgDt) :*usa) + ' at ' +
027440211028             %Char(%Time(pcChgTm) :*usa);
027441211028         endif;
027442211028
027443211028         exfmt ViewScreen;
027444211028
027445211028       End-Proc;
027500200507
027600211028       //----------------------------------------------------------------
027700211028       //
027800211028       //  Add New Record
027900211028       //
028000211028       //-----------------------------------------------------------------
028300211028       Dcl-Proc AddNew_Record;
028400210708
028500210708         dcl-s caret Char(1);
028900200507
029400200507         s2Acct# =  %editc( pTrst : 'X' ) + '-' +
029500211028         %editc( pSub : 'X' ) + '-' +
029600211028         %editc( pAcct : 'X' ) ;
029700200507
029800200507         s2ActName = acNam1;
029900200507
030000210708         //---------------------------------------------------
030100210708         //
030200210708         // Build Drop Down.
030300210708         //
030400210708         //---------------------------------------------------
030500211028         s2AmCntr = '';
030501211028         s2InPlan = '';
030502211028
030600211028         inValue = '';
030700211028         inChoice = '';
030800210708
030900211028         Setll ( pTrst : pSub : pAcct ) Payfccntrp;
031000210708
031100211028         Dou %Eof(Payfccntrp);
031200211027           reade ( pTrst : pSub : pAcct ) Payfccntrp;
031300211027           if %eof(Payfccntrp);
031400211028             leave;
031500210708           endif;
031600210708
031700211028           inValue = %Trim( inValue )  + ',' + %trim( pfDiv );
031800210708
031900210708
032000210708           // Check if the plan was already used.
032100211028           caret = '';
032200211028           chain ( pTrst : pSub : pAcct : pfDiv ) CcntrxRefp;
032300211028           if %Found( ccntrxRefp ) ;
032400211028             caret = '~';
032500211028           EndIf;
032600210708
032700210708
032701211028           if %Subst(pfDiv: 1 : 8) = 'EASE_CC_';
032702211028
032703211028             chain ( pTrst : pSub : pAcct : pfDiv ) EaseCostl1;
032704211028             if %Found( EaseCostl1 );
032705211028
032706211028               inChoice = %Trim(inChoice) + ',"' + caret +
032707211028                 %trim( d_Descr ) + '"';
032709211028             else;
032710211028
032711211028               inChoice = %Trim(inChoice) + ',"' + caret +
032712211028                 %trim( pfDiv ) + '"';
032713211028
032714211028             endif;
032715211028           else;
032716211028             inChoice = %Trim(inChoice) + ',"' + caret +
032717211028             %trim( pfDiv ) + '"';
032718211028
032719211028           EndIf;
032720211028
032721211028
033400210708
034000210708         Enddo;
034100210708
034200210708         inValue = %Subst(inValue:2);
034300210708         inChoice = %Subst(inChoice:2);
034301211013         inChoice = '[' + %Trim( inChoice ) + ']';
034400210708
034500210708
034600210708
034700211028         //------------------------------------
034800211028         //
034900211028         // Display Screen
035000211028         //
035100211028         //------------------------------------
035200200507
035300211028         Dou btnExit = *on;
035400200507
036100211027           exfmt AddScreen;
036300210916
036700200507           s2Msg = '';
036701211028           err1 = *off;
036800200507
036900211028           if btnCancel = *on;
037000210916             btnCancel = *off;
037100211028             leave;
037200211028           EndIf;
037300200507
037400210916
037500211028           // Write Records
037600210916
037700211028           if btnAccept = *on;
037701211027
037702211028
037703211028             // if this record exists..  iter.
037704211028             chain ( pTrst : pSub : pAcct : s2InPlan ) cCntrxRefp;
037705211028             if %Found( cCntrxRefp );
037706211028               err1 = *on;
037707211028               iter;
037708211028             EndIf;
037709211028
037710211028
037711211028
037712211028             pcTrst = pTrst;
037713211028             pcSub# = pSub;
037714211028             pcAcct = pAcct;
037715211028
037716211028             pcInCntr = s2InPlan;
037717211028             pcAmCntr = s2AmCntr;
037718211028             pcCrtBy = wqUsrn;
037719211028             pcCrtDt = %Dec(%Date);
037720211028             pcCrtTm = %Dec(%Time);
037721211028
037722211028             pcChgBy = '';
037723211028             pcChgDt = 0;
037724211028             pcChgTm = 0;
037725211028
037726211028             write r_CntrxRef;
037727211028
037728211028
037729211028             s2Msg = 'Cost Center: ' + %Trim( S2AMCNTR ) + ' has been added ';
037730211028           EndIf;
042500211028         enddo;
042800200507
042900200507       End-Proc;
043000200507
043100180919
043101211028       //----------------------------------------------------------------
043102211028       //
043103211028       //  Edit Record
043104211028       //
043105211028       //-----------------------------------------------------------------
043106211028       Dcl-Proc Edit_Record;
043107211028
043109211028
043110211028         s2Acct# =  %editc( pTrst : 'X' ) + '-' +
043111211028         %editc( pSub : 'X' ) + '-' +
043112211028         %editc( pAcct : 'X' ) ;
043113211028
043114211028         s2ActName = acNam1;
043115211028
043155211028         chain ( pTrst : pSub : pAcct : s1OrigCntr ) CcntrxRefp;
043156211028
043160211028           s2inPlan = pcInCntr;
043161211028           if %Subst(pcInCntr: 1 : 8) = 'EASE_CC_';
043162211028             chain ( pTrst : pSub : pAcct : s1OrigCntr ) EaseCostl1;
043163211028             if %Found( EaseCostl1 );
043164211028               s2inPlan = d_Descr;
043165211028             endif;
043166211028           endif;
043167211028
043168211028         s2AmCntr = pcAmCntr;
043169211028
043170211028
043171211028         //------------------------------------
043172211028         //
043173211028         // Display Screen
043174211028         //
043175211028         //------------------------------------
043176211028
043177211028         Dou btnExit = *on;
043178211028
043179211028           exfmt EditScreen;
043180211028
043181211028           if btnCancel = *on;
043182211028             btnCancel = *off;
043183211028             leave;
043184211028           EndIf;
043185211028
043186211028
043187211028           // Update Records
043188211028
043189211028           if btnAccept = *on;
043193211028
043199211028             pcAmCntr = s2AmCntr;
043200211028             pcChgBy = wqUsrn;
043201211028             pcChgDt = %Dec(%Date);
043202211028             pcChgTm = %Dec(%Time);
043203211028
043207211028
043208211028             update r_CntrxRef;
043209211028             leave;
043210211028
043212211028           EndIf;
043213211028         enddo;
043214211028
043215211028         unlock cCntrxRefp;
043216211028       End-Proc;
043217211028
