000100180718       Ctl-opt option(*noDebugIo)   DftActGrp(*no);
000200180718
000300180718      *-------------------------------------------------------------------------
000400180718      *
000500180719      *  Description: View GBS-Format File
000600180718      *  Programmer.: Brian Rees
000700180718      *  Date.......: 07/18/2018
000800180718      *
000900180723      *      *  ** Must have LumMod in your Libary List to Compile.
001000180723      *
001100180718      *-------------------------------------------------------------------------
001200180718
001300180718      *-------------------------------------------------------------------------
001400180718      *
001500180718      * Declare Files
001600180718      *
001700180718      *-------------------------------------------------------------------------
001800180723       Dcl-f GBS0038d2 WorkStn
001900180719          Handler('PROFOUNDUI(HANDLER)')
002000180720          SFILE( ListSfl : rrn)
002100180724          SFILE( PlanSfl : rrn2 )
002200180724          sFile( DepSfl  : rrn3 )
002300180724          sFile( CovgSfl : rrn4 );
002400180724
002500180718
002600191205       dcl-f UltiSoftl1 keyed usropn;
002700191205       dcl-f UltiSoftl2 keyed rename( UltisoftR : Rcd_2 ) usropn;
002800191205       dcl-f UltiSoftl3 keyed rename( UltisoftR : Rcd_3 ) usropn;
002900191205       dcl-f UltiSoftl4 keyed rename( UltisoftR : Rcd_4 ) usropn;
003000180718
003100180718
003200180718
003300180718      *-------------------------------------------------------------------------
003400180718      *
003500180718      * Global Variables
003600180718      *
003700180718      *-------------------------------------------------------------------------
003800180718       dcl-s hasError ind;
003900180719       dcl-s rrn Zoned(5);
004000180720       dcl-s rrn2 Zoned(5);
004100180724       dcl-s rrn3 Zoned(5);
004200180724       dcl-s rrn4 Zoned(5);
004300180718
004400180724      *-------------------------------------------------------------------------
004500180724      *
004600180724      * *Entry Procedure
004700180724      *
004800180724      *-------------------------------------------------------------------------
004900180724       Dcl-pr Main ExtPgm;
005000180724          *N  Char(40);
005100180724       End-Pr;
005200180724
005300180724       dcl-pi Main;
005400180724          pName Char(40);
005500180724       End-Pi;
005600180724
005700180724
005800180718      *-------------------------------------------------------------------------
005900180718      *
006000180718      * Mainline Program
006100180718      *
006200180718      *-------------------------------------------------------------------------
006300191205       open UltiSoftl1;
006301191205       open UltiSoftl2;
006302191205       open UltiSoftl3;
006303191205       open UltiSoftl4;
006304191205
006400180724       ClearS1();
006500180724       LoadS1();
006600180724
006700180724
006800180719       Dou btnExit = *on;
006900180719
007000180719          DisplyS1();
007100180719          ReadChangedS1();
007200180719
007300180719       enddo;
007400180719
007401191205       Close UltiSoftl1;
007402191205       Close UltiSoftl2;
007403191205       Close UltiSoftl3;
007404191205       Close UltiSoftl4;
007405191205
007500180719       *inlr = *on;
007600180719
007700180719
007800180719
007900180719       // ----------------------------------------------------------------
008000180719       dcl-proc CLEARS1;
008100180719
008200180719          //-------------------------
008300180719          //
008400180719          // Clear the Subfile
008500180719          //
008600180719          //-------------------------
008700180719
008800180719          ClrSfl = *on;
008900180719          Write Screen1;
009000180719          ClrSfl = *off;
009100180719          rrn = 0;
009200180719
009300180720
009400180719       End-Proc;
009500180719
009600180719       // ----------------------------------------------------------------
009700180719
009800180719       Dcl-Proc LoadS1;
009900180719
010000180719          Setll *loval UltiSoftl1;
010100180719          Dou %eof(UltiSoftl1);
010200180719
010300180719             read UltiSoftl1;
010400180719             if %eof(UltiSoftl1);
010500180719                leave;
010600180719             endif;
010700180719
010800180719
010900180719             s1ssn = %Subst( l1_ssn : 1 : 3 ) + '-' +
011000180719                %Subst( l1_ssn : 4 : 2 ) + '-' +
011100180719                %Subst( l1_ssn : 6 : 4 );
011200180719
011300180719             s1h_ssn = l1_ssn;
011400180719             s1Name =  %Trim( l1_LName ) + ', ' + %Trim( l1_Fname );
011500180724             s1TermDt = '';
011600180724             if l1_TermDt > '';
011700180724                s1TermDt = %Char(%Date(l1_TermDt:*iso0):*Usa);
011800180724             endif;
011900180724
012000180719
012100180719             rrn = rrn + 1;
012200180719             write ListSfl;
012300180719
012400180719             If rrn >= 9999;
012500180719                leave;
012600180719             endIf;
012700180719
012800180719          enddo;
012900180719
013000180719       End-Proc;
013100180719
013200180719       // ----------------------------------------------------------------
013300180719       Dcl-Proc DisplyS1;
013400180719
013500180719          DspSfl = *on  ;
013600180719          exfmt Screen1;
013700180719          DspSfl = *off;
013800180719
013900180719       End-Proc;
014000180719
014100180719       // ----------------------------------------------------------------
014200180719       Dcl-Proc ReadChangedS1;
014300180719
014400180719          Dou *in95 = *ON;
014500180719             READC ListSfl;
014600180719             *in95 = %EOF;
014700180719
014800180719             If *in95 = *OFF;
014900180719
015000180719
015100180719                //?View Data Record
015200180719                if btnView = *on;
015300180720
015400180723
015500180723                   // Clear Subfile
015600180723                   ClrSfl2 = *on;
015700180723                   Write Screen2;
015800180723                   ClrSfl2 = *off;
015900180723
016000180723
016100180720                   Load_Data();
016200180720
016300180723
016400180723                   if rrn2 > 0;
016500180723                      DSPSFL2 = *on;
016600180723                   EndIf;
016700180723
016800180720                   exfmt Screen2;
016900180723                   btnExit = *off;
017000180719                endIf;
017100180719
017200180719
017300180720                btnView = *off;
017400180719                update ListSfl;
017500180719
017600180719             endIf;
017700180719
017800180719          enddo;
017900180719
018000180719       End-Proc;
018100180720
018200180720
018300180720
018400180720       // ----------------------------------------------------------------
018500180720       Dcl-Proc Load_Data;
018600180720
018700180720          Clear Screen2;
018800180724          s2pName = pName;
018900180724
019000180724
019100180720          chain s1h_ssn Ultisoftl1;
019200180720
019300180720          s2ssn = s1h_ssn;
019400180720
019500180720          s2ssnfull = s1ssn;
019600180720          s2Name = %Trim( l1_LName ) + ', ' + %Trim( l1_FName ) + ' ' +
019700180720             %Trim( l1_MI ) ;
019800180720          s2Addr1 = l1_Addr1;
019900180720          s2Addr2 = l1_Addr2;
020000180720
020100180720          if l1_City > '';
020200180720             s2csz = %Trim( l1_City ) + ', ' + %Trim( l1_State ) + '  ' +
020300180720                l1_Zip;
020400180720          endif;
020500180720
020600180720
020700180720
020800180720          s2Phone = l1_Phone;
020900180720          s2Gender = l1_Gender;
021000180720          if l1_Dob > '';
021100180720             s2Birth =  %Char(%Date(l1_Dob:*iso0):*Usa);
021200180720          endif;
021300180720
021400180720          if l1_Doh > '';
021500180720             s2doh = %Char(%Date(l1_doh:*iso0):*Usa);
021600180720          endif;
021700180720
021800180720          s2Loc = l1_Loc;
021900180720
022000180720          s2MarSts = l1_MarSts;
022100180720          s2Sal = l1_Sal;
022200180720
022300180720          if l1_TermDt > '';
022400180720             s2TermDt = %Char(%Date(l1_TermDt:*iso0):*Usa);
022500180720          endif;
022600180720
022700180720          if l1_Doc > '';
022800180720             s2Doc = %Char(%Date(l1_Doc:*iso0):*Usa);
022900180720          endif;
023000180720
023100180720
023200180723          s2TermRsn = l1_TermRsn;
023300180723
023400180720          s2Cobra = l1_COBRA;
023500180720          s2Clas = l1_Class;
023600180720          s2Group = l1_Group;
023700180720          s2PartId = l1_Partid;
023800180720          s2Div = l1_Div;
023900180720
024000180720          if l1_SalChgD > '';
024100180720             s2SalChgDt = %Char(%Date(l1_SalChgD:*iso0):*Usa);
024200180720          endif;
024300180720
024400180723
024500180723          rrn2 = 0;
024600180724          rrn3 = 0;
024700180724          rrn4 = 0;
024800180723
024900180724
025000180723          // Load Plan Subfile.
025100180723          Setll l1_ssn UltiSoftl2;
025200180723
025300180723          Dou %Eof(UltiSoftl2);
025400180723             reade l1_ssn UltiSoftl2;
025500180723             if %eof(UltiSoftl2);
025600180723                leave;
025700180723             endif;
025800180723
025900180723             s2Plan = l2_Plan;
026000180723
026100180723             s2EffDt = '';
026200180723             if l2_EffDt > '';
026300180723                s2EffDt = %Char(%Date(l2_Effdt:*iso0):*Usa);
026400180723             EndIf;
026500180723
026600180723             s2TermDt = '';
026700180723             if l2_TermDt > '';
026800180723                s2TermDt = %Char(%Date(l2_TermDt:*iso0):*Usa);
026900180723             EndIf;
027000180723
027100180723             s2Enrl = l2_Enrl;
027200180723             s2Fsa_Ann = l2_FSA_Ann;
027300180723             s2FSA_PP = l2_FSA_PP;
027400180723             s2VolAmt = l2_VolAmt;
027500180723             s2CovgTp = l2_CovTyp;
027600180723
027700180723
027800180723             rrn2 = rrn2 + 1;
027900180723             write PlanSfl;
028000180723
028100180723          Enddo;
028200180723
028300180723
028400180724
028500180724          //------------------------------------------
028600180724          //
028700180724          // Dependent Subfile
028800180724          //
028900180724          //------------------------------------------
029000180723          Setll l2_ssn UltiSoftl3;
029100180723
029200180723          Dou %Eof(UltiSoftl3);
029300180723             reade l2_ssn UltiSoftl3;
029400180723             if %eof(UltiSoftl3);
029500180723                leave;
029600180723             endif;
029700180723
029800180724             s3Relat = l3_RelCod;
029900180724             s3Name = %Trim(l3_lname) + ', ' +
030000180724                %Trim( l3_fname ) + ' ' + l3_mi ;
030100180724             s3Address = %Trim( l3_Addr1 );
030200180724
030300180724             if l3_Addr2 > '';
030400180724                s3Address = %Trim( s3Address ) + ' ' + %Trim( l3_Addr2 );
030500180724             EndIf;
030600180724
030700180724             if l3_City > '';
030800180724                s3Address = %Trim( s3Address ) + ' '
030900180724                   + %Trim( l3_City ) + ', ' + %Trim( l3_State ) + '  '
031000180724                   + l3_Zip ;
031100180724             EndIf;
031200180724
031300180724             s3Gender = l3_Gender;
031400180724             s3Birth = '';
031500180724             if l3_dob > '';
031600180724                s3Birth = %Char(%Date(l3_dob:*iso0):*Usa);
031700180724             EndIf;
031800180724
031900180724             s3EffDt = '';
032000180724             if l3_EffDt > '';
032100180724                s3EffDt = %Char(%Date(l3_EffDt:*iso0):*Usa);
032200180724             EndIf;
032300180724
032400180724             s3COBRA = l3_COBRA;
032500180724             s3qevent = l3_qevent;
032600180724             s3Disab = l3_Disab;
032700180724             s3Depno = l3_Depno;
032800180724             s3ssn = l3_Depssn;
032900180724
033000180724             rrn3 = rrn3 + 1;
033100180724             write DepSfl;
033200180724
033300180724
033400180723
033500180724             //------------------------------------------
033600180724             //
033700180724             // Dependent Coverages
033800180724             //
033900180724             //------------------------------------------
034000180724
034100180724
034200180724
034300180723             Setll L3_uniqid UltiSoftl4;
034400180723
034500180723             Dou %Eof(UltiSoftl4);
034600180723                reade L3_uniqid UltiSoftl4;
034700180723                if %eof(UltiSoftl4);
034800180723                   leave;
034900180723                endif;
035000180723
035100180724                s4Name = s3Name;
035200180724                s4Plan = l4_Plan;
035300180724                s4EffDt = '';
035400180724                if l4_effDt > '';
035500180724                   s4EffDt =  %Char(%Date(l4_effDt:*iso0):*Usa);
035600180724                EndIf;
035700180724
035800180724
035900180724                s4TermDt = '';
036000180724                if l4_TermDt > '';
036100180724                   s4TermDt =  %Char(%Date(l4_TermDt:*iso0):*Usa);
036200180724                EndIf;
036300180724
036400180724                s4CovgTyp = l4_CovTyp;
036500180724
036600180724                rrn4 = rrn4 + 1;
036700180724                write CovgSfl;
036800180724
036900180723
037000180723             Enddo;
037100180723
037200180724
037300180724
037400180723          Enddo;
037500180723
037600180723
037700180720       End-Proc;
037800180720
037900180719
