000100180718       Ctl-opt option(*noDebugIo)   DftActGrp(*no);
000200180718
000300180718      *-------------------------------------------------------------------------
000400180718      *
000500180719      *  Description: View GBS-Format File
000600180718      *  Programmer.: Brian Rees
000700180718      *  Date.......: 07/18/2018
000800180718      *
000900180718      *-------------------------------------------------------------------------
001000180718
001100180718      *-------------------------------------------------------------------------
001200180718      *
001300180718      * Declare Files
001400180718      *
001500180718      *-------------------------------------------------------------------------
001600200221       Dcl-f GBS0038d4 WorkStn
001700180719          Handler('PROFOUNDUI(HANDLER)')
001800180720          SFILE( ListSfl : rrn)
001900190524          SFILE( pLANSfl : rrn2)
002000190524          SFILE( DepSfl  : rrn3)
002100190524          SFILE( CovgSfl  : rrn4);
002200180718
002300200221       dcl-f GBS20l1 keyed usropn;
002400200221       dcl-f GBS20l2 keyed rename( r_gbs20p : Rcd_2 ) usropn;
002500200221       dcl-f GBS20l3 keyed rename( r_gbs20p : Rcd_3 ) usropn;
002600200221       dcl-f GBS20l4 keyed rename( r_gbs20p : Rcd_4 ) usropn;
002700180718
002800180718
002900180718
003000180718      *-------------------------------------------------------------------------
003100180718      *
003200180718      * Global Variables
003300180718      *
003400180718      *-------------------------------------------------------------------------
003500180718       dcl-s hasError ind;
003600180719       dcl-s rrn Zoned(5);
003700180720       dcl-s rrn2 Zoned(5);
003800180724       dcl-s rrn3 Zoned(5);
003900180724       dcl-s rrn4 Zoned(5);
004000180724
004100180724      *-------------------------------------------------------------------------
004200180724      *
004300180724      * *Entry Procedure
004400180724      *
004500180724      *-------------------------------------------------------------------------
004600180724       Dcl-pr Main ExtPgm;
004700180724          *N  Char(40);
004800180724       End-Pr;
004900180724
005000180724       dcl-pi Main;
005100180724          pName Char(40);
005200180724       End-Pi;
005300180724
005400180718
005500180718      *-------------------------------------------------------------------------
005600180718      *
005700180718      * Mainline Program
005800180718      *
005900180718      *-------------------------------------------------------------------------
006000180718
006100200221       open GBS20l1;
006200200221       open GBS20l2;
006300200221       open GBS20l3;
006400200221       open GBS20l4;
006500191205
006600180719       Dou btnExit = *on;
006700180719
006800180719          ClearS1();
006900180719          LoadS1();
007000180719
007100180719          DisplyS1();
007200180719
007300180719          ReadChangedS1();
007400180719
007500180719
007600180719       enddo;
007700180719
007800200221       Close GBS20l1;
007900200221       Close GBS20l2;
008000200221       Close GBS20l3;
008100200221       Close GBS20l4;
008200191205
008300180719       *inlr = *on;
008400180719
008500180719
008600180719
008700180719       // ----------------------------------------------------------------
008800180719       dcl-proc CLEARS1;
008900180719
009000180719          //-------------------------
009100180719          //
009200180719          // Clear the Subfile
009300180719          //
009400180719          //-------------------------
009500180719
009600180719          ClrSfl = *on;
009700180719          Write Screen1;
009800180719          ClrSfl = *off;
009900180719          rrn = 0;
010000180719
010100180720
010200180719       End-Proc;
010300180719
010400180719       // ----------------------------------------------------------------
010500180719
010600180719       Dcl-Proc LoadS1;
010700180719
010800200221          Setll *loval GBS20l1;
010900200221          Dou %eof(GBS20l1);
011000180719
011100200221             read GBS20l1;
011200200221             if %eof(GBS20l1);
011300180719                leave;
011400180719             endif;
011500180719
011600180719
011700180719             s1ssn = %Subst( l1_ssn : 1 : 3 ) + '-' +
011800180719                %Subst( l1_ssn : 4 : 2 ) + '-' +
011900180719                %Subst( l1_ssn : 6 : 4 );
012000180719
012100180719             s1h_ssn = l1_ssn;
012200180719             s1Name =  %Trim( l1_LName ) + ', ' + %Trim( l1_Fname );
012300180724
012400180724             s1TermDt = '';
012500180724             if l1_TermDt > '';
012600180724                s1TermDt = %Char(%Date(l1_TermDt:*iso0):*Usa);
012700180724             endif;
012800180719
012900180719
013000180719             rrn = rrn + 1;
013100180719             write ListSfl;
013200180719
013300180719             If rrn >= 9999;
013400180719                leave;
013500180719             endIf;
013600180719
013700180719          enddo;
013800180719
013900180719       End-Proc;
014000180719
014100180719       // ----------------------------------------------------------------
014200180719       Dcl-Proc DisplyS1;
014300180719
014400180719          DspSfl = *on  ;
014500180719          exfmt Screen1;
014600180719          DspSfl = *off;
014700180719
014800180719       End-Proc;
014900180719
015000180719       // ----------------------------------------------------------------
015100180719       Dcl-Proc ReadChangedS1;
015200180719
015300180719          Dou *in95 = *ON;
015400180719             READC ListSfl;
015500180719             *in95 = %EOF;
015600180719
015700180719             If *in95 = *OFF;
015800180719
015900180719
016000180719                //?View Data Record
016100180719                if btnView = *on;
016200180720
016300180723
016400180723                   // Clear Subfile
016500180723                   ClrSfl2 = *on;
016600180723                   Write Screen2;
016700180723                   ClrSfl2 = *off;
016800180723
016900180723
017000180720                   Load_Data();
017100180720
017200180723
017300180723                   if rrn2 > 0;
017400180723                      DSPSFL2 = *on;
017500180723                   EndIf;
017600180723
017700180720                   exfmt Screen2;
017800180723                   btnExit = *off;
017900180719                endIf;
018000180719
018100180719
018200180720                btnView = *off;
018300180719                update ListSfl;
018400180719
018500180719             endIf;
018600180719
018700180719          enddo;
018800180719
018900180719       End-Proc;
019000180720
019100180720
019200180720
019300180720       // ----------------------------------------------------------------
019400180720       Dcl-Proc Load_Data;
019500180720
019600180723
019700180720          Clear Screen2;
019800180724          s2pName = pName;
019900180720
020000200221          chain s1h_ssn GBS20l1;
020100180720
020200180720          s2ssn = s1h_ssn;
020300180720
020400180720          s2ssnfull = s1ssn;
020500180720          s2Name = %Trim( l1_LName ) + ', ' + %Trim( l1_FName ) + ' ' +
020600180720             %Trim( l1_MI ) ;
020700180720          s2Addr1 = l1_Addr1;
020800180720          s2Addr2 = l1_Addr2;
020900180720
021000180720          if l1_City > '';
021100180720             s2csz = %Trim( l1_City ) + ', ' + %Trim( l1_State ) + '  ' +
021200180720                l1_Zip;
021300180720          endif;
021400180720
021500180720
021600180720
021700180720          s2Phone = l1_Phone;
021800180720          s2Gender = l1_Gender;
021900180720          if l1_Dob > '';
022000180720             s2Birth =  %Char(%Date(l1_Dob:*iso0):*Usa);
022100180720          endif;
022200180720
022300180720          if l1_Doh > '';
022400180720             s2doh = %Char(%Date(l1_doh:*iso0):*Usa);
022500180720          endif;
022600180720
022700180720          s2Loc = l1_Loc;
022701200508          s2FullLoc = l1_FullLoc;
022800180720
022900180720          s2MarSts = l1_MarSts;
023000180720          s2Sal = l1_Sal;
023100180720
023200180720          if l1_TermDt > '';
023300180720             s2TermDt = %Char(%Date(l1_TermDt:*iso0):*Usa);
023400180720          endif;
023500180720
023600180720          if l1_Doc > '';
023700180720             s2Doc = %Char(%Date(l1_Doc:*iso0):*Usa);
023800180720          endif;
023900180720
024000180720
024100180720          s2Cobra = l1_COBRA;
024200180720          s2Clas = l1_Class;
024300190708          s2TermRsn = l1_TermRsn;
024400190708          s2QualEvt = l1_QualEvt;
024500190708          s2Email = l1_Email;
024600190708          s2Smoker = l1_Smoker;
024700190708          s2Email = l1_Email;
024800180720
024801200508
024900180723          rrn2 = 0;
024901201119          rrn3 = 0;
024902201119          rrn4 = 0;
025000180723
025100180723          // Load Plan Subfile.
025200200221          Setll l1_ssn GBS20l2;
025300180723
025400200221          Dou %Eof(GBS20l2);
025500200221             reade l1_ssn GBS20l2;
025600200221             if %eof(GBS20l2);
025700180723                leave;
025800180723             endif;
025900180723
026000180723             s2Plan = l2_Plan;
026100180723
026200180723             s2EffDt = '';
026300180723             if l2_EffDt > '';
026400180723                s2EffDt = %Char(%Date(l2_Effdt:*iso0):*Usa);
026500180723             EndIf;
026600180723
026700180723             s2TermDt = '';
026800180723             if l2_TermDt > '';
026900180723                s2TermDt = %Char(%Date(l2_TermDt:*iso0):*Usa);
027000180723             EndIf;
027100180723
027200180723             s2Enrl = l2_Enrl;
027300180723             s2Fsa_Ann = l2_FSA_Ann;
027400180723             s2FSA_PP = l2_FSA_PP;
027500180723             s2VolAmt = l2_VolAmt;
027600180723             s2CovgTp = l2_CovgTp;
027700180723
027800180723
027900180723             rrn2 = rrn2 + 1;
028000180723             write PlanSfl;
028100180723
028200180723          Enddo;
028300180723
028400180723
028500180724          //------------------------------------------
028600180724          //
028700180724          // Dependent Subfile
028800180724          //
028900180724          //------------------------------------------
029000200221          Setll l2_ssn GBS20l3;
029100180724
029200200221          Dou %Eof(GBS20l3);
029300200221             reade l2_ssn GBS20l3;
029400200221             if %eof(GBS20l3);
029500180724                leave;
029600180724             endif;
029700180724
029800180724             s3Relat = l3_RelCod;
029900180724             s3Name = %Trim(l3_lname) + ', ' +
030000180724                %Trim( l3_fname ) + ' ' + l3_mi ;
030100180724             s3Address = %Trim( l3_Addr1 );
030200180724
030300180724             if l3_Addr2 > '';
030400180724                s3Address = %Trim( s3Address ) + ' ' + %Trim( l3_Addr2 );
030500180724             EndIf;
030600180724
030700180724             if l3_City > '';
030800180724                s3Address = %Trim( s3Address ) + ' '
030900180724                   + %Trim( l3_City ) + ', ' + %Trim( l3_State ) + '  '
031000180724                   + l3_Zip ;
031100180724             EndIf;
031200180724
031300180724             s3Gender = l3_Gender;
031400180724             s3Birth = '';
031500180724             if l3_dob > '';
031600180724                s3Birth = %Char(%Date(l3_dob:*iso0):*Usa);
031700180724             EndIf;
031800180724
031900180724             s3EffDt = '';
032000180724             if l3_EffDt > '';
032100180724                s3EffDt = %Char(%Date(l3_EffDt:*iso0):*Usa);
032200180724             EndIf;
032300180724
032400180724             s3COBRA = l3_COBRA;
032500180724             s3ssn = l3_Depssn;
032600180724
032700180724             rrn3 = rrn3 + 1;
032800180724             write DepSfl;
032900180724
033000180724
033100180724
033200180724             //------------------------------------------
033300180724             //
033400180724             // Dependent Coverages
033500180724             //
033600180724             //------------------------------------------
033700180724
033800180724
033900180724
034000200221             Setll L3_uniqid GBS20l4;
034100180724
034200200221             Dou %Eof(GBS20l4);
034300200221                reade L3_uniqid GBS20l4;
034400200221                if %eof(GBS20l4);
034500180724                   leave;
034600180724                endif;
034700180724
034800180724                s4Name = s3Name;
034900180724                s4Plan = l4_Plan;
035000180724                s4EffDt = '';
035100180724                if l4_effDt > '';
035200180724                   s4EffDt =  %Char(%Date(l4_effDt:*iso0):*Usa);
035300180724                EndIf;
035400180724
035500180724
035600180724                s4TermDt = '';
035700180724                if l4_TermDt > '';
035800180724                   s4TermDt =  %Char(%Date(l4_TermDt:*iso0):*Usa);
035900180724                EndIf;
036000180724
036100180724                s4CovgTyp = l4_CovgTyp;
036200180724
036300180724                rrn4 = rrn4 + 1;
036400180724                write CovgSfl;
036500180724
036600180724
036700180724             Enddo;
036800180724
036900180724
037000180724
037100180724          Enddo;
037200180724
037300180724
037400180720       End-Proc;
037500180720
037600180719
