000100180620       Ctl-opt option(*noDebugIo)   DftActGrp(*no)
000200180620          bnddir('GBSBIND' : 'GBSBDIR');
000300180620
000400180620      *-------------------------------------------------------------------------
000500180620      *
000600180914      *  Description: Batch Account Diary Note
000700180914      *
000800180914      *  Programmer.: Brian Rees
000900180914      *  Date.......: 09/14/2018
001000180620      *
001100180620      *-------------------------------------------------------------------------
001200180620
001300180620      *-------------------------------------------------------------------------
001400180620      *
001500180620      * Declare Files
001600180620      *
001700180620      *-------------------------------------------------------------------------
001800180830       Dcl-f Gbs0040D WorkStn
001900180620          Handler('PROFOUNDUI(HANDLER)')
002000180620          SFILE(LstSFL:rrn);
002100180620
002200180621       Dcl-f DiaryHd1 keyed ExtDesc('F.DIARYHD1') ExtFile(*extdesc)
002300180621          usage( *input : *output );
002400180621
002500180621       Dcl-f DiaryDt1 keyed ExtDesc('F.DIARYDT1') ExtFile(*extdesc)
002600180621          usage( *input : *output );
002700180621
002800180621       Dcl-f Codesl1 keyed ExtDesc('F.CODESL1') ExtFile(*extdesc);
002900180621
003000180621
003100180621       Dcl-f TrsMst keyed ExtDesc('F.TRSMST') ExtFile(*extdesc);
003200180621       Dcl-f SubMst keyed ExtDesc('F.SUBMST') ExtFile(*extdesc);
003300180621       Dcl-f AccMst keyed ExtDesc('F.ACCMST') ExtFile(*extdesc);
003400180621       Dcl-f Member keyed ExtDesc('F.MEMBER') ExtFile(*extdesc);
003500180622       Dcl-f Hist   keyed ExtDesc('F.HIST')   ExtFile(*extdesc)
003600180622          usage( *input : *output );
003700180830
003800180830       dcl-f gbs0040p keyed
003900180830          usage(*output : *update : *delete );
004000180622
004100180620
004200180620
004300180620      *-------------------------------------------------------------------------
004400180620      *
004500180620      * Global Variables
004600180620      *
004700180620      *-------------------------------------------------------------------------
004800180621       dcl-ds pgmd
004900180621          ExtName('IOPGMD') PSDS;
005000180621          @pgmq *proc;
005100180621       end-ds;
005200180621
005300180621
005400180621       dcl-s rrn Zoned(5);
005500180620       dcl-s Reload Char(1) inz('Y');
005600180621       dcl-s wKey Char(10);
005700180621       dcl-s wSocial Char(9);
005800180830       dcl-s hasError Char(1);
005900180830       dcl-c digits  '0123456789';
006000180620
006100180830       dcl-s wTrst    Zoned(3);
006200180830       dcl-s wSub#    Zoned(3);
006300180830       dcl-s wAcct    Zoned(4);
006400180830       dcl-s wActNbr like( s1ActNbr );
006500180830
006600180830       dcl-s ListProc ind inz;
006700180830
006800180620
006900180620      *------------------------------------------------------------------
007000180620      *
007100180620      * Procedures
007200180620      *
007300180620      *------------------------------------------------------------------
007400180830       /include GBSPGM/QMODSRC,#GettokPR
007500180830       /include GBSPGM/QMODSRC,#zFillpr
007600180830
007700180620
007800180620
007900180621      *-------------------------------------------------------------------------
008000180621      *
008100180621      * *Entry Procedure
008200180621      *
008300180621      *-------------------------------------------------------------------------
008400180621
008500180829
008600180829
008700180829
008800180620      *-------------------------------------------------------------------------
008900180620      *
009000180620      * Mainline Program
009100180620      *
009200180620      *-------------------------------------------------------------------------
009300180621
009400180829
009500180829
009600180829       dou btnExit = *on;
009700180829
009800180829          ClearS1();
009900180829          LoadS1();
010000180829
010100180829          DisplyS1();
010200180829
010300180829          if btnExit = *on;
010400180829             leave;
010500180829          endif;
010600180829
010700180829
010800180829          Select;
010900180829
011000180829          When btnClear = *on;
011100180829             Setll *Loval gbs0040p;
011200180829
011300180829             Dou %Eof(gbs0040p);
011400180829                read gbs0040p;
011500180829                if %eof(gbs0040p);
011600180829                   leave;
011700180829                endif;
011800180829                delete gbs0040p;
011900180829             Enddo;
012000180830             ListProc = *off;
012100180829
012200180829
012300180829
012400180829          When btnAccept = *on;
012500180913             validate();
012600180913             if hasError = *on;
012700180913                iter;
012800180913             EndIf;
012900180829
013000180913             Write_Hist();
013100180830             ListProc = *on;
013200180829
013300180830
013400180830
013500180829          when  btnAddNew = *on;
013600180829             Clear AddScreen;
013700180829             $AddRecord();
013800180829
013900180829
014000180829          other;
014100180829             ReadChanged();
014200180829
014300180829          endsl;
014400180829
014500180829       enddo;
014600180829
014700180829       *inlr = *on;
014800180829
014900180829
015000180829
015100180829      *-------------------------------------------------------------------------
015200180829       dcl-proc ClearS1;
015300180829
015400180829          //?Clear the Subfile
015500180829          ClrSfl = *on;
015600180829          Write LstCtl;
015700180829          ClrSfl = *off;
015800180829
015900180829          rrn = 0;
016000180829
016100180829       end-proc;
016200180829
016300180829      *-------------------------------------------------------------------------
016400180829
016500180829       dcl-proc DisplyS1;
016600180829
016700180829          DspSfl = *on  ;
016800180829          exfmt  LstCtl ;
016900180829          DspSfl = *off;
017000180829
017100180829       end-proc;
017200180829
017300180829      *-------------------------------------------------------------------------
017400180829
017500180829       dcl-proc LoadS1;
017600180829
017700180829          Setll *Loval gbs0040p;
017800180829
017900180829          Dou %Eof(gbs0040p);
018000180829             read gbs0040p;
018100180829
018200180829             if %eof(gbs0040p);
018300180829                leave;
018400180829             endif;
018500180829
018600180829             s1FulAcct = gbFulAct;
018700180829             if %Len( %trim(gbFulAct)) = 10;
018800180829                s1FulAcct = %Subst( gbFulAct : 1 : 3 ) + '-' +
018900180829                   %Subst( gbFulAct : 4 : 3 ) + '-' +
019000180829                   %Subst( gbFulAct : 7 : 4 );
019100180829             endif;
019200180829
019300180829             s1AcNam1 = gbName;
019400180829             s1trst   = gbTrst;
019500180829             s1Sub#   = gbSub;
019600180829             s1Acct   = gbAcct;
019700180829
019800180829             rrn = rrn + 1;
019900180829             write LstSfl;
020000180829          Enddo;
020100180829
020200180829          shwClrAct = *off;
020300180829          if rrn > 0 ;
020400180829             shwClrAct = *on;
020500180829          EndIf;
020600180829
020700180829
020800180830       end-proc;
020900180829
021000180829
021100180829
021200180829
021300180829      *-------------------------------------------------------------------------
021400180829       dcl-proc ReadChanged;
021500180829
021600180829          Dou *in95 = *ON;
021700180829             READC LstSfl;
021800180829             *in95 = %EOF;
021900180829
022000180829             If *in95 = *OFF;
022100180829
022200180829                If btnDelete= *on;
022300180830                   chain ( s1trst : s1Sub# : s1acct ) gbs0040p;
022400180830                   if %Found( gbs0040p ) ;
022500180830                      delete r_gbs0040;
022600180829                   EndIf;
022700180829                endIf;
022800180829
022900180829                btnDelete = *off;
023000180829                update LstSfl;
023100180829             endIf;
023200180829
023300180829
023400180829          enddo;
023500180829       end-proc;
023600180620
023700180830      *-------------------------------------------------------------------------
023800180830       dcl-proc $AddRecord;
023900180830
024000180830
024100180830          dou btnCancel = *on;
024200180830
024300180830             exfmt AddScreen;
024400180830             errAccount = *off;
024500180830             errAcct2   = *off;
024600180830             s2Msg = '';
024700180830
024800180830
024900180830             if btnAccept = *on;
025000180830                ListProc = *off;
025100180830
025200180830                split();
025300180830                wActNbr = s1ActNbr;
025400180830                s1ActNbr = %ScanRpl( '-' : '' : s1ActNbr );
025500180830                s1ActNbr = %ScanRpl( '-' : '' : s1ActNbr );
025600180830                s1ActNbr = %ScanRpl( ' ' : '' : s1ActNbr );
025700180830
025800180830
025900180830
026000180830                if %check( digits : %Trim( s1ActNbr )) = 0  and
026100180830                   %Len(%Trim( s1ActNbr )) = 10;
026200180830
026300180830                   wTrst = %Dec( %Subst( s1ActNbr : 1 : 3) : 3 : 0 );
026400180830                   wSub# = %Dec( %Subst( s1ActNbr : 4 : 3) : 3 : 0 );
026500180830                   wAcct = %Dec( %Subst( s1ActNbr : 7 : 4) : 4 : 0 );
026600180830
026700180830                   chain ( wTrst : wSub# : wAcct ) AccMst;
026800180830                   if not %Found( AccMst );
026900180830                      errAccount = *on;
027000180830                      iter;
027100180830                   EndIf;
027200180830
027300180830
027400180830                   // Load to Array
027500180830                   chain (wTrst : wSub# : wAcct ) gbs0040p;
027600180830                   if %Found( GBS0040P );
027700180830                      errAcct2 = *on;
027800180830                      iter;
027900180830                   EndIf;
028000180830
028100180830
028200180830
028300180830                   if not %Found( gbs0040p ) ;
028400180830
028500180830                      gbFulAct = wActNbr;
028600180830                      gbTrst   = wTrst;
028700180830                      gbSub    = wSub#;
028800180830                      gbAcct   = wAcct;
028900180830                      gbName   = acNam1;
029000180830
029100180830                      write r_gbs0040;
029200180830
029300180830                      s2Msg = 'Account ' + wActNbr + ' has been added.';
029400180830                      s1ActNbr = '';
029500180830
029600180830                   EndIf;
029700180830
029800180830                endif;
029900180830             endif;
030000180830          EndDo;
030100180830
030200180830
030300180830       end-proc;
030400180621
030500180830
030600180830
030700180913       // ----------------------------------------------------------------
030800180830
030900180913       dcl-proc Write_Hist;
031000180830
031100180913          dcl-s Note_Length Zoned(4);
031200180913          dcl-s wCount Zoned(5);
031300180913          dcl-s jobCount Zoned(5);
031400180913
031500180913
031600180913          Setll *Loval gbs0040p;
031700180913
031800180913          Dou %Eof(gbs0040p);
031900180913             read gbs0040p;
032000180913             if %eof(gbs0040p);
032100180913                leave;
032200180913             endif;
032300180913
032400180913
032500180913             wKey = %Editc( gbTrst : 'X' ) +
032600180913                %Editc( gbSub  : 'X' ) +
032700180913                %Editc( gbAcct : 'X' );
032800180830
032900180913             //-------------------------
033000180913             //
033100180913             // Write the Header
033200180913             //
033300180913             //-------------------------
033400180913             nhKey = wKey;
033500180913             nhCode = 'W'+ s2Code;
033600180913             nhSubj = s2Subj;
033700180913             nhaddt = %Dec(%Date);
033800180913             nhadti = %Dec(%Time);
033900180913             nhadus = wqUsrn;
034000180913
034100180913             write rDiaryhd;
034200180913
034300180913
034400180913
034500180913             //-------------------------
034600180913             //
034700180913             // Write the Detail
034800180913             //
034900180913             //-------------------------
035000180913             ndKey = nhKey;
035100180913             ndAddt = nhAddt;
035200180913             ndAdTi = nhAdTi;
035300180913
035400180913
035500180913             Note_Length = %Len( %Trim( s2Note ));
035600180913             wCount = 1;
035700180913             ndSeq# = 0;
035800180913
035900180913             dow wCount <= Note_Length;
036000180913
036100180913                ndSeq# = ndSeq# + 1;
036200180913                ndText = %SubSt( s2Note : wCount : 70 );
036300180913
036400180913                write rDiaryDt;
036500180913
036600180913                wCount = wcount + 70;
036700180913
036800180913
036900180913             EndDo;
037000180913
037100180913
037200180913             //-------------------------
037300180913             //
037400180913             // Write History Record.
037500180913             //
037600180913             //-------------------------
037700180913             hKey = wKey;
037800180913             trmFlg = '';
037900180913             TrlFlg = '';
038000180913             DtrFlg = 'N';
038100180913             hdSeq# = 0;
038200180913
038300180913             hOper = wqUsrn;
038400180913             hPrgnm = 'INQ040R';
038500180913             TrDate = %Dec( %date );
038600180913             hsTrTime = %Time;
038700180913
038800180913             hsTrst = gbTrst;
038900180913             hsSub# = gbSub;
039000180913             hsAcct = gbAcct;
039100180913
039200180913             hsDltd = 'A';
039300180913
039400180913             ck#Not = nhSubj;
039500180913
039600180913
039700180913             chain nhCode Codesl1;
039800180913             if %Found( Codesl1 ) ;
039900180913                Note2 = sDescr;
040000180913             Else;
040100180913                Note2 = '';
040200180913             EndIf;
040300180913
040400180913
040500180913             trCode = 'L81';
040600180913             //      if pMember > 0;
040700180913             //         trCode = 'M81';
040800180913             //      EndIf;
040900180913
041000180913             Write Histr;
041100180913
041200180913             jobCount = jobCount +1;
041300180830
041400180913          enddo;
041500180830
041600180913          s3Msg = 'Completed updating ' + %Char( jobCount ) + ' records.';
041700180913          exfmt msgScreen;
041800180913
041900180913
042000180913       End-Proc;
042100180830
042200180621
042300180830      *-------------------------------------------------------------------------
042400180830      *
042500180830      * Split out the account number
042600180830      *
042700180830      *-------------------------------------------------------------------------
042800180830       Dcl-Proc Split;
042900180830
043000180830          dcl-s x int(10);
043100180830          dcl-s tokens varchar(100) dim(50);
043200180830          dcl-s Trst Char(3);
043300180830          dcl-s Sub  Char(3);
043400180830          dcl-s Acct Char(4);
043500180830
043600180830          tokens(*) = #Gettok( s1ActNbr : '-' : x );
043700180830
043800180830
043900180830          // we should have 3 array elements filled  in.
044000180830          // the next blank space should be #4.
044100180830          x = %lookup( '' : tokens ) ;
044200180830          if x = 4;
044300180830             Trst = #zFill( 3 : %Trim( Tokens(1) ));
044400180830             Sub  = #zFill( 3 : %Trim( Tokens(2) ));
044500180830             Acct = #zFill( 4 : %Trim( Tokens(3) ));
044600180830
044700180830             s1ActNbr = trst + '-' + Sub + '-' + Acct;
044800180830
044900180830          EndIf;
045000180830
045100180830
045200180830       End-Proc;
045300180830
045400180830
045500180830      *-------------------------------------------------------------------------
045600180830       dcl-proc Validate;
045700180830
045800180830          hasError = *off;
045900180830
046000180830          if ListProc = *on;
046100180830
046200180830             exfmt ContScreen;
046300180830             if btnBack = *on;
046400180830                btnBack = *off;
046500180830                hasError = *on;
046600180830                Return;
046700180830             EndIf;
046800180830
046900180830             if btnCont = *on;
047000180830                btnCont = *off;
047100180830                return;
047200180830             EndIf;
047300180830
047400180830          EndIf;
047500180830
047600180830       end-proc;
