000100200727       ctl-opt option(*noDebugIo)  DftActGrp(*no);
000200200727
000300200727      *-------------------------------------------------------------------------
000400200727      *
000500200727      *  Description:
000600200727      *  Programmer.: Brian Rees
000700200727      *  Date.......: 07/27/2020
000800200727      *
000900200727      *-------------------------------------------------------------------------
001000211203      * Modification
001100211203      * 12/3/2021  B.Rees  Redesigned Screen using the Blueprint theme.
001200211203      *
001300211203      *
001400211203      *
001500211203      *-------------------------------------------------------------------------
001600200727
001700200727      *-------------------------------------------------------------------------
001800200727      *
001900200727      * Declare Files
002000200727      *
002100200727      *-------------------------------------------------------------------------
002200200731       Dcl-f Gbs0006d2 WorkStn
002300200727          Handler('PROFOUNDUI(HANDLER)')
002400200727          SFILE(LstSfl:rrn);
002500200727
002600200727       dcl-f GuarOvrdp keyed usage(*Input:*output:*update:*Delete);
002700200727       dcl-f GuarTranp keyed;
002800200727
002900200727
003000200727      *-------------------------------------------------------------------------
003100200727      *
003200200727      * Global Variables
003300200727      *
003400200727      *-------------------------------------------------------------------------
003500200727
003600200727       dcl-ds pgmd
003700200727          ExtName('IOPGMD') PSDS;
003800200727         @pgmq *proc;
003900200727       end-ds;
004000200727
004100200727
004200200727       dcl-s rrn Zoned(5);
004300200727       dcl-s reload char(1) inz('Y');
004400200727       dcl-s RcdMode Char(10);
004500200727       dcl-s hasError ind;
004600200727
004700200727
004800200727      *-------------------------------------------------------------------------
004900200727      *
005000200727      * *Entry Procedure
005100200727      *
005200200727      *-------------------------------------------------------------------------
005300200727       Dcl-pr Main ExtPgm;
005400200727         *N  Char(10);
005500200731         *N  Zoned(3);
005600200731         *N  Zoned(3);
005700200731         *N  Zoned(4);
005800200727       End-Pr;
005900200727
006000200727       dcl-pi Main;
006100200727         pUniq Char(10);
006200200731         pTrst Zoned(3);
006300200731         pSub# Zoned(3);
006400200731         pAcct Zoned(4);
006500200727       End-Pi;
006600200727
006700200727
006800200727      *-------------------------------------------------------------------------
006900200727      *
007000200727      * Mainline Program
007100200727      *
007200200727      *-------------------------------------------------------------------------
007300200727
007400200727       init();
007500200727
007600200727       Dou btnExit = *on;
007700200727
007800200727         If Reload = 'Y';
007900200727           ClearS1();
008000200727           LoadS1();
008100200727           Reload = 'N';
008200200727         endIf;
008300200727
008400200727         DisplyS1();
008500200727
008600200727
008700200727         //?Process Selections
008800200727         Select;
008900200727
009000200727         when btnAddNew = *on;
009100200727           RcdMode = 'Add';
009200200727           Chg_Data();
009300200727           Reload = 'Y';
009400200727
009500200727         other;
009600200727           ReadChangedS1();
009700200727
009800200727         EndSl;
009900200727
010000200727
010100200727       enddo;
010200200727
010300200727       *inlr = *on;
010400200727
010500200727
010600200727
010700200727       // ----------------------------------------------------------------
010800200727       dcl-proc CLEARS1;
010900200727
011000200727         //-------------------------
011100200727         //
011200200727         // Clear the Subfile
011300200727         //
011400200727         //-------------------------
011500200727
011600200727         SflClr = *on;
011700200727         Write LstCtl;
011800200727         SflClr= *off;
011900200727         rrn = 0;
012000200727
012100200727       End-Proc;
012200200727       // ----------------------------------------------------------------
012300200727       Dcl-Proc LoadS1;
012400200727
012500200727         Setll pUniq GuarOvrdp;
012600200727         Dou %eof(GuarOvrdp);
012700200727
012800200727           reade(n) pUniq GuarOvrdp;
012900200727           if %eof(GuarOvrdp);
013000200727             leave;
013100200727           endif;
013200200727
013300200727           s1Type  = goType;
013400200727           s1Check = goCheck;
013500200727           s1Comp  = goComp;
013600200727           s1Repl  = goRepl;
013700200727
013800200727           rrn = rrn + 1;
013900200727           write LstSfl;
014000200727
014100200727           If rrn >= 9999;
014200200727             leave;
014300200727           endIf;
014400200727
014500200727         enddo;
014600200727
014700200727       End-Proc;
014800200727
014900200727       // ----------------------------------------------------------------
015000200727       Dcl-Proc DisplyS1;
015100200727
015200200727         exfmt LstCtl;
015300200727
015400200727       End-Proc;
015500200727
015600200727       // ----------------------------------------------------------------
015700200727       Dcl-Proc ReadChangedS1;
015800200727
015900200727         Dou *in95 = *ON;
016000200727           READC LstSfl;
016100200727           *in95 = %EOF;
016200200727
016300200727           If *in95 = *OFF;
016400200727
016500200727
016600200727             //?Edit Job Record
016700200727             if btnEdit = *on;
016800200727               RcdMode = 'Change';
016900200727               LoadData();
017000200727               Chg_Data();
017100200727             endIf;
017200200727
017300200727
017400200727
017500200727
017600200727             //      If s1Opt  = '3' and canEdit = *on;  //Copy
017700200727             //        RcdMode = 'Add';
017800200727             //        exsr $LoadData;
017900200727             //        exsr $EditAcct;
018000200727             //      endIf;
018100200727
018200200727
018300200727
018400200727             If btnDelete = *on;
018500200731               chain (pUniq : pTrst : pSub# : pAcct :
018600200731                s1Type : s1Check) GuarOvrdp;
018700200727
018800200727               if %Found(GuarOvrdp);
018900200727                 delete Guarovrdr;
019000200727               EndIf;
019100200727
019200200727             endIf;
019300200727
019400200727
019500200727             If btnView = *on;
019600200727               RcdMode = 'View';
019700200727               LoadData();
019800200727               chg_Data();
019900200727             endIf;
020000200727
020100200727             btnEdit = *off;
020200200727             btnDelete = *off;
020300200727             btnView = *off;
020400200727             reload = 'Y';
020500200727
020600200727             update LstSfl;
020700200727
020800200727           endIf;
020900200727
021000200727         enddo;
021100200727
021200200727       End-Proc;
021300200727
021400200727
021500200727
021600200727       // ----------------------------------------------------------------
021700200727       dcl-proc Init;
021800200727
021900200731         chain (pUniq : pTrst : pSub# : pAcct) GuarTranp;
022000200727         s1GrpNam = GrpName;
022100200727         s1UniqId = %Dec(pUniq:5:0);
022200200727
022300200727       end-proc;
022400151216
022500151216       // ----------------------------------------------------------------
022600151216
022700200727       Dcl-Proc LoadData;
022800151216
022900220222         chain (pUniq : pTrst : pSub# : pAcct :
022901220222                s1Type : s1Check : s1Comp) GuarOvrdp;
023000151216
023100200727         if %Found(GuarOvrdp);
023200200727           s2Type  = goType;
023300200727           s2Check = goCheck;
023400200727           s2Comp  = goComp;
023500200727           s2Repl  = goRepl;
023600160621
023700200727           if goCrtby > *Blanks;
023800200727             s2CrtMsg = 'Created by: ' +
023900200727                %Trim(goCrtby) + ' on ' +
024000200727                %Char(%date(goCrtDt):*usa) + ' at ' +
024100200727                %Char(%Time(goCrtTm):*usa);
024200200727           endif;
024300160621
024400200727           if goChgby > *Blanks;
024500200727             s2ChgMsg = 'Changed by: ' +
024600200727                %Trim(goChgby) + ' on ' +
024700200727                %Char(%date(goChgDt):*usa) + ' at ' +
024800200727                %Char(%Time(goChgTm):*usa);
024900200727           endif;
025000160621
025100160621
025200200727         endif;
025300151216
025400200727       End-Proc;
025500151216
025600151216       // ----------------------------------------------------------------
025700151216
025800200727       dcl-proc Chg_Data;
025900151216
026000200727         dou btnExit = *on;
026100151223
026200200727           Select;
026300200727           When RcdMode = 'Change';
026400200727             exfmt EditScreen;
026500200727           When RcdMode = 'Add';
026600200727             exfmt AddScreen;
026700200727           When RcdMode = 'View';
026800200727             exfmt ViewScreen;
026900200727           endsl;
027000200727
027100200727           s2Msg = '';
027200151216
027300200727           if btnExit = *on;
027400200727             leave;
027500200727           EndIf;
027600151216
027700151216
027800200727           if btnAccept = *on;
027900200727             Validate();
028000200727             if hasError = *on;
028100200727               iter;
028200200727             EndIf;
028300151216
028400200727             //?No Error... Update Files
028500200727             if RcdMode = 'Change';
028600200727               goType  = s2Type;
028700200727               goCheck = s2Check;
028800200727               goComp  = s2Comp;
028900200727               goRepl  = s2Repl;
029000200727               goChgBy = WQUSRN;
029100200727               goChgDt = %Dec(%Date);
029200200727               goChgTm = %Dec(%Time);
029300200727               Update GuarOvrdr;
029400200727               leave;
029500200727             endif;
029600151216
029700151217
029800200727             //-----------------------------------
029900200727             //?Add Mode
030000200727             //-----------------------------------
030100200727             if RcdMode = 'Add';
030200220222
030300200727               gouniq = pUniq;
030400151216
030500220222               goTrst = pTrst;
030600220222               goSub# = pSub#;
030700220222               goAcct = pAcct;
030800200731
030900200727               goType  = s2Type;
031000200727               goCheck = s2Check;
031100200727               goComp  = s2Comp;
031200200727               goRepl  = s2Repl;
031300160621
031400200727               goCrtBy = WQUSRN;
031500200727               goCrtDt = %Dec(%Date);
031600200727               goCrtTm = %Dec(%Time);
031700160621
031800200727               goChgBy = *Blanks;
031900200727               goChgDt = 0;
032000200727               goChgTm = 0;
032100160621
032200200727               Write GuarOvrdr;
032300151216
032400200727               s2Msg = 'Type ' + %Trim(goType) + ' has been added.';
032500151223
032600200727             // Dont Leave.. Redisply the page for multiple entries
032700151223
032800200727             endif;
032900160105
033000151216
033100200727           endif;
033200200727         EndDo;
033300200727         BtnExit = *off;
033400200727         s2msg = '';
033500151216
033600200727       End-Proc;
033700151223       //------------------------------------------------------
033800200727       dcl-proc Validate;
033900151223
034000200727         hasError = *off;
034100200727         err_01 = *off;
034200151223
034300200727         //?Check to see if the record exists
034400160105
034500160105
034600200727         if RcdMode = 'Add';
034700200731           chain (pUniq : pTrst : pSub# : pAcct :
034800200731            s2Type : s2Check : s2Comp ) GuarOvrdp;
034900151223
035000200727           if %Found(GuarOvrdp);
035100200727             hasError = *on;
035200200727             err_01 = *on;
035300151223
035400200727           EndIf;
035500200727         Endif;
035600151223
035700151223
035800200727       End-Proc;
