000001200610       Ctl-opt option(*noDebugIo)   DftActGrp(*no);
000002200610
000003200610      *-------------------------------------------------------------------------
000004200610      *
000005200804      *  Description: Payroll Files - Renewal Report 90 Days
000006200610      *
000007200610      *  Programmer.: Brian Rees
000008200804      *  Date.......: 08/04/2020
000009200610      *
000010200610      *-------------------------------------------------------------------------
000011200610
000012200610      *-------------------------------------------------------------------------
000013200610      *
000014200610      * Declare Files
000015200610      *
000016200610      *-------------------------------------------------------------------------
000027200610
000028200610      *-------------------------------------------------------------------------
000029200610      *
000030200610      * Global Variables
000031200610      *
000032200610      *-------------------------------------------------------------------------
000039200610
000052200804
000053200804      *-------------------------------------------------------------------------
000054200804      *
000055200804      * *Entry Procedure
000056200804      *
000057200804      *-------------------------------------------------------------------------
000058200804       Dcl-pr Main ExtPgm;
000059201102         *N  Char(10);
000060201102         *N  Char(10);
000061200804       End-Pr;
000062200804
000063200804       dcl-pi Main;
000064201102         pKey Char(10);
000065201102         OEnrlType Char(10);
000066200804       End-Pi;
000067201102
000068200610      *-------------------------------------------------------------------------
000069200610      *
000070200610      * Mainline Program
000071200610      *
000072200610      *-------------------------------------------------------------------------
000073200610
000074201102       oEnrlType = '';
000075201102
000076201102       exec sql
000077201102         select ftEnrlTyp
000078201102           into :oEnrlType
000079201102           from GBS0030p
000080201102           where ftGroup = :pKey;
000081201102
000153201102
000154200804       *inlr = *on;
