000100181219       Ctl-opt option(*noDebugIo)   DftActGrp(*no) bnddir('GBSBIND') ;
000200181219
000300181219      *-------------------------------------------------------------------------
000400181219      *
000500181219      *  Description:
000600181219      *  Programmer.: Brian Rees
000700181219      *  Date.......: 12/19/2018
000800181219      *
000900181219      *-------------------------------------------------------------------------
001000181219
001100181219
001200181219      *-------------------------------------------------------------------------
001300181219      *
001400181219      * Declare Files
001500181219      *
001600181219      *-------------------------------------------------------------------------
001700181219       Dcl-f GBS0052D1 WorkStn
001800181219         Handler('PROFOUNDUI(HANDLER)')
001900181219         SFILE(LSTSFL:rrn);
002000181219
002100181219
002200181220       dcl-f gbs0052p keyed usage( *input : *update : *Delete );
002300181220
002400181219      *-------------------------------------------------------------------------
002500181219      *
002600181219      * Global Variables
002700181219      *
002800181219      *-------------------------------------------------------------------------
002900181219
003000181219       dcl-ds pgmd
003100181219         ExtName('IOPGMD') PSDS;
003200181219         @pgmq *proc;
003300181219       end-ds;
003400181219
003500181219       dcl-s rrn Zoned(5);
003600181219       dcl-s UserName Char(10);
003700181219       dcl-s Reload Char(1);
003800181219
003900181220       dcl-c q '''';
004000181219
004100181219
004200181219      *--------------------------------------------
004300181219      *
004400181219      * Procedures
004500181219      *
004600181219      *--------------------------------------------
004700181219      /include *LIBL/QMODSRC,PR0001RPR            // Case Functions
004800181220      /include GBSPGM/QMODSRC,#commandpr
004900181219
005000181220
005100181220
005200181219       dcl-pr GBS0052r  ExtPgm('GBS0052R');
005300181219         iUserName char(10);
005400181219         iSeq Zoned(5);
005500181219       End-Pr;
005600181220       dcl-s iSeq Zoned(5);
005700181219
005800181219
005900181220
006000181219
006100181219      *-------------------------------------------------------------------------
006200181219      *
006300181219      * Mainline Program
006400181219      *
006500181219      *-------------------------------------------------------------------------
006600181219
006700181219       init();
006800181219
006900181219
007000181219
007100181219
007200181219       Dou btnExit = *on;
007300181219
007400181219         If Reload = 'Y';
007500181219           ClearS1();
007600181219           LoadS1();
007700181219           Reload = 'N';
007800181219         endIf;
007900181219
008000181219         DisplyS1();
008100181219
008200181219
008300181219         //?Process Selections
008400181219         Select;
008500181219
008600181220         when btnAddNew = *on;
008700181220           iSeq = 0;
008800181220           GBS0052R( wqusrn : iSeq );
008900181220           reload = 'Y';
009000181219
009100181219
009200181220         When SrchChangd = *on;
009300181220           reload = 'Y';
009400181219
009500181219
009600181219         When btnReset = *on;
009700181219           Reload = 'Y';
009800181219           s1Search = *blanks;
009900181219
010000181219         other;
010100181219           ReadChangedS1();
010200181219
010300181219         EndSl;
010400181219
010500181219
010600181219       enddo;
010700181219
010800181219       *inlr = *on;
010900181219
011000181219
011100181219
011200181219       // ----------------------------------------------------------------
011300181219       dcl-proc CLEARS1;
011400181219
011500181219         //-------------------------
011600181219         //
011700181219         // Clear the Subfile
011800181219         //
011900181219         //-------------------------
012000181219
012100181219         ClrSfl = *on;
012200181219         Write Screen1;
012300181219         ClrSfl = *off;
012400181219         rrn = 0;
012500181219
012600181219       End-Proc;
012700181219       // ----------------------------------------------------------------
012800181219       Dcl-Proc LoadS1;
012900181219
013000181219         Setll UserName Gbs0052p;
013100181219         Dou %eof(Gbs0052p);
013200181219
013300181219           reade UserName Gbs0052p;
013400181219           if %eof(Gbs0052p);
013500181219             leave;
013600181219           endif;
013700181219
013800181219
013900181219           s1Seq =  amSeq;
014000181219           s1QryName = amQryName;
014100181219
014200181219           // Created Date.
014300181219           s1CrtDate = '';
014400181219           if amCrtDt > 0;
014500181219             s1CrtDate =  %Char(%date(amCrtDt:*iso) :*usa) + ' at ' +
014600181219               %Char(%Time(amCrtTm:*iso) :*usa);
014700181219           endif;
014800181219
014900181219
015000181219           // Last Run Date
015100181219           s1RunDate = '';
015200181219           if amRunDt > 0;
015300181219             s1RunDate =  %Char(%date(amRunDt:*iso) :*usa) + ' at ' +
015400181219               %Char(%Time(amRunTm:*iso) :*usa);
015500181219           endif;
015600181219
015700181219
015800181219
015900181219
016000181219           if s1Search = *blanks;
016100181219             rrn = rrn + 1;
016200181219             write LstSfl;
016300181219
016400181219           else;   //?Search Field
016500181219             if %scan( %Trim(uCase(s1Search)) : uCase(s1QryName) ) > 0;
016600181219               rrn = rrn + 1;
016700181219               write LstSfl;
016800181219             endif;
016900181219           endif;
017000181219
017100181219           If rrn >= 9999;
017200181219             leave;
017300181219           endIf;
017400181219
017500181219         enddo;
017600181219
017700181219       End-Proc;
017800181219
017900181219       // ----------------------------------------------------------------
018000181219       Dcl-Proc DisplyS1;
018100181219
018200181219         DspSfl = *on  ;
018300181219         exfmt Screen1;
018400181219         DspSfl = *off;
018500181219
018600181219       End-Proc;
018700181219
018800181219       // ----------------------------------------------------------------
018900181219       Dcl-Proc ReadChangedS1;
019000181219
019100181220         dcl-s myStmt Char(2000);
019200181220
019300181220
019400181219         Dou *in95 = *ON;
019500181219           READC LstSfl;
019600181219           *in95 = %EOF;
019700181219
019800181219           If *in95 = *OFF;
019900181219
020000181219
020100181219             //?Edit Job Record
020200181219             if btnEdit = *on;
020300181219
020400181219               iSeq = s1Seq;
020500181219               GBS0052R( UserName : iSeq );
020600181219
020700181219             endIf;
020800181219
020900181220
021000181220             //?Delete Record
021100181220             if btnDelete = *on;
021200181220
021300181220               iSeq = s1Seq;
021400181220
021500181220               chain ( UserName : iSeq ) Gbs0052P;
021600181220               if %Found( Gbs0052P) ;
021700181220                 delete r_Gbs0052;
021800181220               EndIf;
021900181220
022000181220             endIf;
022100181220
022200181220
022300181220             if btnEmail = *on;
022400181220
022500181220               iSeq = s1Seq;
022600181220               chain ( UserName : iSeq ) Gbs0052P;
022700181220               if %Found( Gbs0052P) ;
022800181220
022900181220                 myStmt = %Scanrpl('"F.ACCMST"' : '[F.ACCMST]' : SqlStmt );
023000181221                 myStmt = %Scanrpl(q : q+  q  : myStmt );
023100181221
023200181221
023300181221
023400181220                 CmdString = 'sbmjob cmd( Sql2Eml +
023500181220                   SqlStmt(' + q + %Trim( myStmt ) + q + ') ' +
023600181220                   ' toxls(Account_Report.xls)  Subj(' + q +
023700190207                   %Trim(amQryName) + q + ')'  +
023800190207                   ' SheetName(' + q + 'Sheet1' + q + '))';
023900190207
024000190207
024100181220                 #Command( CmdString : %len(%Trim(CmdString)));
024200181220
024300181220
024400181220                 amRunBy = wqusrn;
024500181220                 amRunDt = %Dec(%Date);
024600181220                 amRunTm = %Dec(%Time) ;
024700181220
024800181220
024900181220                 update r_Gbs0052;
025000181220
025100181220
025200181220                 Exfmt InfoScr;
025300181220                 btnBack = *off;
025400181220
025500181220
025600181220               EndIf;
025700181220
025800181220
025900181220             EndIf;
026000181220
026100181220
026200181220             btnEmail = *off;
026300181220             btnDelete = *off;
026400181219             btnEdit = *off;
026500181219             update LstSfl;
026600181219             Reload = 'Y';
026700181219
026800181219           endIf;
026900181219
027000181219         enddo;
027100181219
027200181219       End-Proc;
027300181219
027400181219       // ----------------------------------------------------------------
027500181219       Dcl-Proc Init;
027600181219
027700181219         UserName = WqUsrn;
027800181219         reload = 'Y';
027900181219
028000181219       End-Proc;
028100181219
