000100210128       Ctl-opt option(*noDebugIo)   DftActGrp(*no)   bnddir('GBSBIND' ) ;
000200180607
000300180607      *-------------------------------------------------------------------------
000400180607      *
000500210128      *  Description: Read the File transfer log
000600201203      *
000700180607      *
000800180607      *  Programmer.: Brian Rees
000900210128      *  Date.......: 01/28/2021
001000180607      *
001100180924      *-------------------------------------------------------------------------
001200180924      *  Change Log
001300180924      *
001400180924      *
001500180607      *-------------------------------------------------------------------------
001600201217
001700201217      *-------------------------------------------------------------------------
001800201217      *
001900201217      * Declare Files
002000201217      *
002100201217      *-------------------------------------------------------------------------
002200201217
002300210128       dcl-f Flat500p;
002400210128
002500210128       dcl-s Found Char(1) inz('N');
002600210128       dcl-s Msg Char(250) inz;
002700210128       dcl-s CmdString Char(1000);
002800210128       dcl-c q '''';
002900210128
003000210128
003100210128
003200210128      *-------------------------------------------------------------------------
003300210128      *
003400210128      * *Entry Procedure
003500210128      *
003600210128      *-------------------------------------------------------------------------
003700210128       Dcl-pr Main ExtPgm;
003800210128          *N  Char(100);
003900210128       End-Pr;
004000210128
004100210128       dcl-pi Main;
004200210128          path Char(100);
004300210128       End-Pi;
004400210128
004500210128
004600210128      *-------------------------------------------------------------------------
004700210128      *
004800210128      * Mainline Program
004900210128      *
005000210128      *-------------------------------------------------------------------------
005100210128
005200210128       Setll *End Flat500p;
005300210128
005400210128       Dou %Eof(Flat500p);
005500210128         readp   Flat500p;
005600210128         if %eof(Flat500p);
005700210128           leave;
005800210128         endif;
005900210128
006000210128         if %Scan('Transfer done': Rcd ) > 0;
006100210128           found = 'Y';
006200210128         EndIf;
006300210128
006400210128         if %Scan('Upload of file': Rcd ) > 0 and
006500210128            %Scan('was successful': Rcd ) > 0;
006600210128           found = 'Y';
006700210128         EndIf;
006800210128
006900210128         if %Scan('Password Expired': Rcd ) > 0;
007000210128           Msg = 'Password Expired: ' + %Trim( Path ) ;
007100210128           found = 'Y';
007200210128         EndIf;
007300210128
007400210128
007500210128       Enddo;
007600210128
007700210128
007800210128       if found = 'N';
007900210128
008000210128         Msg = 'Transfer Dnoe message not found: ' +
008100210128          %Trim( Path ) ;
008200210128
008300210128       EndIf;
008400210128
008500210128
008600210128       if msg > '';
008700210128
008800220518       CmdString = 'MailTool toAddr( payrolledi@Amwins.com ) ' +
008900210128          ' Subject(' + q + 'FTP Log Error'  + q + ') ' +
009000210128          ' Message(' + q + %Trim( Msg ) + q + ')' +
009100210128          ' BdyCt(' + q + 'text/html; charset=utf-8' + q + ')';
009200210128
009300210128       endif;
009400210128
009500210128
009600210128       *inlr = *on;
009700210128
