000100161109     H option(*noDebugIo)  bnddir('GBSBIND')  DftActGrp(*no)
000200161109    ? *-------------------------------------------------------------------------
000300161109    ? *
000400170329    ? *  Description:
000500170329    ? *  Programmer.: Brian Rees
000600170329    ? *  Date.......: 08/31/2016
000700161109    ? *
000800161109    ? *-------------------------------------------------------------------------
000900170713    ?Fgbs0018d  CF   E             WORKSTN
001000161109     F                                     HANDLER('PROFOUNDUI(HANDLER)')
001100161109    ?F                                     SFILE(LSTSFL:rrn)
001200161109
001300170713
001400161109    ? *-------------------------------------------------------------------------
001500161109    ? * Program status data structure
001600161109    ?D PGMD          ESDS                  EXTNAME(IOPGMD)
001700161109     D  @pgmq            *proc
001800161109
001900161109
002000170329
002100161109     d Rrn             s              5s 0 inz
002200161109     d ReLoad          s              1
002300161118
002400170713     D MyStat          s                   like(statds)
002500170713     D DirPtr          s               *
002600170713     D ErrorNbr        s             10i 0 based(MyErrnoPtr)
002700170713     D ErrorNbrSave    s             10i 0
002800170713     D Wait            s              1
002900170713     D ErrorMsg        s             50
003000170713     D DirName         s            250
003100170713     D NameText        s            250
003200170713     D s1TS            s               z
003300170713
003400161111      *--------------------------------------------
003500161111      *?Procedures
003600161111      *--------------------------------------------
003700170713     D/Include GBSPGM/QModSRc,IFSAPI_H
003800161118
003900161110
004000161111
004100161118
004200161118
004300161117      *-------------------------------------------------------------------------
004400161109      *?Mainline Program
004500161117      *-------------------------------------------------------------------------
004600161117
004700161109
004800161109       Dou btnExit = *on;
004900161109
005000161109          If Reload = 'Y';
005100161109             exsr CLEAR;
005200161109             exsr LOAD;
005300161109             Reload = 'N';
005400161109          endIf;
005500161109
005600161109          exsr DISPLY;
005700161109
005800161109
005900161109          //?Process Selections
006000161109          Select;
006100161109
006200170713          When btnSearch = *on;
006300170713             Exsr FileSrch;
006400170713             Reload = 'Y';
006500161109
006600161109          other;
006700161109             exsr ReadChanged;
006800161109
006900161109          EndSl;
007000161109
007100161109
007200161109       enddo;
007300161109
007400161109       *inlr = *on;
007500161109
007600161110       // ----------------------------------------------------------------
007700161109       Begsr *Inzsr;
007800161109
007900161110          Reload = 'Y';
008000161109
008100161109
008200161109       Endsr;
008300161109       // ----------------------------------------------------------------
008400161109       Begsr CLEAR;
008500161109
008600161110          //?Clear the Subfile
008700161110          ClrSfl = *on;
008800161110          Write Screen1;
008900161110          ClrSfl = *off;
009000161110          rrn = 0;
009100161109
009200161109       Endsr;
009300161109       // ----------------------------------------------------------------
009400161110       Begsr Load;
009500161117
009600170713          // User Name = wqusrn
009700161118
009800170713          //-------------------------------
009900170713          //?Open Directory
010000170713          //-------------------------------
010100170713          DirName = '/epdf/USERSPDF/' + wqusrn;
010200170713       // DirName = '/epdf/USERSPDF/DLK';
010300170713
010400170713          DirPtr = OpenDir( %Trimr(DirName));
010500170713          if DirPtr = *NULL;
010600170713             // Failure on Opening Directory.
010700170713          endif;
010800170713
010900170713
011000170713          //-------------------------------
011100170713          //?Read the Directory Entries
011200170713          //-------------------------------
011300170713          DirEntryPtr = ReadDir(DirPtr);
011400170713          dow DirEntryPtr <> *NULL;
011500170713
011600170713             if NameLen > %Size(NameText);
011700170713                NameText = %Subst(Name : 1: %Size(NameText));
011800170713             else;
011900170713                NameText = %Subst(Name : 1: NameLen);
012000170713             endif;
012100170713
012200170713             if %Subst(NameText:1:1) <> '.';
012300170713                s1fname = NameText;
012400170713                s1FulName = %Trim(DirName) + '/' + NameText;
012500170713
012600170713
012700170713                //?Get Size and Date
012800170713                stat(%Trimr(s1FulName):%Addr(mystat));
012900170713                p_statds = %addr(mystat);
013000170713
013100170713
013200170713                //?Get Created Date/Time
013300170713                s1TS = Unix2Rpg(st_ctime) ;
013400170713                s1Date = %Char(%Date(s1Ts));
013500170713                s1Time = %Char(%Time(s1Ts));
013600170713
013700170713
013800170713                //?Get Last Accessed Date/Time
013900170713                s1TS = Unix2Rpg(st_atime) ;
014000170713                s1aDate = %Char(%Date(s1Ts));
014100170713                s1aTime = %Char(%Time(s1Ts));
014200170713
014300170713
014400170713                rrn = rrn + 1;
014500170713                write LstSfl;
014600170713             endif;
014700170713
014800170713             DirEntryPtr = ReadDir(DirPtr);
014900170713          Enddo;
015000170713
015100170713          CloseDir(DirPtr);
015200161109
015300161110       Endsr;
015400161109
015500161109       // ----------------------------------------------------------------
015600161109       Begsr DISPLY;
015700161109
015800161110          DspSfl = *on  ;
015900161110          exfmt Screen1;
016000161110          DspSfl = *off;
016100161109
016200161109       Endsr;
016300161109       // ----------------------------------------------------------------
016400161109       Begsr ReadChanged;
016500161109
016600161109          Dou *in95 = *ON;
016700161109             READC LstSfl;
016800161109             *in95 = %EOF;
016900161109
017000161109             If *in95 = *OFF;
017100161109                update LstSfl;
017200161109                Reload = 'Y';
017300161109             endIf;
017400161109
017500161109
017600161109          enddo;
017700161109       Endsr;
017800161109
017900161109
018000161109       //-----------------------------------------------------------------
018100161109       //?                       ADD Screen
018200161109       //-----------------------------------------------------------------
018300170713       Begsr FileSrch;
018400161109
018500170713          dou btnCancel = *on;
018600170713             Exfmt SearchScr;
018700170713
018800170713             if hasError = 'Y';
018900170713                Exfmt ErrorScr;
019000170713             else;
019100170713                leave;
019200170713             endif;
019300170713
019400170713
019500170713          enddo;
019600170713
019700161109
019800161109       Endsr;
019900161118
020000161118
020100170713     D/Include GBSPGM/QModSRc,IFSAPI_P
