000100161109     H option(*noDebugIo)  bnddir('GBSBIND')  DftActGrp(*no)
000200181005      *-------------------------------------------------------------------------
000300181005      *
000400181005      *  Description:  Generate Benefit Summary PDFs
000500181005      *  Programmer.:  Brian Rees
000600181005      *  Date.......:  10/05/2018
000700181005      *
000800181005      *-------------------------------------------------------------------------
000900181005
001000181005       dcl-f GBS0047D WorkStn
001100181213         HANDLER('PROFOUNDUI(HANDLER)') ;
001200181005
001300181005       Dcl-f AccMst keyed ExtDesc('F.ACCMST') ExtFile(*extdesc);
001400181005
001500181005
001600181005      *-------------------------------------------------------------------------
001700161109
001800181005       Dcl-c q const ('''');
001900181005       dcl-c dq Const ('"');
002000181005       dcl-c digits  '0123456789';
002100181005
002200181005       dcl-s wTrst    Zoned(3);
002300181005       dcl-s wSub#    Zoned(3);
002400181005       dcl-s wAcct    Zoned(4);
002500181005
002600181005
002700161111      *--------------------------------------------
002800181005      *
002900181005      * Procedures
003000181005      *
003100161111      *--------------------------------------------
003200181005       /include GBSPGM/QMODSRC,#GettokPR
003300181005       /include GBSPGM/QMODSRC,#zFillpr
003400181005
003500181213
003600181213       dcl-pr BenSumC ExtPgm('BENSUMC');
003700181213         oTrst Char(3);
003800181213         oSub  Char(3);
003900181213         oAcct Char(4);
004000181213         oType Char(4);
004100181213       End-Pr;
004200181213
004300181213       dcl-s oTrst Char(3);
004400181213       dcl-s oSub# Char(3);
004500181213       dcl-s oAcct Char(4);
004600181213       dcl-s oType Char(4);
004700181213
004800181213
004900170628
005000181005      *-------------------------------------------------------------------------
005100181005      *
005200181005      * Mainline Program
005300181005      *
005400181005      *-------------------------------------------------------------------------
005500161111
005600161111
005700181213       Dou btnExit = *on;
005800181005
005900181213         exfmt Screen1;
006000181005
006100181213         if btnExit = *on;
006200181213           leave;
006300181213         endif;
006400181005
006500181005
006600181213         //----------------------------------------------
006700181213         //
006800181213         // Add Update.
006900181213         //
007000181213         //----------------------------------------------
007100181213         if btnAccept = *on;
007200181005
007300181213           ErrAccount = *off;
007400181213           errAcct2 = *off;
007500181008
007600181008
007700181213           //---------------------
007800181213           // Validate Data
007900181213           //---------------------
008000181008
008100181213           if ActChgd = *on;
008200181213             newAcct();
008300181213           endif;
008400181005
008500181213           if %check( digits : %Trim( s1ActNbr )) = 0  and
008600181213             %Len(%Trim( s1ActNbr )) = 10;
008700181213             wTrst = %Dec( %Subst( s1ActNbr : 1 : 3) : 3 : 0 );
008800181213             wSub# = %Dec( %Subst( s1ActNbr : 4 : 3) : 3 : 0 );
008900181213             wAcct = %Dec( %Subst( s1ActNbr : 7 : 4) : 4 : 0 );
009000181005
009100181213             chain ( wTrst : wSub# : wAcct ) AccMst;
009200181213             if not %Found( AccMst );
009300181213               ErrAccount = *on;
009400181213             endif;
009500181005
009600181213           else;
009700181213             errAccount = *on;
009800181213           endif;
009900181005
010000181008
010100181008
010200181008
010300181213           // Error: Retry.
010400181213           if errAccount = *on;
010500181213             iter;
010600181213           EndIf;
010700181005
010800181213
010900181213           //-----------------------------
011000181213           //
011100181213           // No Error - Process
011200181213           //
011300181213           //-----------------------------
011400181213           s2ActName = acNam1;
011500181213
011600181213           oTrst = %subst(s1ActNbr:1:3);
011700181213           oSub# = %subst(s1ActNbr:4:3);
011800181213           oAcct = %subst(s1ActNbr:7:4);
011900181213
012000181213           s2Acct =  oTrst + '-' + oSub# + '-' + oAcct;
012100181213
012200181213
012300181213           if s2Type = 'O';
012400181213             s2EnrlType = 'Open Enrollment';
012500181213             oType = 'OPEN';
012600181213           else;
012700181213             s2EnrlType = 'Current Coverages';
012800181213             oType = 'CURR';
012900181213           endif;
013000181213
013100181213           exfmt ConFirm;
013200181213
013300181213
013400181213           // If the user presses Process.. Generate the PDF's
013500181213           if btnAccept = *on;
013600181213             BenSumC( oTrst : oSub# : oAcct : oType );
013700181213             clear Screen1;
013800181213           EndIf;
013900181213
014000181213
014100181213         endif;
014200181005
014300181213       Enddo;
014400181005
014500181213       *inlr = *on;
014600181005
014700181005
014800181005
014900181005       // ----------------------------------------------------------------
015000181005       dcl-proc NewAcct;
015100181005
015200181213         dcl-s wActNbr like(s1ActNbr);
015300181005
015400181213         // For the people who press "Field+"
015500181213         s1ActNbr = %ScanRpl( '+' : '-' : s1ActNbr );
015600181005
015700181005
015800181213         split();
015900181213         wActNbr = s1ActNbr;
016000181005
016100181213         s1ActNbr = %ScanRpl( '-' : '' : s1ActNbr );
016200181213         s1ActNbr = %ScanRpl( ' ' : '' : s1ActNbr );
016300181005
016400181005
016500181005       End-Proc;
016600181005
016700181005      *-------------------------------------------------------------------------
016800181005      *
016900181005      * Split out the account number
017000181005      *
017100181005      *-------------------------------------------------------------------------
017200181005       Dcl-Proc Split;
017300181005
017400181213         dcl-s x int(10);
017500181213         dcl-s tokens varchar(100) dim(50);
017600181213         dcl-s Trst Char(3);
017700181213         dcl-s Sub  Char(3);
017800181213         dcl-s Acct Char(4);
017900181005
018000181213         tokens(*) = #Gettok( s1ActNbr : '-' : x );
018100181005
018200181005
018300181213         // we should have 3 array elements filled  in.
018400181213         // the next blank space should be #4.
018500181213         x = %lookup( '' : tokens ) ;
018600181213         if x = 4;
018700181213           Trst = #zFill( 3 : %Trim( Tokens(1) ));
018800181213           Sub  = #zFill( 3 : %Trim( Tokens(2) ));
018900181213           Acct = #zFill( 4 : %Trim( Tokens(3) ));
019000181005
019100181213           s1ActNbr = trst + '-' + Sub + '-' + Acct;
019200181005
019300181213         EndIf;
019400181005
019500181005
019600181005       End-Proc;
019700181005
