000100160708     H option(*noDebugIo) DftActGrp(*no)
000200160708    ? *-------------------------------------------------------------------------
000300160708    ? *
000400170322    ? *  Description: Employee Update / Audit
000500160708      *
000600170322    ? *  Programmer.: Brian Rees
000700170322    ? *  Date.......: 07/08/2016
000800160708    ? *
000900160708    ? *
001000160708    ? *-------------------------------------------------------------------------
001100170310    ?FGbs0016D  CF   E             WORKSTN
001200160926     F                                     HANDLER('PROFOUNDUI(HANDLER)')
001300160926     F                                     SFILE(LSTSFL:rrn)
001400160926
001500170310     FGBS0016P  if   e           k disk
001600160708    ? *-------------------------------------------------------------------------
001700160708
001800160708     D pgmsts         sDS
001900160708     D  Parms                         3s 0 Overlay( PgmSts: 37 )
002000160708     D  Jobname                      10    Overlay( PgmSts: 244 )
002100160708     D  Jobnum                        6s 0 Overlay( PgmSts: 264 )
002200160708     D CurrentUser                   10    Overlay( PgmSts: 358 )
002300160708
002400160926     D UploadFile      DS                  Qualified
002500160926     D  NumFiles                      3S 0
002600160926     D  Directory                   256A
002700160926     D  Files                       256A
002800160926
002900160926
003000160711     d hasError        s               n   inz
003100160926     d errTrst         s               n   inz
003200160926     d errSub          s               n   inz
003300160926     d errAcct         s               n   inz
003400160926     d errFile         s               n   inz
003500160926
003600160926     d Rrn             s              5s 0 inz
003700160926     d Reload          s              1    inz
003800160926
003900170310     d GBS0016R1       pr                  ExtPgm('GBS0016R1')
004000161010     d   Trust                        3  0
004100161010     d   Sub                          3  0
004200161010     d   Acct                         4  0
004300170313     d   Catg                        20
004400170316     d   pHeader                      1
004500170816     d   pData                        1
004600170816     d  pData          s              1    inz
004700170316     d  pHeader        s              1    inz
004800161010
004900161010
005000160926    ? *-------------------------------------------------------------------------
005100170310      *?Mainline Program
005200160926      *-------------------------------------------------------------------------
005300160926     C     *entry        plist
005400160926     C                   parm                    pContinue         1
005500160926     C                   parm                    pTrust            3 0
005600160926     C                   parm                    pSub              3 0
005700160926     C                   parm                    pAcct             4 0
005800170313     C                   parm                    oCatg            20
005900160926
006000170310      /Free
006100160708
006200160708          Dou btnExit = *on;
006300160926             Exfmt Screen1;
006400160922
006500160926             if btnExit = *on;
006600161020                pContinue = 'N';
006700160926                leave;
006800160926             endif;
006900160926
007000160926             //?Check for Errors
007100160926             exsr Validate;
007200161004             pContinue = *blanks;
007300161004
007400160926             if hasError = *on;
007500160926                pContinue = 'N';
007600160926                iter;
007700160926             endif;
007800160922
007900170816             if pData = 'Y';
008000170816                pContinue = 'Y';
008100170816                Cont_Vis = *on;
008200170816             exsr ErrorWindow;
008300170816             if btnClose = *on;
008400170816                iter;
008500170816             endif;
008600170816       //       iter;
008700170316             endif;
008800170316
008900170816             if pHeader = 'Y';
009000160926                exsr ErrorWindow;
009100160926                pContinue = 'N';
009200160926                iter;
009300160926             endif;
009400160926
009500161010             //?No Errors? Show Window... Leave
009600161103
009700160926             pTrust = s1Trst;
009800160926             pSub = s1Sub;
009900160926             pAcct = s1Acct;
010000170313             oCatg = chkName + chkAddr + chkEmail + chkSalary + chkJobt;
010100170313
010200160926             pContinue = 'Y';
010300160926
010400160926             leave;
010500160922          enddo;
010600160922
010700160926
010800160922       *inlr = *on;
010900160926      *-------------------------------------------------------------------------
011000160926       Begsr Validate;
011100160926
011200160926          hasError = *off;
011300160926
011400160926          errTrst = *off;
011500160926          errSub  = *off;
011600160926          errAcct = *off;
011700160926          errFile = *off;
011800170316          Cont_Vis = *off;
011900160926
012000160926          //?Trust Number.
012100160926          if s1Trst = *Zero;
012200160926             hasError = *on;
012300160926             errTrst = *on;
012400160926          endif;
012500160926
012600160926          //?Sub Account Number.
012700160926          if s1Sub = *Zero;
012800160926             hasError = *on;
012900160926             errSub = *on;
013000160926          endif;
013100160926
013200160926          //?Account Number.
013300160926          if s1Acct = *Zero;
013400160926             hasError = *on;
013500160926             errAcct = *on;
013600160926          endif;
013700160926
013800170313
013900160926          if uploadFile.Files = *Blanks;
014000160926             hasError = *on;
014100160926             errFile = *on;
014200160926          else;
014300170313             oCatg = chkName + chkAddr + chkEmail + chkSalary + chkJobt;
014400170816             gbs0016r1( s1Trst : s1Sub : s1Acct : oCatg : pHeader : pData );
014500160926          endif;
014600160926
014700160926       Endsr;
014800160926      *-------------------------------------------------------------------------
014900160926       Begsr ErrorWindow;
015000160926
015100161103          btnClose = *off;
015200161103          btnCont = *off;
015300160926          Reload = 'Y';
015400161103
015500161103          dou btnClose = *on or btnCont = *on;
015600160926
015700160926             if Reload = 'Y';
015800160926                exsr ClearS2;
015900160926                exsr LoadS2;
016000160926                Reload = 'N';
016100160926             endif;
016200160926
016300160926             exsr DisplyS2;
016400160926
016500160926
016600160926          enddo;
016700160926
016800160926       Endsr;
016900160926
017000160926      *-------------------------------------------------------------------------
017100160926       Begsr ClearS2;
017200160926
017300160926          // Clear the Subfile
017400160926          SflClr = *on;
017500160926          Write LstCtl;
017600160926          SflClr = *off;
017700160926
017800160926          rrn = 0;
017900160926
018000160926       Endsr;
018100160926      *-------------------------------------------------------------------------
018200160926       Begsr DisplyS2;
018300160926
018400160926          SflDsp = *on  ;
018500160926          exfmt  LstCtl ;
018600160926          SflDsp = *off;
018700160926
018800160926       Endsr;
018900160926      *-------------------------------------------------------------------------
019000160926       Begsr LoadS2;
019100160926
019200161110
019300170310          setll *loval gbs0016p;
019400160926
019500170310          dou %Eof(gbs0016p);
019600170310             read gbs0016p;
019700160926
019800170310             if %eof(gbs0016p);
019900160926                leave;
020000160926             endif;
020100160926
020200160926             s1ErrMsg = ErrMsg;
020300160926
020400160926             rrn = rrn + 1;
020500160926             write LstSfl;
020600160926
020700160926             If rrn >= 9999;
020800160926                leave;
020900160926             endIf;
021000160926
021100160926          enddo;
021200160926
021300160926       Endsr;
021400160926
021500160926
