000100161109     H option(*noDebugIo)  bnddir('GBSBIND')  DftActGrp(*no)
000200161109    ? *-------------------------------------------------------------------------
000300161109    ? *
000400170329    ? *  Description:
000500170329    ? *  Programmer.: Brian Rees
000600170329    ? *  Date.......: 08/31/2016
000700161109    ? *
000800161109    ? *-------------------------------------------------------------------------
000900161109
001000170713
001100161109    ? *-------------------------------------------------------------------------
001200161109
001300161118
001400170809     D MyStat          s                   like(statds)
001500170809     D DirPtr          s               *
001600170809     D DirName         s            250
001700170809     D NameText        s            250
001800170809     D FullName        s            250
001900170809     d myCount         S              8s 0
002000170809     d oCount          S             10
002100170809
002200161111      *--------------------------------------------
002300161111      *?Procedures
002400161111      *--------------------------------------------
002500170713     D/Include GBSPGM/QModSRc,IFSAPI_H
002600161118
002700161118
002800161117      *-------------------------------------------------------------------------
002900161109      *?Mainline Program
003000161117      *-------------------------------------------------------------------------
003100170809     C     *entry        plist
003200170809     C                   parm                    oCount           10
003300161117
003400161118
003500170809          oCount = *Blanks;
003600170809
003700170713          //-------------------------------
003800170713          //?Open Directory
003900170713          //-------------------------------
004000170809          DirName = '/rpg_word/letters';
004100170809          DirPtr = OpenDir( %Trimr(DirName));
004200170809
004300170713          if DirPtr = *NULL;
004400170713             // Failure on Opening Directory.
004500170713          endif;
004600170713
004700170713
004800170713          //-------------------------------
004900170713          //?Read the Directory Entries
005000170713          //-------------------------------
005100170713          DirEntryPtr = ReadDir(DirPtr);
005200170713          dow DirEntryPtr <> *NULL;
005300170713
005400170809             NameText = %Subst(Name : 1: NameLen);
005500170809             FullName = %Trim(DirName) + '/' + NameText;
005600170809             stat(%Trimr(FullName):%Addr(mystat));
005700170809             p_statds = %addr(mystat);
005800170713
005900170809             if %Subst(st_ObjType:1:5) = '*STMF';
006000170809                myCount = myCount + 1;
006100170809             endif;
006200170809
006300170713
006400170713
006500170713             DirEntryPtr = ReadDir(DirPtr);
006600170713          Enddo;
006700170713
006800170713          CloseDir(DirPtr);
006900161109
007000170809          if myCount > 0;
007100170809             oCount = %Editc( myCount : 'J');
007200170809          endif;
007300170809       *inlr = *on;
007400161118
007500161118
007600170713     D/Include GBSPGM/QModSRc,IFSAPI_P
