000100180718       Ctl-opt option(*noDebugIo)   DftActGrp(*no);
000200180718
000300180718      *-------------------------------------------------------------------------
000400180718      *
000500180724      *  Description: View Raw Data - Main Driver Program
000600180718      *  Programmer.: Brian Rees
000700180718      *  Date.......: 07/18/2018
000800180723      *
000900180723      *
001000180718      *-------------------------------------------------------------------------
001100180718
001200180718      *-------------------------------------------------------------------------
001300180718      *
001400180718      * Declare Files
001500180718      *
001600180718      *-------------------------------------------------------------------------
001700180718       Dcl-f GBS0038d WorkStn
001800180718          Handler('PROFOUNDUI(HANDLER)');
001900180718
002000180718
002100180718
002200180718
002300180718
002400180718      *-------------------------------------------------------------------------
002500180718      *
002600180718      * Global Variables
002700180718      *
002800180718      *-------------------------------------------------------------------------
002900180718       dcl-ds uploadFile Qualified;
003000180718          numFiles Zoned(3);
003100180718          Directory Char(256);
003200180718          Files Char(256);
003300180718       End-Ds;
003400180718
003500180718       dcl-s hasError ind;
003600180718
003700180724       dcl-pr GBS_FORMAT ExtPgm('GBS0038C1');
003800180724          *N Char(40) ;
003900180724       End-Pr;
004000180724
004100180724       dcl-pr SF_FORMAT  ExtPgm('GBS0038C2') ;
004200180724          *n Char(40);
004300180724       End-Pr;
004400180724
004500180724       dcl-pr ADP_FORMAT ExtPgm('GBS0038C3') ;
004600180724          *n Char(40);
004700180724       End-Pr;
004800180719
004900180719
005000180718
005100180719      *-------------------------------------------------------------------------
005200180719      *
005300180719      * *Entry Procedure
005400180719      *
005500180719      *-------------------------------------------------------------------------
005600180719       Dcl-pr Main ExtPgm;
005700180719          *N  Char(10);
005800180719          *N  Char(40);
005900180719       End-Pr;
006000180719
006100180719       dcl-pi Main;
006200180719          pFileType Char(10);
006300180719          pName     Char(40);
006400180719       End-Pi;
006500180719
006600180719
006700180719
006800180718      *-------------------------------------------------------------------------
006900180718      *
007000180718      * Mainline Program
007100180718      *
007200180718      *-------------------------------------------------------------------------
007300180724       s1FileType = pFileType;
007400180724       if pFileType = 'GBS-FI';
007500180724          s1FileType = 'GBS Format - Fully Insurred';
007600180724       EndIf;
007700180719
007800180724       if pFileType = 'GBS-Sf';
007900180724          s1FileType = 'GBS Format - Self Funded';
008000180724       EndIf;
008100180719
008200180724       if pFileType = 'ADP';
008300180724          s1FileType = 'ADP Format';
008400180724       EndIf;
008500180718
008600180719
008700180719
008800180719
008900180724       Dou btnExit = *on;
009000180724          Exfmt Screen1;
009100180718
009200180724          if btnExit = *on;
009300180724             leave;
009400180724          endif;
009500180718
009600180718
009700180724          Validate();
009800180724          if hasError = *on;
009900180724             iter;
010000180724          EndIf;
010100180718
010200180724          if btnAccept = *on;
010300180718
010400180724             if pFileType = 'GBS-FI';
010500180724                GBS_Format(pName);
010600180724             endif;
010700180723
010800180724             if pFileType = 'GBS-SF';
010900180724                SF_Format(pName);
011000180724             endif;
011100180723
011200180724             if pFileType = 'ADP';
011300180724                ADP_Format(pName);
011400180724             endif;
011500180723
011600180724          EndIf;
011700180718
011800180724       enddo;
011900180718
012000180718
012100180718       *inlr = *on;
012200180718
012300180718       // ----------------------------------------------------------------
012400180718       dcl-proc validate;
012500180718
012600180724          hasError = *off;
012700180724          errFile = *off;
012800180718
012900180718
013000180724          if uploadFile.Files = '';
013100180724             hasError = *on;
013200180724             errFile = *on;
013300180724          EndIf;
013400180718
013500180718
013600180718       end-proc;
013700180718
