000100180103
000200180103       Ctl-Opt Option(*noDebugIo)  bnddir('GBSBIND')  DftActGrp(*no);
000300180103
000400000000      *-------------------------------------------------------------------------
000500000000      *
000600170526      *  Description: Dashboard Status
000700170526      *  Programmer.: B.Rees
000800170526      *  Date.......: 05/26/2017
000900000000      *
001000000000      *-------------------------------------------------------------------------
001100180103
001200180103      *-------------------------------------------------------------------------
001300180103      *
001400180103      * Declare Files
001500180103      *
001600180103      *-------------------------------------------------------------------------
001700180103       Dcl-f GBS0031D WorkStn
001800180103          HANDLER('PROFOUNDUI(HANDLER)')
001900180103          SFILE(LSTSFL:rrn);
002000180103
002100180103       Dcl-f AccOspl2 keyed;
002200180103
002300180103       dcl-f AccMst keyed
002400180103          ExtDesc('F.ACCMST') ExtFile(*extdesc)  ;
002500180103
002600180103       dcl-f CMCT14 keyed
002700180103          ExtDesc('F.CMCT14') ExtFile(*extdesc)  ;
002800180103
002900180103       dcl-f PlnMst keyed
003000180103          ExtDesc('F.PLNMST') ExtFile(*extdesc)  ;
003100180103
003200180103       dcl-f CODESL1 keyed
003300180103          ExtDesc('F.CODESL1') ExtFile(*extdesc)  ;
003400180103
003500180103       dcl-f aoecod keyed;
003600180103
003700180104
003800180104       dcl-f CarMst keyed
003900180104          ExtDesc('F.CARMST') ExtFile(*extdesc)  ;
004000180103
004100180103
004200180103
004300180103      *-------------------------------------------------------------------------
004400180103      *
004500180103      * Global Variables
004600180103      *
004700180103      *-------------------------------------------------------------------------
004800180103       dcl-s rrn zoned(5) inz;
004900180103       dcl-s reLoad Char(1);
005000180103       dcl-s SavFullAcct Char(10);
005100180103
005200180103       dcl-s DescArray Char(10) Dim(100);
005300180103       dcl-s i Zoned(5) inz;
005400180103       dcl-s j Zoned(5) inz;
005500180103       dcl-s Pos Zoned(5) inz;
005600180104
005700180103
005800180103      *-------------------------------------------------------------------------
005900180103      *
006000180103      * Procedures
006100180103      *
006200180103      *-------------------------------------------------------------------------
006300180103       Dcl-pr CommCtrl ExtPgm('INQ009C');
006400180103          oTrst Zoned(3);
006500180103          oSub# Zoned(3);
006600180103          oAcct Zoned(4);
006700180103       End-Pr;
006800180103
006900180103       dcl-s oTrst Zoned(3);
007000180103       dcl-s oSub# Zoned(3);
007100180103       dcl-s oAcct Zoned(4);
007200180103
007300180103
007400000000      *-------------------------------------------------------------------------
007500180103      *
007600000000      * Mainline Program
007700180103      *
007800000000      *-------------------------------------------------------------------------
007900000000
008000180103       reload = 'Y';
008100180103
008200180103
008300180103       Dou btnExit = *on;
008400000000
008500180103          If  Reload = 'Y';
008600180103             CLEARS1();
008700180103             LOAD();
008800180103             Reload = 'N';
008900180103          endIf;
009000000000
009100180103          DISPLY();
009200000000
009300180629          if btnSearch = *on;
009400180629             btnSearch = *off;
009500180629             Reload = 'Y';
009600180629             iter;
009700180629          endif;
009800180629
009900180629
010000180103          ReadChanged();
010100180103
010200000000       enddo;
010300000000
010400000000       *inlr = *on;
010500000000
010600000000       // ----------------------------------------------------------------
010700180103       dcl-Proc ClearS1;
010800000000
010900180103          // Clear the Subfile
011000180103          ClrSfl = *on;
011100180103          Write Screen1;
011200180103          ClrSfl = *off;
011300180103
011400180103          rrn = 0;
011500000000
011600180103       End-proc;
011700180103       // ----------------------------------------------------------------
011800000000
011900180103       dcl-Proc Load;
012000000000
012100000000
012200180103          Setll (*loval) ACCOSPL2;
012300180103          dou %eof(ACCOSPL2);
012400180103             read ACCOSPL2;
012500000000
012600180103             if %eof(ACCOSPL2);
012700180103                leave;
012800180103             endif;
012900000000
013000180103             chain aocode aoecod;
013100180103
013200180103
013300180103
013400180103             s1Trst = aoTrst;
013500180103             s1Sub# = aoSub#;
013600180103             s1Acct = aoAcct;
013700180103
013800180103
013900180103             s1AcctFmt = %editc(aoTrst : 'X') + '-' +
014000180103                %editc(aoSub# : 'X') + '-' +
014100180103                %editc(aoAcct : 'X') ;
014200170526
014300180103
014400180103             s1FullAcct= %editc(aoTrst : 'X') +
014500180103                %editc(aoSub# : 'X') +
014600180103                %editc(aoAcct : 'X') ;
014700170822
014800180103             if s1FullAcct = savFullAcct;
014900180103                iter;
015000180103             endif;
015100180103             SavFullAcct = s1FullAcct;
015200170908
015300170908
015400180103             chain (aoTrst : aoSub# : aoacct) AccMst;
015500180103             if %Found(AccMst);
015600180103                s1ActNam = AcNam1;
015700180103
015800180103                if acdltd = 'C';
015900180103                   iter;
016000180103                EndIf;
016100180103             endif;
016200170526
016300180103
016400180103             // Get the Plan Types & Load the Array
016500180103             Clear DescArray;
016600180104             s1Aetna = '';
016700180103
016800180103             setll ( aoTrst : aoSub# : aoAcct ) CMCT14;
016900180103             dou %eof( CMCT14 );
017000180103                reade ( aoTrst : aoSub# : aoAcct ) CMCT14;
017100180103
017200180103                if %eof(CMCT14 );
017300180103                   leave;
017400180103                EndIf;
017500180103
017600180103                if  cmCan > 0 and cmCan < %Dec(%Date);
017700180103                   iter;
017800180103                EndIf;
017900180103
018000180103                chain (aoTrst : aoSub# : cmPlan ) PlnMst;
018100180103                chain plnCat Codesl1;
018200180104                Chain pCarr CarMst;
018300180104                if cGrpCd = 'AH' or cGrpCd = 'S1';
018400180104                   s1Aetna = 'Y';
018500180104                EndIf;
018600180103
018700180104
018800180103                Pos = %Lookup( sDescr : DescArray );
018900180103                if pos = 0;
019000180103                   i = i + 1;
019100180103                   DescArray(i) = sDescr;
019200180103                EndIf;
019300180103
019400180104             enddo;
019500180103
019600180104             // Sort the Array
019700180104             if i > 0;
019800180104                SortA(A) %Subarr( DescArray : 1 : i) ;
019900180104             endif;
020000180103
020100180104
020200180103             // Read the Array
020300180103             s1Plan1 = '';
020400180103
020500180103             for j = 1 to i;
020600180104                if j = 1;
020700180104                   s1Plan1 = DescArray(j) ;
020800180104                else;
020900180104                   s1Plan1 = %Trim(s1Plan1) + '   ' + DescArray(j) ;
021000180104                endif;
021100180103
021200180103             EndFor;
021300180103
021400180629             if SearchDta = '';
021500180629                rrn = rrn + 1;
021600180629                write LstSfl;
021700180629             endif;
021800180629
021900180629             if SearchDta > '';
022000180629                if %Scan( %Trim( SearchDta ) : s1Plan1 ) > 0 or
022100180629                   %Scan( %Trim( SearchDta ) : s1ActNam ) > 0;
022200180629
022300180629                   rrn = rrn + 1;
022400180629                   write LstSfl;
022500180629
022600180629                endif;
022700180629
022800180629             endif;
022900180629
023000180103             i = 0;
023100170526
023200000000
023300180103             If rrn >= 9999;
023400180103                leave;
023500180103             endIf;
023600000000
023700180103          enddo;
023800000000
023900180103       End-proc;
024000000000
024100180103       // ----------------------------------------------------------------
024200180103       dcl-Proc DISPLY;
024300000000
024400180103          DspSfl = *on  ;
024500180103          exfmt  Screen1 ;
024600180103          DspSfl = *off;
024700000000
024800000000
024900180103       End-proc;
025000180103
025100180103
025200180103       //-----------------------------------------------------------------
025300180103       dcl-proc ReadChanged;
025400180103
025500180103          Dou *in95 = *ON;
025600180103             READC LstSfl;
025700180103             *in95 = %EOF;
025800180103
025900180103             If *in95 = *OFF;
026000180103
026100180103                if  btnView = *on;
026200180103
026300180103                   oTrst = s1Trst;
026400180103                   oSub# = s1Sub#;
026500180103                   oAcct = s1Acct;
026600180103
026700180103                   CommCtrl( oTrst : oSub#: oAcct ) ;
026800180103                endif;
026900180103
027000180103
027100180103                btnView = *off;
027200180103                update LstSfl;
027300180103
027400180103
027500180103             //   Reload = 'Y';
027600180103             endIf;
027700180103
027800180103
027900180103          enddo;
028000180103       end-proc;
