000100171229
000200171229       Ctl-opt option(*noDebugIo)  bnddir('GBSBIND')  DftActGrp(*no)
000300171229          ActGrp(*New);
000400171229
000500160928      *-------------------------------------------------------------------------
000600160928      *
000700230117      *  Description: Clean up special chars from GBS20P
000800220228      *  Programmer.: Jon Allen
000900230117      *  Date.......: 01/17/2023
001000161007      *
001100171030      *  Description:
001200161007      *
001300170322      *
001400160928      *-------------------------------------------------------------------------
001500160928      * Modifications
001600160928      *
001700160928      * Date         Programmer    Mod      Description
001800160928      *-------------------------------------------------------------------------
001900160928      *
002000160928      *-------------------------------------------------------------------------
002100171229
002200171229
002300171229      *-------------------------------------------------------------------------
002400171229      *
002500171229      * Declare Files
002600171229      *
002700171229      *-------------------------------------------------------------------------
002800230104    ?FGBS20P    UP   E           K DISK
002900171229
003000171229      *-------------------------------------------------------------------------
003100171229      *
003200171229      * Global Variables
003300171229      *
003400171229      *-------------------------------------------------------------------------
003500230111
003600230111       dcl-ds OutData  Qualified  ;
003700230111         outString Char(500);
003800230111         iRtn      Char(1);
003900230111       End-Ds;
004000171229
004100230104      /Include *LIBL/QMODSRC,#EDT500PR            // Edit String
004200180404
004300180404      *-------------------------------------------------------------------------
004400180404      *
004500180404      * *Entry Procedure
004600180404      *
004700180404      *-------------------------------------------------------------------------
004800180404       Dcl-pr Main ExtPgm;
004900180404       End-Pr;
005000180404
005100180404       dcl-pi Main;
005200180404       End-Pi;
005300180404
005400171030
005500171030
005600161005      *-------------------------------------------------------------------------
005700171229      *
005800171229      * Mainline Program
005900171229      *
006000161005      *-------------------------------------------------------------------------
006100220301
006200230111           outData = EdtString500(RCD:'ADDR');
006300230111           if outData.iRtn = 'Y';
006400230111           RCD = outData.outString;
006500230104           update R_GBS20P;
006600230111           Endif;
006700220503
006800160928
