000100230329      *========================================================================
000101230329     h dftactgrp(*no) option(*noDebugIo) bnddir('GBSBIND')
000102230329      *========================================================================
000103230406      * GETMTNAME - Get the next MT File Name
000105230329      *========================================================================
000106230329      * Date         Int  Description
000107230329      * ----------   ---  -----------------------------------------------------
000108230404      * 04/04/2023   jt   Original Creation
000109230329      *========================================================================
000110230329
000111230404     d seq#            s             10    dtaara('MTDTAARA')
000112230329     d numberN         s              1  0
000114230329     d todayn          s              6  0
000115230329     d today           s              6
001100170530
001101230404     d getmtname       pi
001102230329     d  FileName                     10
001104230329
001105230329      *========================================================================
001106230329
001107230329       in *lock seq#;
001108230329
001109230329
001110230329       today = %subst(seq#:4:6);
001111230329       if today <> %char(%date:*mdy0);
001112230329        today = %char(%date:*mdy0);
001114230329         %subst(seq#:4:6) = today;
001115230329         %subst(seq#:3:1) = '0';
001116230329        out seq#;
001117230329       endif;
001118230329
001119230329
001120230329       in *lock seq#;
001121230329       numbern = %dec(%subst(seq#:3:1):1:0);
001122230329       todayn = %dec(%date:*mdy);
001123230329       numbern = numbern + 1;
001124230404       seq# = 'MT' + %char(numbern) + %editc(todayn:'X');
001125230329       out seq#;
001126230329
001127230329       FileName = seq#;
001128230329
001129230329
002900151111       *inlr = *on;
003000151111       return;
003100151111
003101230329      *========================================================================
