000100160513      *===========================================================================
000200160512     H option(*noDebugIo)
000300160513      *===========================================================================
000400200302      * HART009R - Hartford - Generate Headers and Trailers
000500180313      *================================================================================
000600180313      * Date        Int   Description
000700180313      * ----------  ---   -------------------------------------------------------------
000800200302      * 03/02/2020  jt    Original creation
000801200819      * 08/19/2020  jt    Re-compiled for database change
000802200825      * 08/25/2020  jt    Added second file to count
000900160513      *===========================================================================
001000160512
001100200302     fharthdr   o    e             disk    rename(headr:fileHeader)
001200180824
001300200424     fhartdtl   if   e           k disk    rename(hartr:hartFile)
001400180824
001401200825     fhartdtlz  if   e           k disk    rename(hartr:hartFile2)
001402200825
001500200302     fhartftr   o    e             disk    rename(footr:fileFooter)
001600180824
001700160512      *=================================================================
001800061017
001801200302     d timex           s               t
001802200302     d ampm            s              2
002000200302     d today           s              8
002100200302     d time            s              6  0
002101200302     d timec           s              8
002200181108     d totalrecords    s              5  0
002201200302
002202200302     d time_a          s              8
002300180824
002400200302     d hart009r        pi
002500200302     d  action                        3    const
002600180824
002700160511      //==================================================================
002800160511      // mainline
002900160511      //===================================================================
003000150820
003100160511       exsr init;
003200160511       exsr main;
003300160511       exsr exit;
003400160511
003500160511      //===================================================================
003600160511      // main
003700160511      //===================================================================
003800160511
003900160511       begsr main;
004000160511
004300180824        select;
004400200302         when action = 'HDR';
004500200302          exsr fileHead;
004600180824
004700200302         when action = 'FTR';
004800200302          exsr fileFoot;
004900180824        endsl;
005000180824
005100160511       endsr;
005200160511
007400180309      //===================================================================
007500180824      // file header
007600180309      //===================================================================
007700180309
007800200302       begsr fileHead;
007900180309
008000200302        hseccodeh = '~HDR~';
008100200302        hcustcount = '1';
008200200302        hfilename = 'GBS_' + %char(today) + '.txt';
008201200302        hdatetime = today + ' ' + time_a + ' '+ ampm;
008202200302        hcustname = 'GBS';
008300200302        hfilever# = '002.00';
008400180824
008500200302        write fileHeader;
008600180309
008700180309       endsr;
008800180824
008900180824      //===================================================================
009000180824      // file trailer
009100180824      //===================================================================
009200180824
009300200302       begsr fileFoot;
009301200302
009302200302        exsr recordCount;
009400180824
009401200302         hseccodef = '~FTR~';
009900181030
010000200302         write fileFooter;
010100181030
010200180824       endsr;
010300180824
010301200302      //===================================================================
010302200302      // record count
010303200302      //===================================================================
010304200302
010305200302       begsr recordCount;
010306200302
010307200302        setll *loval hartFile;
010308200302        read hartfile;
010309200302
010310200302        dow not %eof;
010311200302
010312200302         totalRecords = totalRecords + 1;
010313200302
010314200302        read hartFile;
010315200302        enddo;
010316200302
010317200825        setll *loval hartFile2;
010318200825        read hartfile2;
010319200825
010320200825        dow not %eof;
010321200825
010322200825         totalRecords = totalRecords + 1;
010323200825
010324200825        read hartFile2;
010325200825        enddo;
010326200825
010327200302        hreccount = %char(totalrecords);
010328200302
010329200302       endsr;
010330200302
010400160511      //===================================================================
010500160511      // exit
010600160511      //===================================================================
010700160511
010800160511       begsr exit;
010900160511
011000160511        *inlr = '1';
011100160511        return;
011200160511
011300160511       endsr;
011400160511
011500160511      //===================================================================
011600160511      // init
011700160511      //===================================================================
011800160520
011900160511       begsr init;
012000180309
012100180824        time = %dec(%time);
012201200302
012202200302        ampm = 'AM';
012203200302        time_a = %char(%time():*HMS:);
012204200302        if time >= 120000;
012205200302         ampm = 'PM';
012206200302         timex = %time() - %hours(12);
012207200302         time_a = %char(timex:*HMS:);
012208200302        endif;
012209200302
012210200302        today = %char(%dec(%date));
012500181029
012600160511       endsr;
012700010412
012800160511       //==============================================================
