000100200820      *========================================================================
000200190218     h dftactgrp(*no) option(*noDebugIo) bnddir('GBSBIND')
000300200820      *========================================================================
000400210112      * HUM933R - Humana Plan Mapping drill down
000500190218      *========================================================================
000600200820      * Date         Int  Description
000700190218      * ---------    ---  -----------------------------------------------------
000800210112      * 01/12/2021   jt   Original Creation
000801210309      * 03/09/2021   jt   Unlocked file in entry.
000802210825      * 08/25/2021   jt   Added "active only" feature.
001100190218      *========================================================================
001200190218
001300210112     Fhum933d   cf   e             WorkStn Handler('PROFOUNDUI(HANDLER)')
001400190218     F                                     SFile(SFL1 : RRN)
001500190218
001600190218     Faccmst    if   e           k disk    ExtFile('F.ACCMST')
001700190218     F                                     rename(accmsr:acctFile)
001800190218
001900190218     fcarplnx   uf a e           k disk    rename(carplnr:mainFile)
002000190218
002100190218     fplnmst    if   e           k disk    extfile('F.PLNMST')
002200190218     f                                     rename(plnmsr:planFile)
002201200825
002202200825     fplnauxl   if   e           k disk    rename(plnauxr:auxFile)
002300190218
002400200630     fcarplnq   uf a e           k disk    rename(carplnr:mainFile2)
002401200310
002402200310     fcarplnz   uf a e           k disk    rename(carplnr:mainFile3)
002500190218
002600190218      *=========================================================================
002700190218
002800190218     d psds           sds
002900190218     d proc_name         *proc
003000190218     d user                  254    263
003100190218
003200190218     d rrn             s              5i 0
003700190218     d valid           s              1
004000190218     d unique          s             10
004100190218     d runique         s             10
004200190218     d hunique         s             10
004600190218
004601200623     d showMembers     pr                  ExtPgm('MEMCOVR')
004602200623     d  ptrst                         3  0 const
004603200623     d  psub#                         3  0 const
004604200623     d  pacct                         4  0 const
004605200623     d  plan                          4    const
004607200623
004700210112     d hum933r         pi
004800190218     d  ptrst                         3  0 const
004900190218     d  psub#                         3  0 const
005000190218     d  pacct                         4  0 const
005100190412     d  platform                      1  0 const
005200190218
005300190218      //========================================================================
005400190218      // mainline
005500190218      //========================================================================
005600190218
005700190218       exsr init;
005800190218       exsr main;
005900190218       exsr exit;
006000190218
006100190218      //========================================================================
006200190218      // main
006300190218      //========================================================================
006400190218
006500190218       begsr main;
006600190218
006700190218        dow btnEXIT = '0';
006800190218
006900190218         // Clear the subfile...
007000190218         sflclr = '1';
007100190218
007200190218         write sflctl1;
007300190218         sflclr = '0';
007400190218         rrn = 0;
007500190218
007600190218         // Load the subfile...
007700190218         exsr loadSubfile;
007800190218
007900190218         // Display the subfile.
008000190218         sfldsp = '1';
008100190218         exfmt sflctl1;
008200190218
008300190218         exsr checkButton;
008400190218
008500190218         sfldsp = '1';
008600190218
008700190218        // Check for icon click.
008800190218        readc sfl1;
008900190218        if not %eof;
009000190218
009100190218         //Lock record for update, if in change mode.
009200190218         if buttonEdit ='1';
009300190218          exsr editRecord;
009400190218         endif;
009500190218
009600190218         if buttonDsp ='1';
009700190218          exsr displayRcd;
009800190218         endif;
009900190218
010000190218         if ar <> actret2;
010100190218          exsr activeRetire;
010200190218         endif;
010300190218
010301200623         if selplan = '1';
010302200623          exsr showPlan;
010303200623         endif;
010305200623
010400190218        endif;
010500190218       enddo;
010600190218
010700190218       endsr;
010800190218
010900190218      //========================================================================
011000190218      // load subfile
011100190218      //========================================================================
011200190218
011300190218       begsr loadSubfile;
011400190218
011500190904        if posPlan > ' ';
011600190904         setll (ptrst : psub# : pacct : posPlan) mainFile;
011700190904        else;
011800190904         setll (ptrst : psub# : pacct) mainFile;
011900190904        endif;
012000190904
012100210309        reade(n) (ptrst : psub# : pacct) mainFile;
012200190218
012300190218        dow not %eof;
012400190218
012500210825         if cpuniq = unique or cpuniq = runique;
012501210825
012502210825          if activeOnly = 'Y';
012503210825
012504210825           if cpuniq = unique;
012505210825            rrn += 1;
012506210825             exsr moveFields;
012507210825            write sfl1;
012508210825           endif;
012509210825
012510210825          else;
012511210825           rrn += 1;
012512210825            exsr moveFields;
012513210825           write sfl1;
012514210825          endif;
012515210825
012516210825         endif;
013000190218
013100210309        reade(n) (ptrst : psub# : pacct) mainFile;
013200190218        enddo;
013300190904
013600190218       endsr;
013700190218
013800190218      //========================================================================
013900190218      // move fields
014000190218      //========================================================================
014100190218
014200190218       begsr moveFields;
014300190218
014400190218        plan = cpplan;
014702200310
015300200820        chain (ptrst : psub# : plan) planFile;
015400190218        if %found;
015500190218         pdesc = pdescr;
015600190218        endif;
015700190218
016000190218        actret = 'ACTIVE';
016100190218        actret2 = '1';
016200190218        ar = '1';
016300190218        if %subst(cpuniq:1:1) = '9';
016400190218         actret = 'RETIRE';
016500190218         ar = '0';
016600190218        actret2 = '0';
016700190218        endif;
016800190218
016900190218       endsr;
017000190218
017100190218      //========================================================================
017200190218      // load fields
017300190218      //========================================================================
017400190218
017500190218       begsr loadFields;
017600190218
017700190218        if actret = ('ACTIVE');
017800190218         hunique = unique;
017900190218        else;
018000190218         hunique = runique;
018100190218        endif;
018200190218
018300200727        chain(n) (hunique : ptrst : psub# : plan : pacct) mainfile2;
018400190218
018600200630        splan = cpplan;
018601210112        chain (ptrst : psub# : plan) planFile;
018602210112        if %found;
018603210112         spdesc = pdescr;
018604210112        endif;
018605210112
018606210112        sbenid = cpcid1;
018607210112        sdiv =  cpcid2;
018608210112
018609210112        if sdiv = ' ';
018610210112         sdiv = '001';
018611210112        endif;
018612210112
018613210112        slinecov = cpcid3;
018614210112        scovtype = cpcid4;
018618210112        sbenido = cpcid5;
019100200219
020600190218        acctname  = taname;
020700190218
020800190218       endsr;
020900190218
021000190218      //========================================================================
021100190218      // checkButton
021200190218      //========================================================================
021300190218
021400190218       begsr checkButton;
021500190218
021600190218        if buttonEdit = '1';
021700190218         exsr editRecord;
021800190218        endif;
021900190218
022000190218        if buttonAdd  = '1';
022100190218         exsr addRcd;
022200190218        endif;
022300190218
022301200310        if btnRefresh  = '1';
022302200310         posplan = ' ';
022303200310         btnRefresh = '0';
022304200310        endif;
022305200310
022400190218       endsr;
022500190218
022600190218      //========================================================================
022700190218      // add record
022800190218      //========================================================================
022900190218
023000190218       begsr addRcd;
023100190218
023200190218        addRecord = '0';
023300190218        btnExtAdd = '0';
023400190218        strst = ptrst;
023500190218        ssub# = psub#;
023600190218        sacct = pacct;
023700190218        splan = ' ';
024600190218        spdesc = ' ';
025200190218
025300190218        dow btnExtAdd = '0';
025400190412
025500190218         exfmt adddtl;
025600190218
025700190218         if btnExtAdd = '1';
025800190218          leavesr;
025900190218         endif;
026000190218
026100190218         exsr validAdd;
026200190218
026300210112         if valid  = '1';
026400210112          btnExtAdd = '0';
026500210112         else;
026600210112          btnExtAdd = '1';
026700210112         endif;
026800190218
026900190218        enddo;
027000190218
027100190218       endsr;
027200190218
027300190218      //========================================================================
027400200310      // active/retire
027500190218      //========================================================================
027600190218
027700190218       begsr activeRetire;
027800190218
027900200630        chain (unique : ptrst : psub# : plan : pacct) mainfile2;
028000190218        if %found;
028100190218
028200210112         if cpuniq = '0000000093';
028300210112          cpuniq = '9000000093';
028400190218          update mainfile2;
028500190218         endif;
028600190218
028700190218         leavesr;
028800190218        endif;
028900190218
029000200630        chain (runique : ptrst : psub# : plan : pacct) mainfile2;
029100190218        if %found;
029200210112         if cpuniq = '9000000093';
029300210112          cpuniq = '0000000093';
029400190218          update mainfile2;
029500190218         endif;
029600190218
029700190218         leavesr;
029800200630        endif;
029900190218
030000190218       endsr;
030100190218
030200190218      //========================================================================
030300200630      // display record
030400190218      //========================================================================
030500190218
030600190218       begsr displayRcd;
030700190218
030701200820        clear dspdtl;
030702200820
030800190218        btnExtDsp = '0';
030900190218        strst = ptrst;
031000190218        ssub# = psub#;
031100190218        sacct = pacct;
031200190218
031300190218        dow btnExtDsp = '0';
031400190218
031500190218         exsr loadFields;
031600190218
031700190218         exfmt dspdtl;
031800190218
031900190218        enddo;
032000190218
032100190218        buttonDsp = '0';
032200190218
032300190218       endsr;
032400190218
032500190218      //========================================================================
032600190218      // valid record
032700190218      //========================================================================
032800190218
032900190218       begsr validAdd;
033000190218
033200190218        strst = ptrst;
033300190218        ssub# = psub#;
033400190218        sacct = pacct;
033401210112
033402210112        valid = '0';
033403210112        errPlan = '0';
033404210112        errBen = '0';
033405210112        errDiv = '0';
033406210112        errLinec = '0';
033407210112
033408210112        chain (ptrst : psub# : splan) planFile;
033409210112        if not %found or splan = ' ';
033410210112         errPlan = '1';
033411210112          valid = '1';
033412210112         leavesr;
033413210112        endif;
033414210112
033415210112        if sbenid = ' ';
033416210112         errBen = '1';
033417210112          valid = '1';
033418210112         leavesr;
033419210112        endif;
033420210112
033421210112        if sdiv = ' ';
033422210112         errDiv = '1';
033423210112          valid = '1';
033424210112         leavesr;
033425210112        endif;
033426210112
033427210112        if slinecov = ' ';
033428210112         errLinec = '1';
033429210112          valid = '1';
033430210112         leavesr;
033431210112        endif;
033432210112
038400190218        if valid = '0';
038500190218         exsr addRecd;
038600190218        endif;
038700190218
038800190218       endsr;
038900190218
039000190218      //========================================================================
039100190218      // valid add
039200190218      //========================================================================
039300190218
039400190218       begsr addRecd;
039500190218
039501201124        clear mainFile;
039502201124
039600190218        cpuniq = unique;
039700190218        cptrst = ptrst;
039800190218        cpsub# = psub#;
039900190218        cpacct = pacct;
040100190218        cpplan = splan;
040101200630
040102210112        cptxt1 = 'BENEFIT ID';
040114210112        sbenid = cpcid1;
040119210112
040120200630        cptxt2 = 'PLAN OPTION';
040121210112        cpcid2 = sdiv;
040123200630
040124210112        cptxt3 = 'DIVISION';
040125210112        cpcid3 = slinecov;
040126200630
040127210112        cptxt4 = 'ARRAY TYPE';
040128210112        cpcid4 = scovtype;
040129200630
040130210112        cptxt5 = 'CATEGORY ID OVERRIDE';
040131210112        cpcid5 = sbenido;
040132200630
041000190218        write mainFile;
041100190218
041200190218       endsr;
041300190218
041400190218      //========================================================================
041500190218      // edit record
041600190218      //========================================================================
041700190218
041800190218       begsr editRecord;
041900190218
042000190218        btnUpdRcd = '0';
042100190218        btnExtEdt = '0';
042200190218        strst = ptrst;
042300190218        ssub# = psub#;
042400190218        sacct = pacct;
042401200630        splan = cpplan;
042402200630
043100190218        dow btnExtEdt = '0';
043200190218
043300190218         exsr loadFields;
043400190218
043500190218         exfmt maintdtl;
043600190218
043700190218         if btnUpdRcd = '1';
043800190218          exsr validEdit;
043900190218         endif;
044000190218
044100190218        enddo;
044200190218
044300190218        buttonEdit = '0';
044400190218
044500190218       endsr;
044600190218
044700190218      //========================================================================
044800190218      // valid record
044900190218      //========================================================================
045000190218
045100190218       begsr validEdit;
045200190218
045300190218        valid = '0';
045301210112        errPlan = '0';
045302210112        errBen = '0';
045303210112        errDiv = '0';
045304210112        errLinec = '0';
045800190218
047500210112        chain (ptrst : psub# : splan) planFile;
047600210112        if not %found or splan = ' ';
047700210112         errPlan = '1';
047800210112          valid = '1';
047801210112         leavesr;
047900210112        endif;
048100190218
048101210112        if sbenid = ' ';
048102210112         errBen = '1';
048103210112          valid = '1';
048104210112         leavesr;
048105210112        endif;
048106210112
048107210112        if sdiv = ' ';
048108210112         errDiv = '1';
048109210112          valid = '1';
048110210112         leavesr;
048111210112        endif;
048112210112
048113210112        if slinecov = ' ';
048114210112         errLinec = '1';
048115210112          valid = '1';
048116210112         leavesr;
048117210112        endif;
048118210112
050300190218        if valid = '0';
050400190218         exsr edtRecord;
050500190218         btnExtEdt = '1';
050600190218        endif;
050700190218
050800190218        endsr;
050801200623
050900200623      //========================================================================
050901200623      // show members for plan
050902200623      //========================================================================
050903200623
050904200623       begsr showPlan;
050905200623
050910200623        showMembers(ptrst : psub# : pacct : plan);
050911200623
050915200623        selplan = '0';
050916200623
050917200623       endsr;
050918200623
051000190218      //========================================================================
051100190218      // valid add
051200190218      //========================================================================
051300190218
051400190218       begsr edtRecord;
051500190218
051600190218        if actret = ('ACTIVE');
051700190218         hunique = unique;
051800190218        else;
051900190218         hunique = runique;
052000190218        endif;
052100190218
052200200630        chain (hunique : ptrst : psub# : plan :pacct) mainfile2;
052300190218
052500190218        cpplan = splan;
052900200219
052901210112        cpcid1 = sbenid;
052902210112        cpcid2 = sdiv;
052908210112        cpcid3 = slinecov;
052909210112        cpcid4 = scovtype;
052910210112        cpcid5 = sbenido;
052911210112
053500190218        update mainFile2;
053600190218
053700190218       endsr;
053800190218
053900190218      //========================================================================
054000190218      // exit
054100190218      //========================================================================
054200190218
054300190218       begsr exit;
054400190218
054500190218        *inlr = '1';
054600190218        return;
054700190218
054800190218       endsr;
054900190218
055000190218      //========================================================================
055100190218      // init
055200190218      //========================================================================
055300190218
055400190218       begsr init;
055500190218
055600190218        btnREFRESH = '0';
055700190218        btnEXIT = '0';
055800190218        btnUpdRcd = '0';
055900190218        buttonDsp = '0';
056000190218        buttonEdit = '0';
056100190218        buttonAdd = '0';
056103200623        selplan = '0';
056200210825        activeOnly = 'N';
056201210825
056300190218        sfldsp = '0';
056400190218        sflclr = '0';
056500190218
056600190218        pgmname = proc_name;
056700190218
056800210112        title = 'Humana Account Plan Mapping';
056900190218
057000210112        unique = '0000000093';
057100210112        runique = '9000000093';
057200190218
057300190218        ttrst = %editc(ptrst:'X');
057400190218        tsub# = %editc(psub#:'X');
057500190218        tacct = %editc(pacct:'X');
057600190218
057700190218        chain (ptrst : psub# : pacct) acctFile;
057800190218        if %found;
057900190218         taname = acnam1;
058000190218        endif;
058100190218
058200190218       endsr;
058300190218
058400190218      //========================================================================
