000100190415
000200190415       Ctl-opt option(*noDebugIo)   DftActGrp(*no) BndDir('GBSBIND');
000300190415
000400190415
000500151221      *-------------------------------------------------------------------------
000600170511      * Overview:
000700170511      *
000800170511      *
000900170728      *  Programmer: B.Rees
001000190415      *  Date:       4/15/2019
001100170511      *
001200151221      *-------------------------------------------------------------------------
001300151221
001400190415       dcl-f ftfmtfill1 keyed;
001500190415
001600170831
001700190415       dcl-s ifs_Path Char(300);
001800190415       dcl-s savSqlCode like( SqlCod );
001900190415       dcl-s sqEncrypt Char(64);
002000170510
002100170831
002200151221      *-------------------------
002300190415      *
002400190415      * Procedure(s)
002500190415      *
002600151221      *-------------------------
002700190415      /include GBSPGM/QMODSRC,IFSAPI_H
002800190415      /include *LIBL/QMODSRC,#COMMANDPR        // Get Token (Split)
002900151221
003000151221
003100190415
003200190415       Dcl-pr IFSCLEANC3 ExtPgm('IFSCLEANC3') end-pr;
003300190415
003400170831
003500170508      *-----------------------------------------------------------------
003600190415      *
003700190415      * Main Program
003800190415      *
003900170508      *-----------------------------------------------------------------
004000170831
004100190415
004200190415       // Step 1: Check to make sure all of the files listed in the
004300190415       //         IFSLIST, actually exists
004400190415
004500190415       Step1();
004600190415
004700190415
004800190415       // Step 2: Any files listed in the FT_Files, but not listed in
004900190415       //         the file IFSLIST, or FTFMTFIL
005000190415
005100190415       Step2();
005200190415
005300190415
005400190415
005500190415
005600190415
005700170728
005800170728       *inlr =*on;
005900170510
006000190415
006100190415       // ----------------------------------------------------------------
006200190415       dcl-proc Step1;
006300190415
006400190415
006500190415
006600190415         Exec Sql
006700190415            Declare c1 Cursor For
006800190415               Select Trim(ifloc) || '/' || Trim(ifencrypt) || '.' ||
006900190415                      Trim(ifext), ifencrypt
007000190415                  From ifslist;
007100190415
007200190415         Exec Sql
007300190415            Open c1;
007400190415
007500190415
007600190415         Dou SqlCod <> *Zero;
007700190415           Exec Sql
007800190415              Fetch Next From c1 Into :ifs_path, :sqencrypt;
007900190415
008000190415           if SqlCod <> *Zero;
008100190415             leave;
008200190415           endif;
008300190415
008400190415
008500190415
008600190415           // Not Found
008700190415           if Access(%trimr(IFS_Path): F_OK) < 0;
008800190415             SavSqlCode = SqlCod;
008900190415
009000190415             Exec Sql
009100190415                Delete ifslist Where ifencrypt = :sqencrypt;
009200190415
009300190415             sqlcod = savsqlcode;
009400190415
009500190415           EndIf;
009600190415
009700190415
009800190415
009900190415
010000190415         enddo;
010100190415
010200190415         Exec Sql
010300190415            Close c1;
010400190415
010500190415
010600190415
010700190415
010800190415       end-proc;
010900190415
011000190415       // ----------------------------------------------------------------
011100190415
011200190415       dcl-proc Step2;
011300190415
011400190415         dcl-s  wPAth Char(64);
011500190415
011600190415         // List Files into database.
011700190415         IFSCLEANC3();
011800190415
011900190415
012000190415
012100190415         Exec Sql
012200190415            Declare c2 Cursor For
012300190415               Select *
012400190415                  From ifsclnlst;
012500190415
012600190415         Exec Sql
012700190415            Open c2;
012800190415
012900190415
013000190415
013100190415         Dou SqlCod <> *Zero;
013200190415           Exec Sql
013300190415              Fetch Next From c2 Into :ifs_path;
013400190415
013500190415           if %trim(ifs_path) = '/ft_Files';
013600190415             iter;
013700190415           EndIf;
013800190415
013900190415           if SqlCod <> *Zero;
014000190415             leave;
014100190415           endif;
014200190415
014300190415           wPath = %Subst(ifs_Path:11);
014400190415
014500190415           chain wPath ftfmtfill1;
014600190415           if not %Found( ftfmtfill1 );
014700190415
014800190415             //?Delete the file from the main location
014900190415             CmdString = 'Del ObjLnk(' + q +  %Trim(ifs_Path) + q + ') ';
015000190415             #Command(CmdString:%len(%Trim(CmdString)));
015100190415
015200190415
015300190415
015400190415           EndIf;
015500190415
015600190415         Enddo;
015700190415
015800190415         Exec Sql
015900190415            Close c2;
016000190415
016100190415       End-Proc;
016200190415
016300190415
016400190415       // ----------------------------------------------------------------
016500190415      /COPY GBSPGM/QMODSRC,IFSAPI_P
