000100171229
000200171229       Ctl-opt option(*noDebugIo)  bnddir('GBSBIND')  DftActGrp(*no)
000300171229          ActGrp(*New);
000400171229
000500171229
000600180102      *-------------------------------------------------------------------------
000700180102      *
000800180102      *  Description:
000900180102      *  Programmer.:  Brian Rees
001000180102      *  Date.......:  05/25/2017
001100180102      *
001200180102      *-------------------------------------------------------------------------
001300171229
001400171229
001500171229      *-------------------------------------------------------------------------
001600171229      *
001700171229      * Declare Files
001800171229      *
001900171229      *-------------------------------------------------------------------------
002000171229       Dcl-f Inq012d Workstn
002100171229          HANDLER('PROFOUNDUI(HANDLER)')
002200171229          SFILE(COVSFL:rrn);
002300171229
002400171229       dcl-f Member  keyed ExtDesc('F.MEMBER')  ExtFile(*ExtDesc);
002500171229       Dcl-f MCov40  keyed ExtDesc('F.MCOV40')  ExtFile(*ExtDesc);
002600171229       Dcl-f MCov41  keyed ExtDesc('F.MCOV41')  ExtFile(*ExtDesc)
002700171229           Rename( MCOVR : Rcd1 );
002800171229       Dcl-f AccMst  keyed ExtDesc('F.ACCMST')  ExtFile(*ExtDesc);
002900171229       dcl-f PlnMst  keyed ExtDesc('F.PLNMST')  ExtFile(*ExtDesc);
003000171229       dcl-f Class   keyed ExtDesc('F.CLASS')   ExtFile(*ExtDesc);
003100171229       Dcl-f CodesL1 keyed ExtDesc('F.CODESL1') ExtFile(*ExtDesc);
003200171229       dcl-f Grate   keyed ExtDesc('F.GRATE')   ExtFile(*ExtDesc);
003300171229       dcl-f MemAlt keyed;
003400171229       dcl-f WebPayrol1 keyed;
003500171229
003600171229
003700171229      *-------------------------------------------------------------------------
003800171229      *
003900171229      * Global Variables
004000171229      *
004100171229      *-------------------------------------------------------------------------
004200171229
004300171229       dcl-s rrn Zoned(5) inz;
004400171229       dcl-s wSSN Zoned(9);
004500171229
004600170529
004700180404
004800180404      *-------------------------------------------------------------------------
004900180404      *
005000180404      * *Entry Procedure
005100180404      *
005200180404      *-------------------------------------------------------------------------
005300180404       Dcl-pr Main ExtPgm;
005400180404          *N  Zoned(9);
005500180404       End-Pr;
005600180404
005700180404       dcl-pi Main;
005800180404          pMember Zoned(9);
005900180404       End-Pi;
006000180404
006100180404
006200170525
006300161118
006400180102      *-------------------------------------------------------------------------
006500171229      *
006600180102      * Mainline Program
006700171229      *
006800180102      *-------------------------------------------------------------------------
006900170605
007000171127       wssn = pMember;
007100171127
007200170525       Dou btnExit = *on;
007300171229          Clear_All();
007400171229          LoadActCovgs();
007500171229          LoadTrmCovgs();
007600170605
007700171103
007800171103
007900180102          // Display Screen
008000171229          Disp_All();
008100170605
008200171103
008300170606
008400170525       enddo;
008500170529
008600170525       *inlr = *on;
008700170525
008800170525
008900170531
009000180102      *-------------------------------------------------------------------------
009100171229      *
009200180102      * Clear the Subfiles...
009300171229      *
009400180102      *-------------------------------------------------------------------------
009500171229       dcl-proc Clear_All;
009600170605
009700180102          // Clear the Subfile.
009800170605          ClrSfl = *on;
009900170605          Write Screen1;
010000170605          ClrSfl = *off;
010100170605          rrn = 0;
010200170605
010300171229       end-proc;
010400170605
010500171229
010600180102      *-------------------------------------------------------------------------
010700171229      *
010800180102      * Display The Subfiles...
010900171229      *
011000180102      *-------------------------------------------------------------------------
011100171229       dcl-proc Disp_All;
011200170605
011300180102          // Display the Subfile.
011400170605          DspSfl = *on  ;
011500170605          exfmt Screen1;
011600170605          DspSfl = *off;
011700170605
011800171229       end-proc;
011900170607
012000180102      *-------------------------------------------------------------------------
012100171229      *
012200180102      * Load the Active Coverages Section
012300171229      *
012400180102      *-------------------------------------------------------------------------
012500171229       dcl-proc LoadActCovgs;
012600170531
012700170605
012800180102          // Retrive the Termed Records..
012900171127          setll wssn mCov40;
013000170531
013100170607          dou %Eof(mCov40);
013200171127             reade wssn mCov40;
013300170605
013400170607             if %eof( mCov40 );
013500170605                leave;
013600170605             endif;
013700170605
013800170605             chain (mcTrst : mcSub# : mcPlan ) PlnMst;
013900170605             chain (mcTrst : mcSub# : mcPlan : mCovtp ) Class;
014000170605             if not %Found(Class);
014100170605                chain (mcTrst : mcSub# : mcPlan : 'TNA' ) Class;
014200170605             endif;
014300170605
014400170605             chain (mcTrst : mcSub# : mcPlan : mcAgeb : mCovtp ) Grate;
014500170605
014600171127             s1Plan = mcPlan;
014700171127             s1PlanName = %Trim( pDescr );
014800170605             s1CovTp = %Subst( mCovtp : 2 : 2);
014900170605             s1Ageb = mcAgeb ;
015000170605
015100170605             if enrldt > 0;
015200170605                s1Enroll = %Char(%Date(enrldt :*iso):*Usa);
015300170605             endif;
015400170605
015500170605             if candt > 0;
015600170605                s1Cancel = %Char(%Date(candt :*iso):*Usa);
015700170605             endif;
015800170605
015900170605             s1Premium = lPrem;
016000170605
016100170605             s1rb = *Blanks;
016200170605             if mcorgben > benamt;
016300170605                s1rb = 'Y';
016400170605             endif;
016500170605
016600170605             s1Group# = Group#;
016700170605
016800170605             rrn = rrn + 1;
016900170605             write CovSfl;
017000170605
017100170605          Enddo;
017200170605
017300170605
017400171229       end-proc;
017500170605
017600170605
017700180102      *-------------------------------------------------------------------------
017800171229      *
017900180102      * Load the Termed Coverages Section
018000171229      *
018100180102      *-------------------------------------------------------------------------
018200171229       dcl-proc LoadTrmCovgs;
018300170607
018400170607
018500180102          // Retrive the Termed Records..
018600171127          setll wssn  mCov41;
018700170607
018800170607          dou %Eof(mCov41);
018900171127             reade wssn  mCov41;
019000170607
019100170607             if %eof( mCov41 );
019200170607                leave;
019300170607             endif;
019400170607
019500170607             chain (mcTrst : mcSub# : mcPlan ) PlnMst;
019600170607             chain (mcTrst : mcSub# : mcPlan : mCovtp ) Class;
019700170607             if not %Found(Class);
019800170607                chain (mcTrst : mcSub# : mcPlan : 'TNA' ) Class;
019900170607             endif;
020000170607
020100170607             chain (mcTrst : mcSub# : mcPlan : mcAgeb : mCovtp ) Grate;
020200170607
020300171205             s1Plan = mcPlan;
020400171205             s1PlanName = %Trim( pDescr );
020500170607             s1CovTp = %Subst( mCovtp : 2 : 2);
020600170607             s1Ageb = mcAgeb ;
020700170607
020800170607             if enrldt > 0;
020900170607                s1Enroll = %Char(%Date(enrldt :*iso):*Usa);
021000170607             endif;
021100170607
021200170607             if candt > 0;
021300170607                s1Cancel = %Char(%Date(candt :*iso):*Usa);
021400170607             endif;
021500170607
021600170607             s1Premium = lPrem;
021700170607
021800170607             s1rb = *Blanks;
021900170607             if mcorgben > benamt;
022000170607                s1rb = 'Y';
022100170607             endif;
022200170607
022300170607             s1Group# = Group#;
022400170607
022500170607             rrn = rrn + 1;
022600170607             write CovSfl;
022700170607
022800170607          Enddo;
022900170607
023000170607
023100171229       end-proc;
023200170607
