000100190515
000200190515       ctl-opt option(*noDebugIo)  DftActGrp(*No);
000300190515
000400190515      *-------------------------------------------------------------------------
000500190515      *
000600190515      *  Description: New Hire email Listing
000700190515      *  Programmer.: Brian Rees
000800190515      *  Date.......: 05/15/2019
000900190515      *
001000190515      *  Using API's; this will read through the New Hire Emails and
001100190515      *  load them to the datafile.
001200190515      *
001300190515      *-------------------------------------------------------------------------
001400190515
001500190515
001600190515       dcl-f IfsClnLst Rename( IfsClnLst : Rcd1 ) prefix(f_)
001700190515         usage(*output);
001800190515
001900190515
002000190515       dcl-s DirPtr Pointer;
002100190515       dcl-s ErrorNbr Int(10) based(MyErrnoPtr);
002200190515       dcl-s Wait Char(1);
002300190515       dcl-s ErrorMsg Char(50);
002400190515       dcl-s DirName Char(250);
002500190515       dcl-s NameText Char(50);
002600151221
002700151221
002800151221      *-------------------------
002900190515      *
003000190515      * Procedure(s)
003100190515      *
003200151221      *-------------------------
003300190515      /include *libl/qmodsrc,IFSAPI_H
003400151221
003500190515
003600190515
003700190515      *-------------------------------------------------------------------------
003800190515      *
003900190515      * *Entry Procedure
004000190515      *
004100190515      *-------------------------------------------------------------------------
004200190515       Dcl-pr Main ExtPgm;
004300190515         *N  char(25);
004400190515       End-Pr;
004500190515
004600190515       dcl-pi Main;
004700190515         pPath Char(25);
004800190515       End-Pi;
004900190515
005000151221
005100190515
005200190515
005300190515      *----------------------------------------------------------------
005400190515      *
005500151221      *  Main Program
005600190515      *
005700190515      *----------------------------------------------------------------
005800151221
005900190515
006000190515
006100190515       //----------------------------------------------------
006200190515       //
006300190515       //  Open Directory
006400190515       //
006500190515       //----------------------------------------------------
006600190515       DirName = '/www/gbsapps/htdocs/gbsapps/OE/OLE_SAVE/' +
006700190515         %Subst(pPath : 1 : 10 );
006800190515
006900190515
007000190515       DirPtr = OpenDir( %Trimr(DirName));
007100190515
007200190515       if DirPtr = *NULL;
007300190515
007400190515       // do Nothing.. Just Leave;
007500190515
007600190515       else;
007700190515
007800190515         //--------------------------------
007900190515         //
008000190515         //  Read the Directory Entries
008100190515         //
008200190515         //--------------------------------
008300190515         DirEntryPtr = ReadDir(DirPTr);
008400190515         dow DirEntryPtr <> *NULL;
008500190515
008600190515           if NameLen > 5;
008700190515             f_IfsClnLst = %Subst(Name : 1: NameLen);
008800190515             write Rcd1;
008900190515           endif;
009000190515
009100190515           DirEntryPtr = ReadDir(DirPtr) ;
009200190515         EndDo;
009300190515
009400190515       EndIf;
009500190515
009600190515       *inlr = *on;
009700190515
009800190515
009900190515      /include *libl/qmodsrc,IFSAPI_P
