000100180620       Ctl-opt option(*noDebugIo)   DftActGrp(*no)
000200180620          bnddir('GBSBIND' : 'GBSBDIR');
000300180620
000400180620      *-------------------------------------------------------------------------
000500180620      *
000600180620      *  Description:
000700180620      *  Programmer.:  Brian Rees
000800180620      *  Date.......:  06/20/2018
000900180620      *
001000180620      *-------------------------------------------------------------------------
001100180620
001200180620      *-------------------------------------------------------------------------
001300180620      *
001400180620      * Declare Files
001500180620      *
001600180620      *-------------------------------------------------------------------------
001700180621       Dcl-f INQ019D WorkStn
001800180620          Handler('PROFOUNDUI(HANDLER)')
001900180620          SFILE(LstSFL:rrn);
002000180620
002100180621       Dcl-f DiaryHd1 keyed ExtDesc('F.DIARYHD1') ExtFile(*extdesc)
002200180621          usage( *input : *output );
002300180621
002400180621       Dcl-f DiaryDt1 keyed ExtDesc('F.DIARYDT1') ExtFile(*extdesc)
002500180621          usage( *input : *output );
002600180621
002700180621       Dcl-f Codesl1 keyed ExtDesc('F.CODESL1') ExtFile(*extdesc);
002800180621
002900180621
003000180621       Dcl-f TrsMst keyed ExtDesc('F.TRSMST') ExtFile(*extdesc);
003100180621       Dcl-f SubMst keyed ExtDesc('F.SUBMST') ExtFile(*extdesc);
003200180621       Dcl-f AccMst keyed ExtDesc('F.ACCMST') ExtFile(*extdesc);
003300180621       Dcl-f Member keyed ExtDesc('F.MEMBER') ExtFile(*extdesc);
003400180622       Dcl-f Hist   keyed ExtDesc('F.HIST')   ExtFile(*extdesc)
003500180622          usage( *input : *output );
003600180622
003700180620
003800180620
003900180620      *-------------------------------------------------------------------------
004000180620      *
004100180620      * Global Variables
004200180620      *
004300180620      *-------------------------------------------------------------------------
004400180621       dcl-ds pgmd
004500180621          ExtName('IOPGMD') PSDS;
004600180621          @pgmq *proc;
004700180621       end-ds;
004800180621
004900180621
005000180621       dcl-s rrn Zoned(5);
005100180620       dcl-s Reload Char(1) inz('Y');
005200180621       dcl-s wKey Char(10);
005300180621       dcl-s wSocial Char(9);
005400180620
005500180620
005600180620      *------------------------------------------------------------------
005700180620      *
005800180620      * Procedures
005900180620      *
006000180620      *------------------------------------------------------------------
006100180620
006200180620
006300180620
006400180621      *-------------------------------------------------------------------------
006500180621      *
006600180621      * *Entry Procedure
006700180621      *
006800180621      *-------------------------------------------------------------------------
006900180621       //Dcl-pr Main ExtPgm;
007000180621       //   *N  Zoned(3);
007100180621       //   *N  Zoned(3);
007200180621       //   *N  Zoned(4);
007300180621       //   *N  Zoned(9);
007400180621       //End-Pr;
007500180621       //
007600180621       //dcl-pi Main;
007700180621       //   pTrust  Zoned(3);
007800180621       //   pSub    Zoned(3);
007900180621       //   pAcct   Zoned(4);
008000180621       //   pMember Zoned(9);
008100180621       //End-Pi;
008200180620
008300180621       dcl-s pTrust  Zoned(3) inz(888);
008400180621       dcl-s  pSub    Zoned(3) inz(1);
008500180621       dcl-s  pAcct   Zoned(4) inz(5);
008600180913       dcl-s  pMember Zoned(9) inz(0);
008700180621
008800180620      *-------------------------------------------------------------------------
008900180620      *
009000180620      * Mainline Program
009100180620      *
009200180620      *-------------------------------------------------------------------------
009300180621
009400180620       Dou btnExit = *on;
009500161109
009600180620          If Reload = 'Y';
009700180621             ClearS1();
009800180621             LoadS1();
009900180621             Reload = 'N';
010000180621          endIf;
010100161109
010200180621          DisplyS1();
010300161109
010400161109
010500180621
010600180621          Select;
010700180621          When btnAdd = *on;
010800180621             btnAdd = *off;
010900180621
011000180621             $AddRecord();
011100180621
011200180621
011300180621          other;
011400180621
011500180621             //?Process Selections
011600180621             ReadChangedS1();
011700161109
011800180621          EndSl;
011900161109
012000161109
012100161109       enddo;
012200161109
012300161109       *inlr = *on;
012400161109
012500180620
012600180620
012700161109       // ----------------------------------------------------------------
012800180621       dcl-proc CLEARS1;
012900161109
013000180620          //-------------------------
013100180620          //
013200180620          // Clear the Subfile
013300180620          //
013400180620          //-------------------------
013500180620
013600161110          ClrSfl = *on;
013700170110          Write CtlSfl;
013800180620          ClrSfl = *off;
013900180621          rrn = 0;
014000161109
014100180620       End-Proc;
014200180621
014300161109       // ----------------------------------------------------------------
014400180621       Dcl-Proc LoadS1;
014500180621
014600170110
014700180621
014800180621          //----------------------------------------------------
014900180621          //
015000180621          //  Account Record
015100180621          //
015200180621          //----------------------------------------------------
015300180621          if pMember = 0;
015400180621             wKey = %EditC( pTrust : 'X' ) + %EditC( pSub : 'X' ) +
015500180621                %EditC( pAcct : 'X' ) ;
015600180621
015700180621             s1Header = %EditC( pTrust : 'X' ) + '-' +
015800180621                %EditC( pSub   : 'X' ) + '-' +
015900180621                %EditC( pAcct  : 'X' ) ;
016000180621
016100180621
016200180621             chain ( pTrust : pSub : pAcct ) AccMst;
016300180621             if %Found( AccMst );
016400180621                s1Header = %Trim( s1Header ) + '    ' + AcNam1;
016500180621             EndIf;
016600180621          endif;
016700180621
016800180621
016900180621          //----------------------------------------------------
017000180621          //
017100180621          //  Member Record
017200180621          //
017300180621          //----------------------------------------------------
017400180621          if pMember > 0;
017500180621
017600180621             wKey = ' ' + %Editc( pMember : 'X' );
017700180621             wSocial = %Editc( pMember : 'X' );
017800180621
017900180621             s1Header = 'Member SSN: ' +
018000180621                %Subst(wSocial: 1: 3 ) + '-' +
018100180621                %Subst(wSocial: 4: 2 ) + '-' +
018200180621                %Subst(wSocial: 6: 4 );
018300180621
018400180621
018500180621
018600180621             chain pMember Member;
018700180621             if %Found( Member );
018800180621                s1Header = %Trim( s1Header ) + '  ' + %Trim( MFNAME );
018900180621
019000180621                if mmi > '';
019100180621                   s1Header = %Trim( s1Header ) + ' ' + %Trim( MMI );
019200180621                EndIf;
019300180621
019400180621                s1Header = %Trim( s1Header ) + ' ' + %Trim( MLNAME );
019500180621
019600180621             EndIf;
019700180621
019800180621          EndIf;
019900180621
020000180621
020100180621          //----------------------------------------------------
020200180621          //
020300180621          //  Load Subfile
020400180621          //
020500180621          //----------------------------------------------------
020600180621
020700180621          Setll wKey DiaryHd1;
020800180621
020900180621          Dou %Eof(DiaryHd1);
021000180621             reade wKey DiaryHd1;
021100180621             if %eof(DiaryHd1);
021200180621                leave;
021300180621             endif;
021400180621
021500180621             s1Code =  %Subst( nhCode : 2 : 2 );
021600180621
021700180621             chain nhCode Codesl1;
021800180621             s1Descr = '';
021900180621             if %Found( Codesl1 );
022000180621                s1Descr = sDescr;
022100180621             EndIf;
022200180621
022300180621             s1Addt = %Char(%Date(nhaddt:*iso):*Usa);
022400180621             s1Adti = %Char(%Time(nhadti:*iso):*Usa);
022500180621             s1Subj = nhSubj;
022600180621
022700180621             sfaddt = nhaddt;
022800180621             sfadti = nhadti;
022900180621
023000180621             rrn = rrn + 1;
023100180621             write  LstSfl;
023200180620
023300180620             If rrn >= 9999;
023400180621                leave;
023500180621             endIf;
023600161109
023700180621          enddo;
023800161109
023900180621       End-Proc;
024000161109
024100161109       // ----------------------------------------------------------------
024200180620       Dcl-Proc DisplyS1;
024300161109
024400180621          DspSfl = *on  ;
024500180620          exfmt CtlSfl;
024600180620          DspSfl = *off;
024700161109
024800180621       End-Proc;
024900180620
025000161109       // ----------------------------------------------------------------
025100180620       Dcl-Proc ReadChangedS1;
025200161109
025300180621          Dou *in95 = *ON;
025400180621             READC LstSfl;
025500161109             *in95 = %EOF;
025600161109
025700180620             If *in95 = *OFF;
025800161109
025900170124
026000180621                //?Edit Job Record
026100180620                if btnView = *on;
026200180621                   Load_Data();
026300180621
026400180621                   if pMember = 0;
026500180621                      Exfmt ViewScrTSA;
026600180621                   else;
026700180621                      Exfmt ViewScrMBR;
026800180621                   endif;
026900180621
027000180620                   btnExit = *off;
027100180621                endIf;
027200170124
027300170124
027400180620                btnView = *off;
027500161109                update LstSfl;
027600180620                Reload = 'Y';
027700170601
027800180621             endIf;
027900161109
028000180621          enddo;
028100180620
028200180621       End-Proc;
028300161111
028400180620
028500180621       // ----------------------------------------------------------------
028600180621       dcl-proc Load_Header;
028700180621
028800180621
028900180621          s2Trust = pTrust;
029000180621          s2Sub  = pSub;
029100180621          s2Acct = pAcct;
029200180621
029300180621
029400180621          chain pTrust TrsMst;
029500180621          if %Found( TrsMst );
029600180621             s2tDescr = tDescr;
029700180621          endif;
029800180621
029900180621          chain (pTrust : pSub ) SubMst;
030000180621          if %Found( SubMst );
030100180621             s2sDescr = SubDsc;
030200180621          endif;
030300180621
030400180621          chain (pTrust : pSub : pAcct ) AccMst;
030500180621          if %Found( AccMst );
030600180621             s2AcNam1 = AcNam1;
030700180621          endif;
030800180621
030900180621
031000180621          if pMember > 0;
031100180621             s2ssn = %Subst(wSocial: 1: 3 ) + '-' +
031200180621                %Subst(wSocial: 4: 2 ) + '-' +
031300180621                %Subst(wSocial: 6: 4 );
031400180621
031500180621
031600180621
031700180621             chain pMember Member;
031800180621
031900180621             if %Found( Member );
032000180621                s2Name = %Trim( MFNAME );
032100180621
032200180621                if mmi > '';
032300180621                   s2Name = %Trim( s2Name ) + ' ' + %Trim( MMI );
032400180621                EndIf;
032500180621
032600180621                s2Name = %Trim( s2Name ) + ' ' + %Trim( MLNAME );
032700180621
032800180621             EndIf;
032900180621
033000180621          EndIf;
033100180621
033200180621
033300180621
033400180621          s2CrtMsg = 'Diary Note Created by ' +
033500180621             %Trim( wqUsrn ) + ' on ' +
033600180621             %Char(%date() :*usa) + ' at ' +
033700180621             %Char(%Time() :*usa);
033800180621
033900180621
034000180621       End-Proc;
034100180621
034200180621       // ----------------------------------------------------------------
034300180621       dcl-proc Load_data;
034400180620
034500180621          dcl-s wCount Zoned(5);
034600180621
034700180621
034800180621          Clear ViewScrTSA;
034900180621          Clear ViewScrMBR;
035000180620
035100180621          Load_Header();
035200180621
035300180621          chain ( wKey : sfaddt : sfadti ) DiaryHd1;
035400180621
035500180621          s2CrtMsg = 'Diary Note Created by ' +
035600180621             %Trim( nhadus ) + ' on ' +
035700180621             %Char(%date(nhaddt) :*usa) + ' at ' +
035800180621             %Char(%Time(nhadti) :*usa);
035900180621
036000180621          s2CodeDesc = s1Code + ' - ' + %Trim( s1Descr ) ;
036100180621          s2Subj = nhSubj;
036200180621
036300180621          wCount = 1;
036400180621          s2Note = '';
036500180621          Setll ( wKey : sfAddt : sfadti )  DiaryDt1;
036600180621
036700180621          Dou %Eof(DiaryDt1);
036800180621             reade ( wKey : sfAddt : sfadti )  DiaryDt1;
036900180621             if %eof(DiaryDt1);
037000180621                leave;
037100180621             endif;
037200180621
037300180621             %Subst(s2Note : wCount : 70 ) = ndText;
037400180621             wCount = wCount + 70;
037500180621
037600180621             if wCount > 700;
037700180621                leave;
037800180621             EndIf;
037900180621
038000180621          Enddo;
038100180621
038200180621
038300180620
038400180621       end-proc;
038500180621
038600180621
038700180621       // ----------------------------------------------------------------
038800180621       dcl-proc $AddRecord;
038900180621
039000180621          dcl-s Note_Length Zoned(4);
039100180621          dcl-s wCount Zoned(5);
039200180621
039300180621          clear AddScrTSA;
039400180621          clear AddScrMBR;
039500180621          Load_Header();
039600180621
039700180621
039800180621          // Prefil the Codes Drop down with Member Notes
039900180621          if pMember > 0;
040000180621             s2Code = 'MN';
040100180621          EndIf;
040200180621
040300180621
040400180621          Dou btnExit = *on;
040500180621
040600180621
040700180621             if pMember = 0;
040800180621                exfmt AddScrTSA;
040900180621             else;
041000180621                exfmt AddScrMbr;
041100180621             endif;
041200180621
041300180621
041400180621
041500180621             if btnAccept = *on;
041600180621
041700180621                //-------------------------
041800180621                //
041900180621                // Write the Header
042000180621                //
042100180621                //-------------------------
042200180621                nhKey = wKey;
042300180621                nhCode = 'W'+ s2Code;
042400180621                nhSubj = s2Subj;
042500180621                nhaddt = %Dec(%Date);
042600180621                nhadti = %Dec(%Time);
042700180621                nhadus = wqUsrn;
042800180621
042900180621                write rDiaryhd;
043000180621
043100180621
043200180621
043300180621                //-------------------------
043400180621                //
043500180621                // Write the Detail
043600180621                //
043700180621                //-------------------------
043800180621                ndKey = nhKey;
043900180621                ndAddt = nhAddt;
044000180621                ndAdTi = nhAdTi;
044100180621
044200180621
044300180621                Note_Length = %Len( %Trim( s2Note ));
044400180621                wCount = 1;
044500180621                ndSeq# = 0;
044600180621
044700180621                dow wCount <= Note_Length;
044800180621
044900180621                   ndSeq# = ndSeq# + 1;
045000180621                   ndText = %SubSt( s2Note : wCount : 70 );
045100180621
045200180621                   write rDiaryDt;
045300180621
045400180621                   wCount = wcount + 70;
045500180621
045600180621
045700180621                EndDo;
045800180621
045900180621
046000180621
046100180621                //-------------------------
046200180621                //
046300180621                // Write History Record.
046400180621                //
046500180621                //-------------------------
046600180621                hKey = wKey;
046700180621                trmFlg = '';
046800180621                TrlFlg = '';
046900180621                DtrFlg = 'N';
047000180621                hdSeq# = 0;
047100180621
047200180621                hOper = wqUsrn;
047300180621                hPrgnm = 'INQ019R';
047400180621                TrDate = %Dec( %date );
047500180621                hsTrTime = %Time;
047600180621
047700180621                hsTrst = pTrust;
047800180621                hsSub# = pSub;
047900180621                hsAcct = pAcct;
048000180621
048100180621                hsDltd = 'A';
048200180621
048300180621                ck#Not = nhSubj;
048400180621                Note2 = sDescr;
048500180621
048600180621                trCode = 'L81';
048700180621                if pMember > 0;
048800180621                   trCode = 'M81';
048900180621                EndIf;
049000180621
049100180621                Write Histr;
049200180621
049300180621                leave;
049400180621             EndIf;
049500180621
049600180621          EndDo;
049700180621
049800180621          reload = 'Y';
049900180621          btnExit = *off;
050000180621
050100180621       End-Proc;
050200180621
