000100180226       Ctl-opt option(*noDebugIo)  bnddir('GBSBIND')  DftActGrp(*no);
000200171229
000300171229      *-------------------------------------------------------------------------
000400171229      *
000500180226      *  Description: Search by Invoice Number
000600180115      *  Programmer.: Brian Rees
000700180226      *  Date.......: 02/26/2018
000800171229      *
000900171229      *-------------------------------------------------------------------------
001000171229
001100180115
001200171229      *-------------------------------------------------------------------------
001300171229      *
001400171229      * Declare Files
001500171229      *
001600171229      *-------------------------------------------------------------------------
001700180226       Dcl-f Inq015d WorkStn
001800171229          Handler('PROFOUNDUI(HANDLER)')
001900180226          SFILE(INVSFL:rrn);
002000180226
002100180226       Dcl-f Histtcd  ExtFile('F.HISTTCD') keyed;
002200180226       dcl-f AccMst   ExtFile('F.ACCMST')  keyed;
002300171229
002400170525
002500171229      *-------------------------------------------------------------------------
002600171229      *
002700171229      * Global Variables
002800171229      *
002900171229      *-------------------------------------------------------------------------
003000171229       Dcl-s rrn Zoned(5) inz;
003100171229       Dcl-s FirstRun Char(1) inz;
003200171229       Dcl-s Count Zoned(5) inz;
003300171229
003400180226       dcl-s mySearch  Char(30);
003500180226       dcl-s Row1Inv   Char(30);
003600180226       dcl-s RowxInv   Char(30);
003700180226
003800180115       dcl-c digits '0123456789';
003900170525
004000170605
004100171229      *-------------------------------------------------------------------------
004200171229      *
004300171229      * Procedures
004400171229      *
004500171229      *-------------------------------------------------------------------------
004600180226       dcl-pr AccountInq ExtPgm('INQ008R');
004700180226          oTrst Zoned(3);
004800180226          oSub# Zoned(3);
004900180226          oAcct Zoned(4);
005000180226       End-Pr;
005100180226
005200180226       dcl-s oTrst Zoned(3);
005300180226       dcl-s oSub# Zoned(3);
005400180226       dcl-s oAcct Zoned(4);
005500161111
005600171229      *-------------------------------------------------------------------------
005700171229      *
005800171229      * Mainline Program
005900171229      *
006000171229      *-------------------------------------------------------------------------
006100170525
006200170525
006300180115       Dou btnCancel = *on;
006400161109
006500180115          ClearS1();
006600180115
006700180115          //   Validate Search Value
006800180115          ErrSearch = *off;
006900180226          if %Check( Digits : %Trim( SrchInv )) > 0;
007000180115             ErrSearch = *on;
007100180115          EndIf;
007200180223
007300180115          // Only display if there isn't an error
007400180115          if ErrSearch = *off;
007500180226
007600180226             // Searching for Name or SSN?
007700180226             SetPosS1();
007800180226             LoadS1();
007900180226
008000180226
008100180115          endif;
008200161109
008300180115          DisplyS1();
008400161109
008500170528
008600180115          //?Process Selections
008700180115          Select;
008800170528
008900180115          other;
009000180115             ReadChangedS1();
009100180115          EndSl;
009200161109
009300180115       enddo;
009400161109
009500180115       *inlr = *on;
009600180115
009700161109
009800170525       // ----------------------------------------------------------------
009900180115       dcl-proc SetPosS1;
010000170525
010100170529          Select;
010200170525          When FirstRun = 'Y';       //?First Load
010300170529             FirstRun = 'N';
010400180226             mySearch = '';
010500180226             setll mySearch Histtcd;
010600170527
010700170529          When btnSearch = *on;
010800170529             btnSearch = *off;
010900180226             if %len(%Trim( SrchInv )) = 6;
011000180226                mySearch = 'INV#- ' + %Trim(SrchInv);
011100180226             else;
011200180226                mySearch = 'INV#-' + %Trim(SrchInv);
011300180226             endif;
011400180226
011500180226
011600180223
011700180226             setll mySearch Histtcd;
011800170529
011900170529          When PageDown = *On;
012000180226             Setll RowxInv Histtcd;
012100170527
012200170527
012300170529          When PageUp = *On;
012400180226             Setll Row1Inv Histtcd;
012500171229             Prev();
012600170530
012700170530          other;
012800180226             Setll Row1Inv Histtcd;
012900170530
013000170529          EndSL;
013100170527
013200171229       End-Proc;
013300171229
013400170525       // ----------------------------------------------------------------
013500171229
013600171229       dcl-proc Prev;
013700170525
013800170525          count = 0;
013900170525
014000170525          //?Read the previous 10 records to set the pointer
014100170525          //?to the right spot.
014200180226          Dou %Eof(Histtcd);
014300180226             readp Histtcd;
014400180226             if %eof(Histtcd);
014500170527                leave;
014600170527             endif;
014700170528
014800180223             Count = Count + 1;
014900180226             RowxInv = ck#not;
015000180115
015100180115             if Count = 20;
015200170527                leave;
015300170527             endif;
015400170527          enddo;
015500170527
015600180226          Setll RowxInv  Histtcd;
015700170527
015800171229       End-Proc;
015900171229
016000161109       // ----------------------------------------------------------------
016100171229
016200180115       dcl-proc ClearS1;
016300161109
016400161110          //?Clear the Subfile
016500161110          ClrSfl = *on;
016600180115          Write Screen1;
016700161110          ClrSfl = *off;
016800161110          rrn = 0;
016900161109
017000171229       end-Proc;
017100161109       // ----------------------------------------------------------------
017200180115       dcl-proc LoadS1;
017300161109
017400180226
017500180226          Count = 0;
017600180226          Dou %Eof(Histtcd);
017700180226             Read Histtcd;
017800170527
017900180226             if %eof(Histtcd);
018000170529                leave;
018100170529             endif;
018200170527
018300170529             Count = count + 1;
018400170527
018500170527
018600170529             if Count = 1;
018700180226                Row1Inv = ck#not;
018800170529             endif;
018900170527
019000180226             RowxInv = ck#not;
019100180223
019200180226             s1InvNbr = %Subst( ck#not : 6 : 10 );
019300180226             s1Amount = trAmt;
019400180226             s1TranDt  = %Char(%Date(trdate:*iso):*Usa);
019500180226             s1Account = %Editc( HsTrst : 'X' ) + '-' +
019600180226                %Editc( HsSub# : 'X' ) + '-' +
019700180226                %Editc( HsAcct : 'X' );
019800180223
019900180226             s1Trst = hsTrst;
020000180226             s1Sub = hsSub#;
020100180226             s1Acct = hsacct;
020200180226
020300180226             s1actname = '';
020400180226             chain ( hsTrst : hsSub# : hsAcct ) AccMst;
020500180226             if %Found( AccMst ) ;
020600180226                s1actname = acnam1;
020700180226             EndIf;
020800180223
020900180226
021000180223
021100180223             rrn = rrn + 1;
021200180226             write InvSfl;
021300170528
021400170528
021500171122             if rrn = 20;
021600170525                leave;
021700170527             endif;
021800170525
021900170529          enddo;
022000170527
022100170527
022200170529          //?Setup Directional Links.
022300170529          //?Page Down
022400170529          EnableDown = *On;
022500170527
022600180226          Setgt RowxInv Histtcd;
022700180226          read  Histtcd;
022800180226          if %eof(Histtcd);
022900170529             EnableDown = *Off;
023000170529          endif;
023100170527
023200170529          //?Page Up
023300170529          EnableUp = *On;
023400170527
023500180226          Setll Row1Inv Histtcd;
023600180226          readp Histtcd;
023700180226          if %eof(Histtcd);
023800170529             EnableUp = *Off;
023900170529          endif;
024000170527
024100161109
024200171229       end-proc;
024300161109
024400161109       // ----------------------------------------------------------------
024500171229
024600180115       dcl-proc DisplyS1;
024700161109
024800161110          DspSfl = *on  ;
024900180115          exfmt Screen1;
025000161110          DspSfl = *off;
025100161109
025200171229       end-proc;
025300171229
025400161109       // ----------------------------------------------------------------
025500171229
025600180115       dcl-proc ReadChangedS1;
025700161109
025800161109          Dou *in95 = *ON;
025900180226             READC InvSfl;
026000161109             *in95 = %EOF;
026100161109
026200161109             If *in95 = *OFF;
026300161109
026400180226                If SelInv = *on;
026500180226
026600180226                   // Go Directly to application;
026700180226                   oTrst = s1Trst;
026800180226                   oSub# = s1Sub ;
026900180226                   oAcct = s1Acct;
027000180226
027100180226                   //Clear Screen1;
027200180226                   AccountInq( oTrst : oSub# : oAcct );
027300161109                endIf;
027400170320
027500180226                SelInv= *off;
027600180226                update InvSfl;
027700161109
027800161109             endIf;
027900161118
028000161109
028100161109          enddo;
028200171229       end-proc;
028300161109
