000100171229
000200171229       Ctl-opt option(*noDebugIo)  bnddir('GBSBIND')  DftActGrp(*no)
000300190509         ActGrp(*New);
000400171229
000500180102      *-------------------------------------------------------------------------
000600180102      *
000700180102      *  Description: Coverage Plan Inquiry
000800180102      *  Programmer.: Brian Rees
000900180102      *  Date.......: 11/09/2017
001000180102      *
001100171120      *  Called from the Inquiry Program ( INQ001R )
001200171120      *  Account Inquiry ( INQ002R )
001300171120      *  Commission Control ( INQ009R )
001400171120      *  Right Click on a Plan - Plan Inquiry
001500171229      *
001600180102      *-------------------------------------------------------------------------
001700190509      * Modifications
001800190509      *
001900190509      * Date         Programmer    Mod      Description
002000190509      *-------------------------------------------------------------------------
002100190509      * 05/09/2019   B.Rees
002200190509      *   Added Deb Card Info.
002300190509      *
002400190509      *
002500190509      *
002600190509      *-------------------------------------------------------------------------
002700171229
002800171229
002900171229      *-------------------------------------------------------------------------
003000171229      *
003100171229      * Declare Files
003200171229      *
003300171229      *-------------------------------------------------------------------------
003400171229
003500180102       Dcl-f Inq010d Workstn
003600190509         HANDLER('PROFOUNDUI(HANDLER)');
003700171229
003800171229       Dcl-f PlnMst ExtDesc('F.PLNMST') ExtFile(*extdesc) keyed;
003900171229       Dcl-f AccMst ExtDesc('F.ACCMST') ExtFile(*extdesc) keyed;
004000171229       dcl-f TrsMst ExtDesc('F.TRSMST') ExtFile(*extdesc) keyed;
004100180102       dcl-f SubMst ExtDesc('F.SUBMST') ExtFile(*extdesc) keyed;
004200171227       Dcl-f CodesL1 ExtDesc('F.CODESL1') ExtFile(*extdesc) keyed;
004300171227       Dcl-f CarMst  ExtDesc('F.CARMST')  ExtFile(*extdesc) keyed;
004400190509       dcl-f Code20P keyed;
004500170420
004600171229       dcl-f oePlan Keyed;
004700171229
004800171229
004900171229      *-------------------------------------------------------------------------
005000171229      *
005100171229      * Global Variables
005200171229      *
005300171229      *-------------------------------------------------------------------------
005400190509       dcl-s wType Char(10) inz('DEBITCODES');
005500190509       dcl-s wCode Char(20);
005600180404
005700180404      *-------------------------------------------------------------------------
005800180404      *
005900180404      * *Entry Procedure
006000180404      *
006100180404      *-------------------------------------------------------------------------
006200180404       Dcl-pr Main ExtPgm;
006300190509         *N  Zoned(3);
006400190509         *N  Zoned(3);
006500190509         *N  Zoned(4);
006600190509         *N  Char(4);
006700180404       End-Pr;
006800180404
006900180404       dcl-pi Main;
007000190509         pTrst  Zoned(3);
007100190509         pSub#  Zoned(3);
007200190509         pAcct  Zoned(4);
007300190509         pPlan  Char(4);
007400180404       End-Pi;
007500180404
007600171113
007700180102      *-------------------------------------------------------------------------
007800171229      *
007900180102      * Mainline Program
008000171229      *
008100180102      *-------------------------------------------------------------------------
008200170905
008300180404
008400180404
008500170905       //----------------------------------------------------------
008600180102       // Load Screen
008700170905       //----------------------------------------------------------
008800171113
008900171113
009000171109       Dou btnBack = *on;
009100161109
009200190509         chain ( pTrst ) trsMst;
009300190509         chain ( pTrst : pSub# ) SubMst;
009400190509         chain ( pTrst : pSub# : pAcct ) AccMst;
009500171113
009600171113
009700190509         chain ( pTrst : pSub# : pPlan ) PlnMst;
009800190509         chain ( pTrst : pSub# : pPlan ) oePlan;
009900161109
010000171227
010100190509         // Get the Carrier Descr
010200190509         chain pcarr CarMst;
010300171227
010400190509         // Get the Plan Descr
010500190509         chain  plnCat Codesl1;
010600190509
010700190509         s1DebDesc = '';
010800190509         if pDebit > '';
010900190509
011000190509           wCode = pDebit;
011100190509           chain ( wType : wCode ) Code20p;
011200190509           if %Found( Code20p );
011300190509             s1DebDesc = c20lDesc;
011400190509           EndIf;
011500190509         EndIf;
011600190509
011700171227
011800190509         Exfmt Screen1;
011900171113
012000171227
012100161109
012200170901       enddo;
012300161109
012400170901       *inlr = *on;
012500161109
