000100180620       Ctl-opt option(*noDebugIo)   DftActGrp(*no)
000200180620          bnddir('GBSBIND' : 'GBSBDIR');
000300180620
000400180620      *-------------------------------------------------------------------------
000500180620      *
000600180620      *  Description:
000700180620      *  Programmer.:  Brian Rees
000800180620      *  Date.......:  06/20/2018
000900180620      *
001000180620      *-------------------------------------------------------------------------
001100180620
001200180620      *-------------------------------------------------------------------------
001300180620      *
001400180620      * Declare Files
001500180620      *
001600180620      *-------------------------------------------------------------------------
001700180620
001800180622       Dcl-f DiaryHd1 keyed ExtDesc('F.DIARYHD1') ExtFile(*extdesc);
001900180622       Dcl-f DiaryDt1 keyed ExtDesc('F.DIARYDT1') ExtFile(*extdesc);
002000180621       Dcl-f Codesl1 keyed ExtDesc('F.CODESL1') ExtFile(*extdesc);
002100180621
002200180621
002300180621       Dcl-f TrsMst keyed ExtDesc('F.TRSMST') ExtFile(*extdesc);
002400180621       Dcl-f SubMst keyed ExtDesc('F.SUBMST') ExtFile(*extdesc);
002500180621       Dcl-f AccMst keyed ExtDesc('F.ACCMST') ExtFile(*extdesc);
002600180621       Dcl-f Member keyed ExtDesc('F.MEMBER') ExtFile(*extdesc);
002700180622
002800180622       dcl-f inq019p1 printer;
002900180620
003000180620      *-------------------------------------------------------------------------
003100180620      *
003200180620      * Global Variables
003300180620      *
003400180620      *-------------------------------------------------------------------------
003500180621       dcl-s wKey Char(10);
003600180621       dcl-s wSocial Char(9);
003700180622       dcl-s wCount Zoned(4);
003800180622       dcl-s HoldText Char(100);
003900180622       dcl-s pos Zoned(5);
004000180620
004100180620
004200180620      *------------------------------------------------------------------
004300180620      *
004400180620      * Procedures
004500180620      *
004600180620      *------------------------------------------------------------------
004700180620
004800180620
004900180620
005000180621      *-------------------------------------------------------------------------
005100180621      *
005200180621      * *Entry Procedure
005300180621      *
005400180621      *-------------------------------------------------------------------------
005500180621       //Dcl-pr Main ExtPgm;
005600180621       //   *N  Zoned(3);
005700180621       //   *N  Zoned(3);
005800180621       //   *N  Zoned(4);
005900180621       //   *N  Zoned(9);
006000180622       //   *N  Char(10);
006100180622       //   *N  Zoned(8);
006200180622       //   *N  Zoned(6);
006300180622
006400180621       //End-Pr;
006500180621       //
006600180621       //dcl-pi Main;
006700180621       //   pTrust  Zoned(3);
006800180621       //   pSub    Zoned(3);
006900180621       //   pAcct   Zoned(4);
007000180621       //   pMember Zoned(9);
007100180622       //   pKey    Char(10);
007200180622       //   pDate   Zoned(8);
007300180622       //   pTime   Zoned(8);
007400180621       //End-Pi;
007500180622
007600180620
007700180621       dcl-s pTrust  Zoned(3) inz(888);
007800180621       dcl-s  pSub    Zoned(3) inz(1);
007900180621       dcl-s  pAcct   Zoned(4) inz(5);
008000180621       dcl-s  pMember Zoned(9) inz(888015005);
008100180622       dcl-s  pKey    Char(10) inz(' 888015005');
008200180622       dcl-s  pDate   Zoned(8) inz(20180622);
008300180622       dcl-s  pTime   Zoned(6) inz(63631);
008400180622
008500180622
008600180622
008700180621
008800180620      *-------------------------------------------------------------------------
008900180620      *
009000180620      * Mainline Program
009100180620      *
009200180620      *-------------------------------------------------------------------------
009300180621
009400180622
009500180622
009600180622       //----------------------------------------------------
009700180622       //
009800180622       // Print Member Notes
009900180622       //
010000180622       //----------------------------------------------------
010100180622
010200180622       if pMember > 0;
010300180622
010400180622
010500180622          // Header
010600180622          chain ( pKey : pDate : pTime ) DiaryHd1;
010700180622          chain pMember Member;
010800180622
010900180622          wSocial = %Editc( pMember : 'X' );
011000180622
011100180622          hSSN  =
011200180622             %Subst(wSocial: 1: 3 ) + '-' +
011300180622             %Subst(wSocial: 4: 2 ) + '-' +
011400180622             %Subst(wSocial: 6: 4 );
011500180622
011600180622
011700180622          hName = %Trim( MFNAME );
011800180622
011900180622          if mmi > '';
012000180622             hName = %Trim( hName ) + ' ' + %Trim( MMI );
012100180622          EndIf;
012200180622
012300180622          hName = %Trim( hName ) + ' ' + %Trim( MLNAME );
012400180622
012500180622          heDate = %Char(%Date(nhaddt:*iso):*Usa);
012600180622          heTime =  %Char(%Time(nhadti:*iso):*Usa);
012700180622
012800180622          hCode =  %Subst( nhCode : 2 : 2 );
012900180622
013000180622          chain nhCode Codesl1;
013100180622          if %Found( Codesl1 );
013200180622             hCode = %Trim( hCode ) + ' - ' + sDescr;
013300180622          EndIf;
013400180622
013500180622          hSubj = nhSubj;
013600180622
013700180622          Write Header_M;
013800180622
013900180622
014000180622
014100180622          // Detail
014200180622          wCount = 1;
014300180622          Setll ( pKey : pDate : pTime )  DiaryDt1;
014400180622
014500180622          Dou %Eof(DiaryDt1);
014600180622             reade ( pKey : pDate : pTime )  DiaryDt1;
014700180622             if %eof(DiaryDt1);
014800180622                leave;
014900180622             endif;
015000180622
015100180622
015200180622             holdText = ndText;
015300180622             pos = %scan(x'25': HoldText);
015400180622             if pos > 0;
015500180622                holdText = %Scanrpl(x'25' : x'0d25' : holdText);
015600180622             endif;
015700180622
015800180622
015900180622           //  d_RCD = ndText;
016000180622             d_Rcd = holdText;
016100180622             write Detl01;
016200180622
016300180622             wCount = wCount + 70;
016400180622
016500180622             if wCount > 700;
016600180622                leave;
016700180622             EndIf;
016800180622
016900180622          Enddo;
017000180622
017100180622
017200180622          // Footer
017300180622          fDate = %Char(%Date : *Usa);
017400180622          Write Footer;
017500180622
017600180622
017700180622
017800180622       EndIf;
017900180622
018000180622
018100180622
018200180622       //----------------------------------------------------
018300180622       //
018400180622       // Print Account Notes
018500180622       //
018600180622       //----------------------------------------------------
018700180622
018800180622       if pMember = 0;
018900180622          chain ( pTrust : pSub : pAcct ) ACCMST;
019000180622       endif;
019100180622
019200180622
019300161109
019400161109       *inlr = *on;
019500161109
