000100180620       Ctl-opt option(*noDebugIo)   DftActGrp(*no)
000200180620          bnddir('GBSBIND' : 'GBSBDIR');
000300180620
000400180620      *-------------------------------------------------------------------------
000500180620      *
000600180620      *  Description:
000700180620      *  Programmer.:  Brian Rees
000800180620      *  Date.......:  06/20/2018
000900180620      *
001000180620      *-------------------------------------------------------------------------
001100180620
001200180620      *-------------------------------------------------------------------------
001300180620      *
001400180620      * Declare Files
001500180620      *
001600180620      *-------------------------------------------------------------------------
001700180620
001800180622       Dcl-f DiaryHd1 keyed ExtDesc('F.DIARYHD1') ExtFile(*extdesc);
001900180622       Dcl-f DiaryDt1 keyed ExtDesc('F.DIARYDT1') ExtFile(*extdesc);
002000180621       Dcl-f Codesl1 keyed ExtDesc('F.CODESL1') ExtFile(*extdesc);
002100180621
002200180621
002300180621       Dcl-f TrsMst keyed ExtDesc('F.TRSMST') ExtFile(*extdesc);
002400180621       Dcl-f SubMst keyed ExtDesc('F.SUBMST') ExtFile(*extdesc);
002500180621       Dcl-f AccMst keyed ExtDesc('F.ACCMST') ExtFile(*extdesc);
002600180621       Dcl-f Member keyed ExtDesc('F.MEMBER') ExtFile(*extdesc);
002700180622
002800180622       dcl-f inq019p2 Workstn
002900180622          Handler('UNIVERSAL(HANDLER)');
003000180622
003100180620
003200180620      *-------------------------------------------------------------------------
003300180620      *
003400180620      * Global Variables
003500180620      *
003600180620      *-------------------------------------------------------------------------
003700180621       dcl-s wKey Char(10);
003800180621       dcl-s wSocial Char(9);
003900180622       dcl-s wCount Zoned(4);
004000180622       dcl-s HoldText Char(100);
004100180622       dcl-s pos Zoned(5);
004200180620
004300180620
004400180620      *------------------------------------------------------------------
004500180620      *
004600180620      * Procedures
004700180620      *
004800180620      *------------------------------------------------------------------
004900180620
005000180620
005100180620
005200180621      *-------------------------------------------------------------------------
005300180621      *
005400180621      * *Entry Procedure
005500180621      *
005600180621      *-------------------------------------------------------------------------
005700180621       //Dcl-pr Main ExtPgm;
005800180621       //   *N  Zoned(3);
005900180621       //   *N  Zoned(3);
006000180621       //   *N  Zoned(4);
006100180621       //   *N  Zoned(9);
006200180622       //   *N  Char(10);
006300180622       //   *N  Zoned(8);
006400180622       //   *N  Zoned(6);
006500180622
006600180621       //End-Pr;
006700180621       //
006800180621       //dcl-pi Main;
006900180621       //   pTrust  Zoned(3);
007000180621       //   pSub    Zoned(3);
007100180621       //   pAcct   Zoned(4);
007200180621       //   pMember Zoned(9);
007300180622       //   pKey    Char(10);
007400180622       //   pDate   Zoned(8);
007500180622       //   pTime   Zoned(8);
007600180621       //End-Pi;
007700180622
007800180620
007900180621       dcl-s pTrust  Zoned(3) inz(888);
008000180621       dcl-s  pSub    Zoned(3) inz(1);
008100180621       dcl-s  pAcct   Zoned(4) inz(5);
008200180621       dcl-s  pMember Zoned(9) inz(888015005);
008300180622       dcl-s  pKey    Char(10) inz(' 888015005');
008400180622       dcl-s  pDate   Zoned(8) inz(20180622);
008500180622       dcl-s  pTime   Zoned(6) inz(63631);
008600180622
008700180622
008800180622
008900180621
009000180620      *-------------------------------------------------------------------------
009100180620      *
009200180620      * Mainline Program
009300180620      *
009400180620      *-------------------------------------------------------------------------
009500180621
009600180622
009700180622
009800180622       //----------------------------------------------------
009900180622       //
010000180622       // Print Member Notes
010100180622       //
010200180622       //----------------------------------------------------
010300180622
010400180622       if pMember > 0;
010500180622
010600180622
010700180622          // Header
010800180622          chain ( pKey : pDate : pTime ) DiaryHd1;
010900180622          chain pMember Member;
011000180622
011100180622          wSocial = %Editc( pMember : 'X' );
011200180622
011300180622          hSSN  =
011400180622             %Subst(wSocial: 1: 3 ) + '-' +
011500180622             %Subst(wSocial: 4: 2 ) + '-' +
011600180622             %Subst(wSocial: 6: 4 );
011700180622
011800180622
011900180622          hName = %Trim( MFNAME );
012000180622
012100180622          if mmi > '';
012200180622             hName = %Trim( hName ) + ' ' + %Trim( MMI );
012300180622          EndIf;
012400180622
012500180622          hName = %Trim( hName ) + ' ' + %Trim( MLNAME );
012600180622
012700180622          //   heDate = %Char(%Date(nhaddt:*iso):*Usa);
012800180622          //   heTime =  %Char(%Time(nhadti:*iso):*Usa);
012900180622          //
013000180622          //   hCode =  %Subst( nhCode : 2 : 2 );
013100180622          //
013200180622          //   chain nhCode Codesl1;
013300180622          //   if %Found( Codesl1 );
013400180622          //      hCode = %Trim( hCode ) + ' - ' + sDescr;
013500180622          //   EndIf;
013600180622          //
013700180622          //   hSubj = nhSubj;
013800180622          //
013900180622          Write Header_M;
014000180622
014100180622
014200180622
014300180622          // Detail
014400180622          wCount = 1;
014500180622          Setll ( pKey : pDate : pTime )  DiaryDt1;
014600180622
014700180622          Dou %Eof(DiaryDt1);
014800180622             reade ( pKey : pDate : pTime )  DiaryDt1;
014900180622             if %eof(DiaryDt1);
015000180622                leave;
015100180622             endif;
015200180622
015300180622
015400180622             //      holdText = ndText;
015500180622             //      pos = %scan(x'25': HoldText);
015600180622             //      if pos > 0;
015700180622             //         holdText = %Scanrpl(x'25' : x'0d25' : holdText);
015800180622             //      endif;
015900180622             //
016000180622
016100180622             d_RCD = ndText;
016200180622             // d_Rcd = holdText;
016300180622             write Detl01;
016400180622
016500180622             wCount = wCount + 70;
016600180622
016700180622             if wCount > 700;
016800180622                leave;
016900180622             EndIf;
017000180622
017100180622          Enddo;
017200180622
017300180622
017400180622       // Footer
017500180622       //fDate = %Char(%Date : *Usa);
017600180622       //Write Footer;
017700180622
017800180622
017900180622
018000180622       EndIf;
018100180622
018200180622
018300180622
018400180622       //----------------------------------------------------
018500180622       //
018600180622       // Print Account Notes
018700180622       //
018800180622       //----------------------------------------------------
018900180622
019000180622       if pMember = 0;
019100180622          chain ( pTrust : pSub : pAcct ) ACCMST;
019200180622       endif;
019300180622
019400180622
019500161109
019600161109       *inlr = *on;
019700161109
