000100200207       Ctl-opt option(*noDebugIo)   DftActGrp(*no);
000200171229
000300171229      *-------------------------------------------------------------------------
000400171229      *
000500200520      *  Description: Medicare Information
000600200520      *  Date.......: 05/20/2020
000601200207      *  Programmer.: Brian Rees
000700171229      *
000800171229      *-------------------------------------------------------------------------
000900171229
001000180115
001100171229      *-------------------------------------------------------------------------
001200171229      *
001300171229      * Declare Files
001400171229      *
001500171229      *-------------------------------------------------------------------------
001600200520       Dcl-f INQ025D WorkStn
001700190102         Handler('PROFOUNDUI(HANDLER)')
001800200207         SFILE(LstSfl:rrn);
001900200207
002001200520       Dcl-f Member   keyed ExtDesc('F.MEMBER') ExtFile(*extdesc);
002002200520       Dcl-f Depend   keyed ExtDesc('F.DEPEND') ExtFile(*extdesc);
002003200520       dcl-f CFS100p  keyed;
002100190423
002200170525
002300171229      *-------------------------------------------------------------------------
002400171229      *
002500171229      * Global Variables
002600171229      *
002700171229      *-------------------------------------------------------------------------
002800171229       Dcl-s rrn Zoned(5) inz;
003200180315       dcl-s refresh ind;
004500180306
004600190731
004700190731
004800190731      *-------------------------------------------------------------------------
004900190731      *
005000190731      * *Entry Procedure
005100190731      *
005200190731      *-------------------------------------------------------------------------
005300200207       Dcl-pr Main ExtPgm;
005400200520         *N  Zoned(9);
005600200207       End-Pr;
005700200207
005800200207       dcl-pi Main;
005900200520         pSSN  Zoned(9);
006100200207       End-Pi;
006200190517
006300180316
006400171229      *-------------------------------------------------------------------------
006500171229      *
006600171229      * Mainline Program
006700171229      *
006800171229      *-------------------------------------------------------------------------
006803200207       Dou btnExit = *on;
006804200207
006805200207         ClearS1();
006806200207         LoadS1();
006810200207         DisplyS1();
006811200207
006812200207         if btnExit = *on;
006814200207           leave;
006815200207         EndIf;
006816200207
006829200207       enddo;
006830200207
006831200207       *inlr = *on;
006832200207
006833200207
006834200207
006835200207       // ----------------------------------------------------------------
006836200207       dcl-proc CLEARS1;
006837200207
006838200207         //-------------------------
006839200207         //
006840200207         // Clear the Subfile
006841200207         //
006842200207         //-------------------------
006843200207
006844200207         ClrSfl = *on;
006845200207         Write Screen1;
006846200207         ClrSfl = *off;
006847200207         rrn = 0;
006848200207
006849200207       End-Proc;
006850200207       // ----------------------------------------------------------------
006851200207       Dcl-Proc LoadS1;
006852200207
006853200520         //---------------------------------
006854200520         //
006855200520         // Get the Member Medicare Info.
006856200520         //
006857200520         //---------------------------------
006858200520         chain pssn Member;
006859200520         if %Found ( Member ) ;
006860200520           s1dseq = 0;
006861200520           s1FulName = %trim(mlName) +', '  + %trim( mfname );
006862200520
006863200520
006864200520           chain ( pssn : s1dseq ) Cfs100p;
006865200520           if %Found( cfs100p );
006866200520             s1FulName = %trim(cfslst) +', '  + %trim(cfsfst);
006867200520           EndIf;
006868200520
006869200520
006870200520           s1Medcr = Medicr;
006871200520           s1med# = med#;
006872200520
006873200520           // Med A Date
006874200520           s1medadt = '';
006875200520           if medadt > 0;
006876200520             test(de) *iso medadt;
006877200520             if  %Error;
006878200520               s1medadt = %Char(medadt);
006879200520             else;
006880200520               s1medadt = %Char(%date(medadt) :*usa)  ;
006881200520             endif;
006882200520           endif;
006883200520
006884200520
006885200520           // Med B Date
006886200520           s1medbdt = '';
006887200520           if medbdt > 0;
006888200520             test(de) *iso medbdt;
006889200520             if %Error;
006890200520               s1medbdt = %Char(medbdt);
006891200520             else;
006892200520               s1medbdt = %Char(%date(medbdt) :*usa)  ;
006893200520             endif;
006894200520           endif;
006895200520
006896200520           rrn = rrn + 1;
006897200520           write LstSfl;
006898200520
006899200520         endif;
006900200520
006901200520
006902200520
006903200520
006904200520         //---------------------------------
006905200520         //
006906200520         // Get the Dependent Medicare Info.
006907200520         //
006908200520         //---------------------------------
006909200520         Setll pssn Depend;
006910200520         Dou %eof(Depend);
006911200207
006912200520           reade pssn Depend;
006913200520           if %eof(Depend);
006914200207             leave;
006915200207           endif;
006916200207
006922200520           s1dseq = dpseq#;
006923200520           s1FulName = %trim(dlName) +', '  + %trim( dfname );
006925200520
006926200520           chain ( pssn : s1dseq ) Cfs100p;
006927200520           if %Found( cfs100p );
006928200520             s1FulName = %trim(cfslst) +', '  + %trim(cfsfst);
006929200520           EndIf;
006930200520
006931200520
006932200520           s1Medcr = dMedcr;
006933200520           s1med# = dmed#;
006934200520
006935200520           // Med A Date
006936200520           s1medadt = '';
006937200520           if dmedad > 0;
006938200520             test(de) *iso dmedad;
006939200520             if  %Error;
006940200520               s1medadt = %Char(dmedad);
006941200520             else;
006942200520               s1medadt = %Char(%date(dmedad) :*usa)  ;
006943200520             endif;
006944200520           endif;
006945200520
006946200520
006947200520           // Med B Date
006948200520           s1medbdt = '';
006949200520           if dmedbd > 0;
006950200520             test(de) *iso dmedbd;
006951200520             if %Error;
006952200520               s1medbdt = %Char(dmedbd);
006953200520             else;
006954200520               s1medbdt = %Char(%date(dmedbd) :*usa)  ;
006955200520             endif;
006956200520           endif;
006957200520
006961200207           rrn = rrn + 1;
006962200207           write LstSfl;
006963200207
006964200207
006965200207           If rrn >= 9999;
006966200207             leave;
006967200207           endIf;
006968200207
006969200207         enddo;
006970200207
006971200207       End-Proc;
006972200207
006973200207       // ----------------------------------------------------------------
006974200207       Dcl-Proc DisplyS1;
006975200207
006976200207         DspSfl = *on  ;
006977200207         exfmt Screen1;
006978200207         DspSfl = *off;
006979200207
006980200207       End-Proc;
