000100180724       Ctl-opt option(*noDebugIo)   DftActGrp(*no)
000200190510         bnddir( 'GBSBIND' );
000300180607
000400180607      *-------------------------------------------------------------------------
000500180607      *
000600190513      *  Description:  Print Salesperson / Relationship Report
000700180607      *
000800180607      *  Programmer.: Brian Rees
000900180607      *  Date.......: 06/07/2018
001000180607      *
001100180607      *-------------------------------------------------------------------------
001200180607
001300180607      *-------------------------------------------------------------------------
001400180607      *
001500180607      * Declare Files
001600180607      *
001700180607      *-------------------------------------------------------------------------
001800180917
001900190514       dcl-f INQ020P  usage( *output );
002000180917
002100190510       Dcl-f SMANRLT keyed ExtDesc('F.SMANRLT') ExtFile(*extdesc);
002200190510       Dcl-f SMAN    keyed ExtDesc('F.SMAN')    ExtFile(*extdesc);
002300190510
002400190513       Dcl-f SMANRLT1 keyed ExtDesc('F.SMANRLT1') ExtFile(*extdesc)
002500190513         rename( SRF : Rcd1 );
002600190513
002700190513       Dcl-f Agency  keyed ExtDesc('F.AGENCY') ExtFile(*extdesc);
002800190513       Dcl-f Supragcy keyed ExtDesc('F.SUPRAGCY') ExtFile(*extdesc);
002900190513       Dcl-f SPRAGXR2 keyed ExtDesc('F.SPRAGXR2') ExtFile(*extdesc);
003000190513
003100190510
003200180607
003300180607      *-------------------------------------------------------------------------
003400180607      *
003500180607      * Global Variables
003600180607      *
003700180607      *-------------------------------------------------------------------------
003800190510       dcl-s wPhone Char(7);
003900190513       dcl-s wSrsMan Like( SrsMan );
004000190513
004100180824
004200180824
004300180824      *-------------------------------------------------------------------------
004400180824      *
004500180824      * *Entry Procedure
004600180824      *
004700180824      *-------------------------------------------------------------------------
004800190510       Dcl-pr Main ExtPgm;
004900190513         *N  Char(8);
005000190510       End-Pr;
005100190510
005200190510       dcl-pi Main;
005300190513         pRelid Char(8);
005400190510       End-Pi;
005500180607
005600180724
005700180824
005800180724      *-------------------------------------------------------------------------
005900180724      *
006000180724      * Procedures
006100180724      *
006200180724      *-------------------------------------------------------------------------
006300190513
006400180607
006500180607      *-------------------------------------------------------------------------
006600180607      *
006700180607      * Mainline Program
006800180607      *
006900180607      *-------------------------------------------------------------------------
007000190513
007100190510       p1Date = %Char(%Date:*Usa);
007200190510
007300190510       chain pRelid SmanRlt;
007400190510       chain srsman sman;
007500190513       wSrsman = srsman;
007600190513
007700190510
007800190510       HSMANCD = smancd;
007900190510       HSFNAME = %Trim( slname ) + ', ' + %Trim( sfname ) + ' '  + smi;
008000190510       HSADDR  = saddr;
008100190510       hscsz   = %Trim( sCity ) + ', ' + SState + '  ' + %Char( sZipCD );
008200190510
008300190510       wPhone  = %Editc(sphone : 'X' );
008400190514       HPHONE  = %Editc(sArea : 'X' ) + ' ' +
008500190514         %Subst( wPhone : 1 : 3 ) + '-' +
008600190510         %Subst( wPhone : 4 );
008700190510
008800190510       HGRP  = sGrp;
008900190510       HTYPE  = %Subst( sType : 2 );
009000190510       HBEGDT =  %Char(%Date(sBegDt:*iso):*Usa);
009100190510
009200190510       if sEndDt > 0;
009300190510         HEndDT =  %Char(%Date(sEndDt:*iso):*Usa);
009400190510       EndIf;
009500190510
009600190510       hTin = %Subst(sTin: 1 : 2 ) + '-' + %Subst(sTin: 3);
009700190510       Write  PRTHEADER;
009800190513
009900190513
010000190513
010100190513       //----------------------------------------------------
010200190513       //
010300190513       //  Create Detail Records
010400190513       //
010500190513       //----------------------------------------------------
010600190513       Setll wSrsMan SmanRlt1;
010700190513
010800190513       Dou %Eof(SmanRlt1);
010900190513         reade wSrsMan SmanRlt1;
011000190513         if %eof(SmanRlt1);
011100190513           leave;
011200190513         endif;
011300190513
011400190513
011500190513         chain srsman Sman;
011600190513         dtype = %Subst( sType : 2 );
011700190513
011800190513
011900190513
012000190513         chain srasid spragxr2;
012100190513         chain sxSuper Supragcy;
012200190513
012300190513         DAGCY = sxAgcy;
012400190513         chain dagcy Agency;
012500190513
012600190513         dAgnam1 = agnam1;
012700190513         DSACODE = sxSuper;
012800190513         DSANAME = saname1;
012900190513
013000190513
013100190513         DEFFDATE = '';
013200190513         if srEffDte > 0;
013300190513           DEFFDATE = %Char(%Date(srEffDte:*iso):*Usa);
013400190513         endif;
013500190513
013600190513         DTERMDT = '';
013700190513         if srTrmDte > 0;
013800190513           DTERMDT = %Char(%Date(srTrmDte:*iso):*Usa);
013900190513         endif;
014000190513
014100190513         Write PRTDETAIL;
014200190513
014300190513
014400190513       Enddo;
014500190513
014600180607
014700180607       *inlr = *on;
014800180724
014900180917
