000100230707      *=========================================================================
000200230707     h dftactgrp(*no) option(*noDebugIo) bnddir('GBSBIND')
000300230707      *=========================================================================
000400230707      * INVHISTR = Retrive Invoice Totals by T/S/A, Date
000500230707      *=========================================================================
000600230707      * Date         Int  Description
000700230707      * ----------   ---  ------------------------------------------------------
000800230707      * 07/07/2023   jt   Original Creation
000900230707      *=========================================================================
001000230707
001100230707     fhistaa    if   e           k disk    rename(histr:histfile)
001200230707     f                                     extfile('F.HISTAA')
001300230707
001400230707     finvsum    if   e           k disk    rename(invsmr:invFile)
001500230707     f                                     extfile('F.INVSUM')
001600230814
001700230814     d r0dates         s              8s 0 dim( 100 )
001800230814
001900230814     d pos             s              5  0
002000230814     d poc             s              5  0
002100230707
002200230707     d trust           s              3  0
002300230707     d sub             s              3  0
002400230707     d acct            s              4  0
002500230707     d date            s              8  0
002600230707     d dateISO         s               d
002700230707     d tsa             s             10
002800230706
002900230815     d invhistrx       pi
003000230707     d  inTrust                       3
003100230707     d  inSub                         3
003200230707     d  inAcc                         4
003300230707     d  inDate                        8
003400230814     d  outAMt                       12  2
003500230814     d  rvdates                      13    dim(10)
003600230707
003700230707      //========================================================================
003800230707      // mainline
003900230707      //========================================================================
004000230707
004100230707       exsr init;
004200230707       exsr main;
004300230707       exsr exit;
004400230707
004500230707      //========================================================================
004600230707      // main
004700230707      //========================================================================
004800230707
004900230707       begsr main;
005000230707
005100230707        chain (trust : sub : acct : date : 'KEB') invFile;
005200230707        if %found;
005300230707
005400230707         setll (tsa : 'BMP') histFile;
005500230707         reade (tsa : 'BMP') histFile;
005600230707         dow not %eof;
005700230707
005800230707          if hinvdt = date;
005900230707           outAmt = outAmt + tramt;
006000230814
006100230814            if RECVDT > 0;
006200230814            pos = %lookup( RECVDT : r0dates ) ;
006300230814            if pos = 0;
006400230814            pos = %lookup( 0 : r0dates ) ;
006500230814            if pos > 0;
006600230814            r0dates(pos) = RECVDT;
006700230814            endif;
006800230814            endif;
006900230814            endif;
007000230815
007100230815            if pos > 12;
007200230815            pos = pos;
007300230815            endif;
007400230814
007500230707          endif;
007600230707
007700230707         reade (tsa : 'BMP') histFile;
007800230707         enddo;
007900230707
008000230707        else;
008100230707
008200230707         setll (tsa : 'BMP') histFile;
008300230707         reade (tsa : 'BMP') histFile;
008400230707         dow not %eof;
008500230707
008600230707          if hinvdt = 0;
008700230707           outAmt = outAmt + tramt;
008800230814
008900230815
009000230815            if RECVDT > 0;
009100230815            pos = %lookup( RECVDT : r0dates ) ;
009200230815            if pos = 0;
009300230815            pos = %lookup( 0 : r0dates ) ;
009400230815            if pos > 0;
009500230815            r0dates(pos) = RECVDT;
009600230815            endif;
009700230815            endif;
009800230815            endif;
009900230815
010000230815            if pos > 12;
010100230815            pos = pos;
010200230815            endif;
010300230814
010400230707          endif;
010500230707
010600230707         reade (tsa : 'BMP') histFile;
010700230707         enddo;
010800230707
010900230707        endif;
011000230707
011100230707       endsr;
011200230707
011300230706
011400230707      //========================================================================
011500230707      // exit
011600230707      //========================================================================
011700230707
011800230707       begsr exit;
011900230707
012000230707        *inlr = '1';
012100230707        return;
012200230707
012300230707       endsr;
012400230707
012500230707      //========================================================================
012600230707      // init
012700230707      //========================================================================
012800230707
012900230707       begsr init;
013000230707
013100230707        trust = %dec(inTrust:3:0);
013200230707        sub = %dec(inSub:3:0);
013300230707        acct = %dec(inAcc:4:0);
013400230707
013500230707        date = %dec(inDate:8:0);
013600230707        dateISO = %date(date) + %months(1);
013700230707        date = %dec(dateISO);
013800230707
013900230707        tsa = inTrust + inSub + inAcc;
014000230814
014100230814        clear  r0dates;
014200230814        clear  rvdates;
014300230707
014400230707        outAmt = 0;
014500230707
014600230707       endsr;
014700230814      *___________________________________________________________________
014800230814      * Format Date
014900230814      *___________________________________________________________________
015000230814     C     FormatDateSR  BEGSR
015100230814     C                   Call      'FMTDATE'
015200230814     C                   Parm                    Input_Date       32
015300230814     C                   Parm                    Input_Format     32
015400230814     C                   Parm                    Output_Format    32
015500230814     C                   Parm                    Output_Date      32
015600230814     C                   Parm                    Output_Error     10
015700230814     C                   Eval      Input_Date   = *blanks
015800230814     C                   Eval      Input_Format = *blanks
015900230814     C                   Eval      OutPut_Format = *blanks
016000230814     C                   ENDSR
016100230707
016200230707      //========================================================================
