000100150929     FIRS95CP   IPE  E           K DISK
000200150929     FIRSCSVP   O  A F 8000        DISK
000300050823   X***X
000400150929     D @OUTPUT         S           8000A   INZ
000500051108     D @C              C                   CONST('","')
000600051108    ***
0007000704030025  *
0008000704030250 D                 DS
0009001507280251 D  iftrst                 1      3  0
0010001507280251 D   cstrst                1      3
0011001507280025  *
0012001507280250 D                 DS
0013001507280251 D  ifsub#                 1      3  0
0014001507280251 D   cssub#                1      3
0015001507280025  *
0016001507280250 D                 DS
0017001507280251 D  ifacct                 1      4  0
0018001507280251 D   csacct                1      4
0019001507280025  *
0020001507280250 D                 DS
0021001507280251 D  ifmssn                 1      9  0
0022001507280251 D   csmssn                1      9
0023001507280025  *
0024001507280250 D                 DS
0025001507280251 D  ifiss#                 1      6  0
0026001507280251 D   csiss#                1      6
0027001507020025  *
0028000704030025  *
0029000704030250 D                 DS
0030001507020251 D  txhveff                1      8  0
0031001507020251 D   axhveff               1      8
0032001507020250 D                 DS
0033001507280037 D wkdate          S               D   datfmt(*iso)
003400150728     D usadt           S               D   DATFMT(*USA/)
003500081114   X* *
003600150728    * *
003700150728     C     codkey        KLIST
003800150728     C                   KFLD                    cktyp             1
003900150728     C                   KFLD                    ckcod             3
004000110419      *
004100150728      *
004200150728      *
004300150728     C                   CLEAR                   @OUTPUT
004400150929     C                   EVAL      @OUTPUT = '"' + %TRIM(i5enm1) + '"' + ',' +
004500150929     C                             '"' + %TRIM(i5enm2) + '"' + ',' +
004600150929     C                             '"' + %TRIM(i5ead1) + '"' + ',' +
004700150929     C                             '"' + %TRIM(i5ead2) + '"' + ',' +
004800150929     C                             '"' + %TRIM(i5ecty) + '"' + ',' +
004900150929     C                             %TRIM(i5est) + ',' +
005000190103     C                             %TRIM(i5ezip) + ',' +
005100150929     C                             %TRIM(i5ephn) + ',' +
005200150929     C                             %TRIM(i5epex) + ',' +
005300150929     C                             %TRIM(i5eid) + ',' +
005400150929     C                             %TRIM(i5mssn) + ',' +
005500150929     C                             '"' + %TRIM(i5mfnm) + '"' + ',' +
005600150929     C                             %TRIM(i5mmi) + ',' +
005700150929     C                             '"' + %TRIM(i5mlnm) + '"' + ',' +
005800150929     C                             '"' + %TRIM(i5mad1) + '"' + ',' +
005900150929     C                             '"' + %TRIM(i5mad2) + '"' + ',' +
006000150929     C                             '"' + %TRIM(i5mcty) + '"' + ',' +
006100150929     C                             %TRIM(i5mst) + ',' +
006200190103     C                             %TRIM(i5mzip) + ',' +
006300150929     C                             '"' + %TRIM(i5meml) + '"' + ',' +
006400150929     C                             %TRIM(i5mmsc) + ',' +
006500150929     C                             %TRIM(i5mpls) + ',' +
006600150929     C                             %TRIM(i5mcall) + ',' +
006700150929     C                             %TRIM(i5mcm1) + ',' +
006800150929     C                             %TRIM(i5mcm2) + ',' +
006900150929     C                             %TRIM(i5mcm3) + ',' +
007000150929     C                             %TRIM(i5mcm4) + ',' +
007100150929     C                             %TRIM(i5mcm5) + ',' +
007200150929     C                             %TRIM(i5mcm6) + ',' +
007300150929     C                             %TRIM(i5mcm7) + ',' +
007400150929     C                             %TRIM(i5mcm8) + ',' +
007500150929     C                             %TRIM(i5mcm9) + ',' +
007600150929     C                             %TRIM(i5mcm10) + ',' +
007700150929     C                             %TRIM(i5mcm11) + ',' +
007800150929     C                             %TRIM(i5mcm12) + ',' +
007900150929     C                             %TRIM(i5msall) + ',' +
008000150929     C                             %TRIM(i5msm1) + ',' +
008100150929     C                             %TRIM(i5msm2) + ',' +
008200150929     C                             %TRIM(i5msm3) + ',' +
008300150929     C                             %TRIM(i5msm4) + ',' +
008400150929     C                             %TRIM(i5msm5) + ',' +
008500150929     C                             %TRIM(i5msm6) + ',' +
008600150929     C                             %TRIM(i5msm7) + ',' +
008700150929     C                             %TRIM(i5msm8) + ',' +
008800150929     C                             %TRIM(i5msm9) + ',' +
008900150929     C                             %TRIM(i5msm10) + ',' +
009000150929     C                             %TRIM(i5msm11) + ',' +
009100150929     C                             %TRIM(i5msm12) + ',' +
009200150929     C                             %TRIM(i5mhall) + ',' +
009300150929     C                             %TRIM(i5mhm1) + ',' +
009400150929     C                             %TRIM(i5mhm2) + ',' +
009500150929     C                             %TRIM(i5mhm3) + ',' +
009600150929     C                             %TRIM(i5mhm4) + ',' +
009700150929     C                             %TRIM(i5mhm5) + ',' +
009800150929     C                             %TRIM(i5mhm6) + ',' +
009900150929     C                             %TRIM(i5mhm7) + ',' +
010000150929     C                             %TRIM(i5mhm8) + ',' +
010100150929     C                             %TRIM(i5mhm9) + ',' +
010200150929     C                             %TRIM(i5mhm10) + ',' +
010300150929     C                             %TRIM(i5mhm11) + ',' +
010400150929     C                             %TRIM(i5mhm12) + ',' +
010500150929     C                             %TRIM(i51cov) + ',' +
010600150929     C                             %TRIM(i51ssn) + ',' +
010700150929     C                             %TRIM(i51dob) + ',' +
010800150929     C                             '"' + %TRIM(i51fnm) + '"' + ',' +
010900150929     C                             %TRIM(i51mi) + ',' +
011000150929     C                             '"' + %TRIM(i51lnm) + '"' + ',' +
011100150929     C                             '"' + %TRIM(i51sfx) + '"' + ',' +
011200150929     C                             %TRIM(i51call) + ',' +
011300150929     C                             %TRIM(i51cm1) + ',' +
011400150929     C                             %TRIM(i51cm2) + ',' +
011500150929     C                             %TRIM(i51cm3) + ',' +
011600150929     C                             %TRIM(i51cm4) + ',' +
011700150929     C                             %TRIM(i51cm5) + ',' +
011800150929     C                             %TRIM(i51cm6) + ',' +
011900150929     C                             %TRIM(i51cm7) + ',' +
012000150929     C                             %TRIM(i51cm8) + ',' +
012100150929     C                             %TRIM(i51cm9) + ',' +
012200150929     C                             %TRIM(i51cm10) + ',' +
012300150929     C                             %TRIM(i51cm11) + ',' +
012400150929     C                             %TRIM(i51cm12) + ',' +
012500150929     C                             %TRIM(i52ssn) + ',' +
012600150929     C                             %TRIM(i52dob) + ',' +
012700150929     C                             '"' + %TRIM(i52fnm) + '"' + ',' +
012800150929     C                             %TRIM(i52mi) + ',' +
012900150929     C                             '"' + %TRIM(i52lnm) + '"' + ',' +
013000150929     C                             '"' + %TRIM(i52sfx) + '"' + ',' +
013100150929     C                             %TRIM(i52call) + ',' +
013200150929     C                             %TRIM(i52cm1) + ',' +
013300150929     C                             %TRIM(i52cm2) + ',' +
013400150929     C                             %TRIM(i52cm3) + ',' +
013500150929     C                             %TRIM(i52cm4) + ',' +
013600150929     C                             %TRIM(i52cm5) + ',' +
013700150929     C                             %TRIM(i52cm6) + ',' +
013800150929     C                             %TRIM(i52cm7) + ',' +
013900150929     C                             %TRIM(i52cm8) + ',' +
014000150929     C                             %TRIM(i52cm9) + ',' +
014100150929     C                             %TRIM(i52cm10) + ',' +
014200150929     C                             %TRIM(i52cm11) + ',' +
014300150929     C                             %TRIM(i52cm12) + ',' +
014400150929     C                             %TRIM(i53ssn) + ',' +
014500150929     C                             %TRIM(i53dob) + ',' +
014600150929     C                             '"' + %TRIM(i53fnm) + '"' + ',' +
014700150929     C                             %TRIM(i53mi) + ',' +
014800150929     C                             '"' + %TRIM(i53lnm) + '"' + ',' +
014900150929     C                             '"' + %TRIM(i53sfx) + '"' + ',' +
015000150929     C                             %TRIM(i53call) + ',' +
015100150929     C                             %TRIM(i53cm1) + ',' +
015200150929     C                             %TRIM(i53cm2) + ',' +
015300150929     C                             %TRIM(i53cm3) + ',' +
015400150929     C                             %TRIM(i53cm4) + ',' +
015500150929     C                             %TRIM(i53cm5) + ',' +
015600150929     C                             %TRIM(i53cm6) + ',' +
015700150929     C                             %TRIM(i53cm7) + ',' +
015800150929     C                             %TRIM(i53cm8) + ',' +
015900150929     C                             %TRIM(i53cm9) + ',' +
016000150929     C                             %TRIM(i53cm10) + ',' +
016100150929     C                             %TRIM(i53cm11) + ',' +
016200150929     C                             %TRIM(i53cm12) + ',' +
016300150929      *
016400150929     C                             %TRIM(i54ssn) + ',' +
016500150929     C                             %TRIM(i54dob) + ',' +
016600150929     C                             '"' + %TRIM(i54fnm) + '"' + ',' +
016700150929     C                             %TRIM(i54mi) + ',' +
016800150929     C                             '"' + %TRIM(i54lnm) + '"' + ',' +
016900150929     C                             '"' + %TRIM(i54sfx) + '"' + ',' +
017000150929     C                             %TRIM(i54call) + ',' +
017100150929     C                             %TRIM(i54cm1) + ',' +
017200150929     C                             %TRIM(i54cm2) + ',' +
017300150929     C                             %TRIM(i54cm3) + ',' +
017400150929     C                             %TRIM(i54cm4) + ',' +
017500150929     C                             %TRIM(i54cm5) + ',' +
017600150929     C                             %TRIM(i54cm6) + ',' +
017700150929     C                             %TRIM(i54cm7) + ',' +
017800150929     C                             %TRIM(i54cm8) + ',' +
017900150929     C                             %TRIM(i54cm9) + ',' +
018000150929     C                             %TRIM(i54cm10) + ',' +
018100150929     C                             %TRIM(i54cm11) + ',' +
018200150929     C                             %TRIM(i54cm12) + ',' +
018300150929      *
018400150929     C                             %TRIM(i55ssn) + ',' +
018500150929     C                             %TRIM(i55dob) + ',' +
018600150929     C                             '"' + %TRIM(i55fnm) + '"' + ',' +
018700150929     C                             %TRIM(i55mi) + ',' +
018800150929     C                             '"' + %TRIM(i55lnm) + '"' + ',' +
018900150929     C                             '"' + %TRIM(i55sfx) + '"' + ',' +
019000150929     C                             %TRIM(i55call) + ',' +
019100150929     C                             %TRIM(i55cm1) + ',' +
019200150929     C                             %TRIM(i55cm2) + ',' +
019300150929     C                             %TRIM(i55cm3) + ',' +
019400150929     C                             %TRIM(i55cm4) + ',' +
019500150929     C                             %TRIM(i55cm5) + ',' +
019600150929     C                             %TRIM(i55cm6) + ',' +
019700150929     C                             %TRIM(i55cm7) + ',' +
019800150929     C                             %TRIM(i55cm8) + ',' +
019900150929     C                             %TRIM(i55cm9) + ',' +
020000150929     C                             %TRIM(i55cm10) + ',' +
020100150929     C                             %TRIM(i55cm11) + ',' +
020200150929     C                             %TRIM(i55cm12) + ',' +
020300150929      *
020400150929     C                             %TRIM(i56ssn) + ',' +
020500150929     C                             %TRIM(i56dob) + ',' +
020600150929     C                             '"' + %TRIM(i56fnm) + '"' + ',' +
020700150929     C                             %TRIM(i56mi) + ',' +
020800150929     C                             '"' + %TRIM(i56lnm) + '"' + ',' +
020900150929     C                             '"' + %TRIM(i56sfx) + '"' + ',' +
021000150929     C                             %TRIM(i56call) + ',' +
021100150929     C                             %TRIM(i56cm1) + ',' +
021200150929     C                             %TRIM(i56cm2) + ',' +
021300150929     C                             %TRIM(i56cm3) + ',' +
021400150929     C                             %TRIM(i56cm4) + ',' +
021500150929     C                             %TRIM(i56cm5) + ',' +
021600150929     C                             %TRIM(i56cm6) + ',' +
021700150929     C                             %TRIM(i56cm7) + ',' +
021800150929     C                             %TRIM(i56cm8) + ',' +
021900150929     C                             %TRIM(i56cm9) + ',' +
022000150929     C                             %TRIM(i56cm10) + ',' +
022100150929     C                             %TRIM(i56cm11) + ',' +
022200150929     C                             %TRIM(i56cm12) + ',' +
022300150929      *
022400150929     C                             %TRIM(i57ssn) + ',' +
022500150929     C                             %TRIM(i57dob) + ',' +
022600150929     C                             '"' + %TRIM(i57fnm) + '"' + ',' +
022700150929     C                             %TRIM(i57mi) + ',' +
022800150929     C                             '"' + %TRIM(i57lnm) + '"' + ',' +
022900150929     C                             '"' + %TRIM(i57sfx) + '"' + ',' +
023000150929     C                             %TRIM(i57call) + ',' +
023100150929     C                             %TRIM(i57cm1) + ',' +
023200150929     C                             %TRIM(i57cm2) + ',' +
023300150929     C                             %TRIM(i57cm3) + ',' +
023400150929     C                             %TRIM(i57cm4) + ',' +
023500150929     C                             %TRIM(i57cm5) + ',' +
023600150929     C                             %TRIM(i57cm6) + ',' +
023700150929     C                             %TRIM(i57cm7) + ',' +
023800150929     C                             %TRIM(i57cm8) + ',' +
023900150929     C                             %TRIM(i57cm9) + ',' +
024000150929     C                             %TRIM(i57cm10) + ',' +
024100150929     C                             %TRIM(i57cm11) + ',' +
024200150929     C                             %TRIM(i57cm12) + ',' +
024300150929      *
024400150929     C                             %TRIM(i58ssn) + ',' +
024500150929     C                             %TRIM(i58dob) + ',' +
024600150929     C                             '"' + %TRIM(i58fnm) + '"' + ',' +
024700150929     C                             %TRIM(i58mi) + ',' +
024800150929     C                             '"' + %TRIM(i58lnm) + '"' + ',' +
024900150929     C                             '"' + %TRIM(i58sfx) + '"' + ',' +
025000150929     C                             %TRIM(i58call) + ',' +
025100150929     C                             %TRIM(i58cm1) + ',' +
025200150929     C                             %TRIM(i58cm2) + ',' +
025300150929     C                             %TRIM(i58cm3) + ',' +
025400150929     C                             %TRIM(i58cm4) + ',' +
025500150929     C                             %TRIM(i58cm5) + ',' +
025600150929     C                             %TRIM(i58cm6) + ',' +
025700150929     C                             %TRIM(i58cm7) + ',' +
025800150929     C                             %TRIM(i58cm8) + ',' +
025900150929     C                             %TRIM(i58cm9) + ',' +
026000150929     C                             %TRIM(i58cm10) + ',' +
026100150929     C                             %TRIM(i58cm11) + ',' +
026200150929     C                             %TRIM(i58cm12) + ',' +
026300150929      *
026400150929     C                             %TRIM(i59ssn) + ',' +
026500150929     C                             %TRIM(i59dob) + ',' +
026600150929     C                             '"' + %TRIM(i59fnm) + '"' + ',' +
026700150929     C                             %TRIM(i59mi) + ',' +
026800150929     C                             '"' + %TRIM(i59lnm) + '"' + ',' +
026900150929     C                             '"' + %TRIM(i59sfx) + '"' + ',' +
027000150929     C                             %TRIM(i59call) + ',' +
027100150929     C                             %TRIM(i59cm1) + ',' +
027200150929     C                             %TRIM(i59cm2) + ',' +
027300150929     C                             %TRIM(i59cm3) + ',' +
027400150929     C                             %TRIM(i59cm4) + ',' +
027500150929     C                             %TRIM(i59cm5) + ',' +
027600150929     C                             %TRIM(i59cm6) + ',' +
027700150929     C                             %TRIM(i59cm7) + ',' +
027800150929     C                             %TRIM(i59cm8) + ',' +
027900150929     C                             %TRIM(i59cm9) + ',' +
028000150929     C                             %TRIM(i59cm10) + ',' +
028100150929     C                             %TRIM(i59cm11) + ',' +
028200150929     C                             %TRIM(i59cm12) + ',' +
028300150929      *
028400150929     C                             %TRIM(i510ssn) + ',' +
028500150929     C                             %TRIM(i510dob) + ',' +
028600150929     C                             '"' + %TRIM(i510fnm) + '"' + ',' +
028700150929     C                             %TRIM(i510mi) + ',' +
028800150929     C                             '"' + %TRIM(i510lnm) + '"' + ',' +
028900150929     C                             '"' + %TRIM(i510sfx) + '"' + ',' +
029000150929     C                             %TRIM(i510call) + ',' +
029100150929     C                             %TRIM(i510cm1) + ',' +
029200150929     C                             %TRIM(i510cm2) + ',' +
029300150929     C                             %TRIM(i510cm3) + ',' +
029400150929     C                             %TRIM(i510cm4) + ',' +
029500150929     C                             %TRIM(i510cm5) + ',' +
029600150929     C                             %TRIM(i510cm6) + ',' +
029700150929     C                             %TRIM(i510cm7) + ',' +
029800150929     C                             %TRIM(i510cm8) + ',' +
029900150929     C                             %TRIM(i510cm9) + ',' +
030000150929     C                             %TRIM(i510cm10) + ',' +
030100150929     C                             %TRIM(i510cm11) + ',' +
030200150929     C                             %TRIM(i510cm12) + ',' +
030300150929      *
030400150929     C                             %TRIM(i511ssn) + ',' +
030500150929     C                             %TRIM(i511dob) + ',' +
030600150929     C                             '"' + %TRIM(i511fnm) + '"' + ',' +
030700150929     C                             %TRIM(i511mi) + ',' +
030800150929     C                             '"' + %TRIM(i511lnm) + '"' + ',' +
030900150929     C                             '"' + %TRIM(i511sfx) + '"' + ',' +
031000150929     C                             %TRIM(i511call) + ',' +
031100150929     C                             %TRIM(i511cm1) + ',' +
031200150929     C                             %TRIM(i511cm2) + ',' +
031300150929     C                             %TRIM(i511cm3) + ',' +
031400150929     C                             %TRIM(i511cm4) + ',' +
031500150929     C                             %TRIM(i511cm5) + ',' +
031600150929     C                             %TRIM(i511cm6) + ',' +
031700150929     C                             %TRIM(i511cm7) + ',' +
031800150929     C                             %TRIM(i511cm8) + ',' +
031900150929     C                             %TRIM(i511cm9) + ',' +
032000150929     C                             %TRIM(i511cm10) + ',' +
032100150929     C                             %TRIM(i511cm11) + ',' +
032200150929     C                             %TRIM(i511cm12) + ',' +
032300150929      *
032400150929     C                             %TRIM(i512ssn) + ',' +
032500150929     C                             %TRIM(i512dob) + ',' +
032600150929     C                             '"' + %TRIM(i512fnm) + '"' + ',' +
032700150929     C                             %TRIM(i512mi) + ',' +
032800150929     C                             '"' + %TRIM(i512lnm) + '"' + ',' +
032900150929     C                             '"' + %TRIM(i512sfx) + '"' + ',' +
033000150929     C                             %TRIM(i512call) + ',' +
033100150929     C                             %TRIM(i512cm1) + ',' +
033200150929     C                             %TRIM(i512cm2) + ',' +
033300150929     C                             %TRIM(i512cm3) + ',' +
033400150929     C                             %TRIM(i512cm4) + ',' +
033500150929     C                             %TRIM(i512cm5) + ',' +
033600150929     C                             %TRIM(i512cm6) + ',' +
033700150929     C                             %TRIM(i512cm7) + ',' +
033800150929     C                             %TRIM(i512cm8) + ',' +
033900150929     C                             %TRIM(i512cm9) + ',' +
034000150929     C                             %TRIM(i512cm10) + ',' +
034100150929     C                             %TRIM(i512cm11) + ',' +
034200150929     C                             %TRIM(i512cm12) + ',' +
034300150929      *
034400150929     C                             %TRIM(i513ssn) + ',' +
034500150929     C                             %TRIM(i513dob) + ',' +
034600150929     C                             '"' + %TRIM(i513fnm) + '"' + ',' +
034700150929     C                             %TRIM(i513mi) + ',' +
034800150929     C                             '"' + %TRIM(i513lnm) + '"' + ',' +
034900150929     C                             '"' + %TRIM(i513sfx) + '"' + ',' +
035000150929     C                             %TRIM(i513call) + ',' +
035100150929     C                             %TRIM(i513cm1) + ',' +
035200150929     C                             %TRIM(i513cm2) + ',' +
035300150929     C                             %TRIM(i513cm3) + ',' +
035400150929     C                             %TRIM(i513cm4) + ',' +
035500150929     C                             %TRIM(i513cm5) + ',' +
035600150929     C                             %TRIM(i513cm6) + ',' +
035700150929     C                             %TRIM(i513cm7) + ',' +
035800150929     C                             %TRIM(i513cm8) + ',' +
035900150929     C                             %TRIM(i513cm9) + ',' +
036000150929     C                             %TRIM(i513cm10) + ',' +
036100150929     C                             %TRIM(i513cm11) + ',' +
036200150929     C                             %TRIM(i513cm12) + ',' +
036300150929      *
036400150929     C                             %TRIM(i514ssn) + ',' +
036500150929     C                             %TRIM(i514dob) + ',' +
036600150929     C                             '"' + %TRIM(i514fnm) + '"' + ',' +
036700150929     C                             %TRIM(i514mi) + ',' +
036800150929     C                             '"' + %TRIM(i514lnm) + '"' + ',' +
036900150929     C                             '"' + %TRIM(i514sfx) + '"' + ',' +
037000150929     C                             %TRIM(i514call) + ',' +
037100150929     C                             %TRIM(i514cm1) + ',' +
037200150929     C                             %TRIM(i514cm2) + ',' +
037300150929     C                             %TRIM(i514cm3) + ',' +
037400150929     C                             %TRIM(i514cm4) + ',' +
037500150929     C                             %TRIM(i514cm5) + ',' +
037600150929     C                             %TRIM(i514cm6) + ',' +
037700150929     C                             %TRIM(i514cm7) + ',' +
037800150929     C                             %TRIM(i514cm8) + ',' +
037900150929     C                             %TRIM(i514cm9) + ',' +
038000150929     C                             %TRIM(i514cm10) + ',' +
038100150929     C                             %TRIM(i514cm11) + ',' +
038200150929     C                             %TRIM(i514cm12) + ',' +
038300150929      *
038400150929     C                             %TRIM(i515ssn) + ',' +
038500150929     C                             %TRIM(i515dob) + ',' +
038600150929     C                             '"' + %TRIM(i515fnm) + '"' + ',' +
038700150929     C                             %TRIM(i515mi) + ',' +
038800150929     C                             '"' + %TRIM(i515lnm) + '"' + ',' +
038900150929     C                             '"' + %TRIM(i515sfx) + '"' + ',' +
039000150929     C                             %TRIM(i515call) + ',' +
039100150929     C                             %TRIM(i515cm1) + ',' +
039200150929     C                             %TRIM(i515cm2) + ',' +
039300150929     C                             %TRIM(i515cm3) + ',' +
039400150929     C                             %TRIM(i515cm4) + ',' +
039500150929     C                             %TRIM(i515cm5) + ',' +
039600150929     C                             %TRIM(i515cm6) + ',' +
039700150929     C                             %TRIM(i515cm7) + ',' +
039800150929     C                             %TRIM(i515cm8) + ',' +
039900150929     C                             %TRIM(i515cm9) + ',' +
040000150929     C                             %TRIM(i515cm10) + ',' +
040100150929     C                             %TRIM(i515cm11) + ',' +
040200150929     C                             %TRIM(i515cm12) + ',' +
040300150929      *
040400150929     C                             %TRIM(i516ssn) + ',' +
040500150929     C                             %TRIM(i516dob) + ',' +
040600150929     C                             '"' + %TRIM(i516fnm) + '"' + ',' +
040700150929     C                             %TRIM(i516mi) + ',' +
040800150929     C                             '"' + %TRIM(i516lnm) + '"' + ',' +
040900150929     C                             '"' + %TRIM(i516sfx) + '"' + ',' +
041000150929     C                             %TRIM(i516call) + ',' +
041100150929     C                             %TRIM(i516cm1) + ',' +
041200150929     C                             %TRIM(i516cm2) + ',' +
041300150929     C                             %TRIM(i516cm3) + ',' +
041400150929     C                             %TRIM(i516cm4) + ',' +
041500150929     C                             %TRIM(i516cm5) + ',' +
041600150929     C                             %TRIM(i516cm6) + ',' +
041700150929     C                             %TRIM(i516cm7) + ',' +
041800150929     C                             %TRIM(i516cm8) + ',' +
041900150929     C                             %TRIM(i516cm9) + ',' +
042000150929     C                             %TRIM(i516cm10) + ',' +
042100150929     C                             %TRIM(i516cm11) + ',' +
042200150929     C                             %TRIM(i516cm12) + ',' +
042300150929      *
042400150929     C                             %TRIM(i517ssn) + ',' +
042500150929     C                             %TRIM(i517dob) + ',' +
042600150929     C                             '"' + %TRIM(i517fnm) + '"' + ',' +
042700150929     C                             %TRIM(i517mi) + ',' +
042800150929     C                             '"' + %TRIM(i517lnm) + '"' + ',' +
042900150929     C                             '"' + %TRIM(i517sfx) + '"' + ',' +
043000150929     C                             %TRIM(i517call) + ',' +
043100150929     C                             %TRIM(i517cm1) + ',' +
043200150929     C                             %TRIM(i517cm2) + ',' +
043300150929     C                             %TRIM(i517cm3) + ',' +
043400150929     C                             %TRIM(i517cm4) + ',' +
043500150929     C                             %TRIM(i517cm5) + ',' +
043600150929     C                             %TRIM(i517cm6) + ',' +
043700150929     C                             %TRIM(i517cm7) + ',' +
043800150929     C                             %TRIM(i517cm8) + ',' +
043900150929     C                             %TRIM(i517cm9) + ',' +
044000150929     C                             %TRIM(i517cm10) + ',' +
044100150929     C                             %TRIM(i517cm11) + ',' +
044200150929     C                             %TRIM(i517cm12) + ',' +
044300150929      *
044400150929     C                             %TRIM(i518ssn) + ',' +
044500150929     C                             %TRIM(i518dob) + ',' +
044600150929     C                             '"' + %TRIM(i518fnm) + '"' + ',' +
044700150929     C                             %TRIM(i518mi) + ',' +
044800150929     C                             '"' + %TRIM(i518lnm) + '"' + ',' +
044900150929     C                             '"' + %TRIM(i518sfx) + '"' + ',' +
045000150929     C                             %TRIM(i518call) + ',' +
045100150929     C                             %TRIM(i518cm1) + ',' +
045200150929     C                             %TRIM(i518cm2) + ',' +
045300150929     C                             %TRIM(i518cm3) + ',' +
045400150929     C                             %TRIM(i518cm4) + ',' +
045500150929     C                             %TRIM(i518cm5) + ',' +
045600150929     C                             %TRIM(i518cm6) + ',' +
045700150929     C                             %TRIM(i518cm7) + ',' +
045800150929     C                             %TRIM(i518cm8) + ',' +
045900150929     C                             %TRIM(i518cm9) + ',' +
046000150929     C                             %TRIM(i518cm10) + ',' +
046100150929     C                             %TRIM(i518cm11) + ',' +
046200150929     C                             %TRIM(i518cm12) + ',' +
046300150929      *
046400150929     C                             %TRIM(i519ssn) + ',' +
046500150929     C                             %TRIM(i519dob) + ',' +
046600150929     C                             '"' + %TRIM(i519fnm) + '"' + ',' +
046700150929     C                             %TRIM(i519mi) + ',' +
046800150929     C                             '"' + %TRIM(i519lnm) + '"' + ',' +
046900150929     C                             '"' + %TRIM(i519sfx) + '"' + ',' +
047000150929     C                             %TRIM(i519call) + ',' +
047100150929     C                             %TRIM(i519cm1) + ',' +
047200150929     C                             %TRIM(i519cm2) + ',' +
047300150929     C                             %TRIM(i519cm3) + ',' +
047400150929     C                             %TRIM(i519cm4) + ',' +
047500150929     C                             %TRIM(i519cm5) + ',' +
047600150929     C                             %TRIM(i519cm6) + ',' +
047700150929     C                             %TRIM(i519cm7) + ',' +
047800150929     C                             %TRIM(i519cm8) + ',' +
047900150929     C                             %TRIM(i519cm9) + ',' +
048000150929     C                             %TRIM(i519cm10) + ',' +
048100150929     C                             %TRIM(i519cm11) + ',' +
048200150929     C                             %TRIM(i519cm12) + ',' +
048300150929      *
048400150929     C                             %TRIM(i520ssn) + ',' +
048500150929     C                             %TRIM(i520dob) + ',' +
048600150929     C                             '"' + %TRIM(i520fnm) + '"' + ',' +
048700150929     C                             %TRIM(i520mi) + ',' +
048800150929     C                             '"' + %TRIM(i520lnm) + '"' + ',' +
048900150929     C                             '"' + %TRIM(i520sfx) + '"' + ',' +
049000150929     C                             %TRIM(i520call) + ',' +
049100150929     C                             %TRIM(i520cm1) + ',' +
049200150929     C                             %TRIM(i520cm2) + ',' +
049300150929     C                             %TRIM(i520cm3) + ',' +
049400150929     C                             %TRIM(i520cm4) + ',' +
049500150929     C                             %TRIM(i520cm5) + ',' +
049600150929     C                             %TRIM(i520cm6) + ',' +
049700150929     C                             %TRIM(i520cm7) + ',' +
049800150929     C                             %TRIM(i520cm8) + ',' +
049900150929     C                             %TRIM(i520cm9) + ',' +
050000150929     C                             %TRIM(i520cm10) + ',' +
050100150929     C                             %TRIM(i520cm11) + ',' +
050200150929     C                             %TRIM(i520cm12) + ',' +
050300150929      *
050400150929     C                             %TRIM(i521ssn) + ',' +
050500150929     C                             %TRIM(i521dob) + ',' +
050600150929     C                             '"' + %TRIM(i521fnm) + '"' + ',' +
050700150929     C                             %TRIM(i521mi) + ',' +
050800150929     C                             '"' + %TRIM(i521lnm) + '"' + ',' +
050900150929     C                             '"' + %TRIM(i521sfx) + '"' + ',' +
051000150929     C                             %TRIM(i521call) + ',' +
051100150929     C                             %TRIM(i521cm1) + ',' +
051200150929     C                             %TRIM(i521cm2) + ',' +
051300150929     C                             %TRIM(i521cm3) + ',' +
051400150929     C                             %TRIM(i521cm4) + ',' +
051500150929     C                             %TRIM(i521cm5) + ',' +
051600150929     C                             %TRIM(i521cm6) + ',' +
051700150929     C                             %TRIM(i521cm7) + ',' +
051800150929     C                             %TRIM(i521cm8) + ',' +
051900150929     C                             %TRIM(i521cm9) + ',' +
052000150929     C                             %TRIM(i521cm10) + ',' +
052100150929     C                             %TRIM(i521cm11) + ',' +
052200150929     C                             %TRIM(i521cm12) + ',' +
052300150929      *
052400150929     C                             %TRIM(i522ssn) + ',' +
052500150929     C                             %TRIM(i522dob) + ',' +
052600150929     C                             '"' + %TRIM(i522fnm) + '"' + ',' +
052700150929     C                             %TRIM(i522mi) + ',' +
052800150929     C                             '"' + %TRIM(i522lnm) + '"' + ',' +
052900150929     C                             '"' + %TRIM(i522sfx) + '"' + ',' +
053000150929     C                             %TRIM(i522call) + ',' +
053100150929     C                             %TRIM(i522cm1) + ',' +
053200150929     C                             %TRIM(i522cm2) + ',' +
053300150929     C                             %TRIM(i522cm3) + ',' +
053400150929     C                             %TRIM(i522cm4) + ',' +
053500150929     C                             %TRIM(i522cm5) + ',' +
053600150929     C                             %TRIM(i522cm6) + ',' +
053700150929     C                             %TRIM(i522cm7) + ',' +
053800150929     C                             %TRIM(i522cm8) + ',' +
053900150929     C                             %TRIM(i522cm9) + ',' +
054000150929     C                             %TRIM(i522cm10) + ',' +
054100150929     C                             %TRIM(i522cm11) + ',' +
054200150929     C                             %TRIM(i522cm12) + ',' +
054300150929      *
054400150929     C                             %TRIM(i523ssn) + ',' +
054500150929     C                             %TRIM(i523dob) + ',' +
054600150929     C                             '"' + %TRIM(i523fnm) + '"' + ',' +
054700150929     C                             %TRIM(i523mi) + ',' +
054800150929     C                             '"' + %TRIM(i523lnm) + '"' + ',' +
054900150929     C                             '"' + %TRIM(i523sfx) + '"' + ',' +
055000150929     C                             %TRIM(i523call) + ',' +
055100150929     C                             %TRIM(i523cm1) + ',' +
055200150929     C                             %TRIM(i523cm2) + ',' +
055300150929     C                             %TRIM(i523cm3) + ',' +
055400150929     C                             %TRIM(i523cm4) + ',' +
055500150929     C                             %TRIM(i523cm5) + ',' +
055600150929     C                             %TRIM(i523cm6) + ',' +
055700150929     C                             %TRIM(i523cm7) + ',' +
055800150929     C                             %TRIM(i523cm8) + ',' +
055900150929     C                             %TRIM(i523cm9) + ',' +
056000150929     C                             %TRIM(i523cm10) + ',' +
056100150929     C                             %TRIM(i523cm11) + ',' +
056200150929     C                             %TRIM(i523cm12) + ',' +
056300150929      *
056400150929     C                             %TRIM(i524ssn) + ',' +
056500150929     C                             %TRIM(i524dob) + ',' +
056600150929     C                             '"' + %TRIM(i524fnm) + '"' + ',' +
056700150929     C                             %TRIM(i524mi) + ',' +
056800150929     C                             '"' + %TRIM(i524lnm) + '"' + ',' +
056900150929     C                             '"' + %TRIM(i524sfx) + '"' + ',' +
057000150929     C                             %TRIM(i524call) + ',' +
057100150929     C                             %TRIM(i524cm1) + ',' +
057200150929     C                             %TRIM(i524cm2) + ',' +
057300150929     C                             %TRIM(i524cm3) + ',' +
057400150929     C                             %TRIM(i524cm4) + ',' +
057500150929     C                             %TRIM(i524cm5) + ',' +
057600150929     C                             %TRIM(i524cm6) + ',' +
057700150929     C                             %TRIM(i524cm7) + ',' +
057800150929     C                             %TRIM(i524cm8) + ',' +
057900150929     C                             %TRIM(i524cm9) + ',' +
058000150929     C                             %TRIM(i524cm10) + ',' +
058100150929     C                             %TRIM(i524cm11) + ',' +
058200150929     C                             %TRIM(i524cm12) + ',' +
058300150929      *
058400150929     C                             %TRIM(i525ssn) + ',' +
058500150929     C                             %TRIM(i525dob) + ',' +
058600150929     C                             '"' + %TRIM(i525fnm) + '"' + ',' +
058700150929     C                             %TRIM(i525mi) + ',' +
058800150929     C                             '"' + %TRIM(i525lnm) + '"' + ',' +
058900150929     C                             '"' + %TRIM(i525sfx) + '"' + ',' +
059000150929     C                             %TRIM(i525call) + ',' +
059100150929     C                             %TRIM(i525cm1) + ',' +
059200150929     C                             %TRIM(i525cm2) + ',' +
059300150929     C                             %TRIM(i525cm3) + ',' +
059400150929     C                             %TRIM(i525cm4) + ',' +
059500150929     C                             %TRIM(i525cm5) + ',' +
059600150929     C                             %TRIM(i525cm6) + ',' +
059700150929     C                             %TRIM(i525cm7) + ',' +
059800150929     C                             %TRIM(i525cm8) + ',' +
059900150929     C                             %TRIM(i525cm9) + ',' +
060000150929     C                             %TRIM(i525cm10) + ',' +
060100150929     C                             %TRIM(i525cm11) + ',' +
060200150929     C                             %TRIM(i525cm12)
060300150702    * *
060400060315     C                   EXCEPT    OUTFA
060500150702   S* *
060600150929   S* *
060700150702     C     *INZSR        BEGSR
060800150702    * *
060900150911    * *        Build Column Headings Row
061000150702     C                   CLEAR                   @OUTPUT
061100150911     C                   EVAL      @OUTPUT = 'Name of Employer 1 (Box 7),' +
061200150911     C                             'Name of Employer 2 (Box 7),' +
061300150911     C                             'Employer Address 1 (Box 9),' +
061400150911     C                             'Employer Address 2 (Box 9),' +
061500150911     C                             'Employer City (Box 11),' +
061600150911     C                             'Employer State  (Box 12),' +
061700150911     C                             'Employer Zip (Box 13),' +
061800150911     C                             'Contact Phone (Box 10),' +
061900150911     C                             'Contact Phone Ext (Box 10),' +
062000150911     C                             'Employer Identification Number (Box 8),' +
062100150911     C                             'Employee Social Security Number (Box 2),' +
062200150911     C                             'Employee First Name (Box 1),' +
062300150911     C                             'Employee Middle Initial (Box 1),' +
062400150911     C                             'Employee Last Name (Box 1),' +
062500150911     C                             'Employee Address 1 (Box 3),' +
062600150911     C                             'Employee Address 2 (Box 3),' +
062700150911     C                             'Employee City (Box 4),' +
062800150911     C                             'Employee State (Box 5),' +
062900150911     C                             'Employee Zip (Box 6),' +
063000150911     C                             'Employee Email,' +
063100150911     C                             'Misc Search,' +
063200150911     C                             'Plan Start Month,' +
063300150911     C                             'All 12 Month Offer of Coverage (Line 14),' +
063400150911     C                             'Jan Offer of Coverage (Line 14),' +
063500150911     C                             'Feb Offer of Coverage (Line 14),' +
063600150911     C                             'Mar Offer of Coverage (Line 14),' +
063700150911     C                             'Apr Offer of Coverage (Line 14),' +
063800150911     C                             'May Offer of Coverage (Line 14),' +
063900150911     C                             'Jun Offer of Coverage (Line 14),' +
064000150911     C                             'Jul Offer of Coverage (Line 14),' +
064100150911     C                             'Aug Offer of Coverage (Line 14),' +
064200150911     C                             'Sep Offer of Coverage (Line 14),' +
064300150911     C                             'Oct Offer of Coverage (Line 14),' +
064400150911     C                             'Nov Offer of Coverage (Line 14),' +
064500150911     C                             'Dec Offer of Coverage (Line 14),' +
064600150911     C                             'Employee Share for All 12 Months (Line 15)'+
064700150911     C                             ',' +
064800150911     C                             'Employee Share for Jan (Line 15),' +
064900150911     C                             'Employee Share for Feb (Line 15),' +
065000150911     C                             'Employee Share for Mar (Line 15),' +
065100150911     C                             'Employee Share for Apr (Line 15),' +
065200150911     C                             'Employee Share for May (Line 15),' +
065300150911     C                             'Employee Share for Jun (Line 15),' +
065400150911     C                             'Employee Share for Jul (Line 15),' +
065500150911     C                             'Employee Share for Aug (Line 15),' +
065600150911     C                             'Employee Share for Sep (Line 15),' +
065700150911     C                             'Employee Share for Oct (Line 15),' +
065800150911     C                             'Employee Share for Nov (Line 15),' +
065900150911     C                             'Employee Share for Dec (Line 15),' +
066000150911     C                             'Safe Harbor Code for All 12 Months ' +
066100150911     C                             '(Line 16),' +
066200150911     C                             'Safe Harbor Code for Jan (Line 16),' +
066300150911     C                             'Safe Harbor Code for Feb (Line 16),' +
066400150911     C                             'Safe Harbor Code for Mar (Line 16),' +
066500150911     C                             'Safe Harbor Code for Apr (Line 16),' +
066600150911     C                             'Safe Harbor Code for May (Line 16),' +
066700150911     C                             'Safe Harbor Code for Jun (Line 16),' +
066800150911     C                             'Safe Harbor Code for Jul (Line 16),' +
066900150911     C                             'Safe Harbor Code for Aug (Line 16),' +
067000150911     C                             'Safe Harbor Code for Sep (Line 16),' +
067100150911     C                             'Safe Harbor Code for Oct (Line 16),' +
067200150911     C                             'Safe Harbor Code for Nov (Line 16),' +
067300150911     C                             'Safe Harbor Code for Dec (Line 16),' +
067400150911     C                             'Covered Individual Checkbox (Part III),' +
067500150911     C                             'Individual SSN (b1),' +
067600150911     C                             'DOB (c1),' +
067700150911     C                             'First Name (a1),' +
067800150911     C                             'Middle Initial (a1),' +
067900150911     C                             'Last Name (a1),' +
068000150911     C                             'Suffix (a1),' +
068100150911     C                             'Covered 12 Months (d1),' +
068200150911     C                             'Jan (e1),' +
068300150911     C                             'Feb (e1),' +
068400150911     C                             'Mar (e1),' +
068500150911     C                             'Apr (e1),' +
068600150911     C                             'May (e1),' +
068700150911     C                             'Jun (e1),' +
068800150911     C                             'Jul (e1),' +
068900150911     C                             'Aug (e1),' +
069000150911     C                             'Sep (e1),' +
069100150911     C                             'Oct (e1),' +
069200150911     C                             'Nov (e1),' +
069300150911     C                             'Dec (e1),' +
069400150911     C                             'Individual SSN (b2),' +
069500150911     C                             'DOB (c2),' +
069600150911     C                             'First Name (a2),' +
069700150911     C                             'Middle Initial (a2),' +
069800150911     C                             'Last Name (a2),' +
069900150911     C                             'Suffix (a2),' +
070000150911     C                             'Covered 12 Months (d2),' +
070100150911     C                             'Jan (e2),' +
070200150911     C                             'Feb (e2),' +
070300150911     C                             'Mar (e2),' +
070400150911     C                             'Apr (e2),' +
070500150911     C                             'May (e2),' +
070600150911     C                             'Jun (e2),' +
070700150911     C                             'Jul (e2),' +
070800150911     C                             'Aug (e2),' +
070900150911     C                             'Sep (e2),' +
071000150911     C                             'Oct (e2),' +
071100150911     C                             'Nov (e2),' +
071200150911     C                             'Dec (e2),' +
071300150911     C                             'Individual SSN (b3),' +
071400150911     C                             'DOB (c3),' +
071500150911     C                             'First Name (a3),' +
071600150911     C                             'Middle Initial (a3),' +
071700150911     C                             'Last Name (a3),' +
071800150911     C                             'Suffix (a3),' +
071900150911     C                             'Covered 12 Months (d3),' +
072000150911     C                             'Jan (e3),' +
072100150911     C                             'Feb (e3),' +
072200150911     C                             'Mar (e3),' +
072300150911     C                             'Apr (e3),' +
072400150911     C                             'May (e3),' +
072500150911     C                             'Jun (e3),' +
072600150911     C                             'Jul (e3),' +
072700150911     C                             'Aug (e3),' +
072800150911     C                             'Sep (e3),' +
072900150911     C                             'Oct (e3),' +
073000150911     C                             'Nov (e3),' +
073100150911     C                             'Dec (e3),' +
073200150911     C                             'Individual SSN (b4),' +
073300150911     C                             'DOB (c4),' +
073400150911     C                             'First Name (a4),' +
073500150911     C                             'Middle Initial (a4),' +
073600150911     C                             'Last Name (a4),' +
073700150911     C                             'Suffix (a4),' +
073800150911     C                             'Covered 12 Months (d4),' +
073900150911     C                             'Jan (e4),' +
074000150911     C                             'Feb (e4),' +
074100150911     C                             'Mar (e4),' +
074200150911     C                             'Apr (e4),' +
074300150911     C                             'May (e4),' +
074400150911     C                             'Jun (e4),' +
074500150911     C                             'Jul (e4),' +
074600150911     C                             'Aug (e4),' +
074700150911     C                             'Sep (e4),' +
074800150911     C                             'Oct (e4),' +
074900150911     C                             'Nov (e4),' +
075000150911     C                             'Dec (e4),' +
075100150911     C                             'Individual SSN (b5),' +
075200150911     C                             'DOB (c5),' +
075300150911     C                             'First Name (a5),' +
075400150911     C                             'Middle Initial (a5),' +
075500150911     C                             'Last Name (a5),' +
075600150911     C                             'Suffix (a5),' +
075700150911     C                             'Covered 12 Months (d5),' +
075800150911     C                             'Jan (e5),' +
075900150911     C                             'Feb (e5),' +
076000150911     C                             'Mar (e5),' +
076100150911     C                             'Apr (e5),' +
076200150911     C                             'May (e5),' +
076300150911     C                             'Jun (e5),' +
076400150911     C                             'Jul (e5),' +
076500150911     C                             'Aug (e5),' +
076600150911     C                             'Sep (e5),' +
076700150911     C                             'Oct (e5),' +
076800150911     C                             'Nov (e5),' +
076900150911     C                             'Dec (e5),' +
077000150911     C                             'Individual SSN (b6),' +
077100150911     C                             'DOB (c6),' +
077200150911     C                             'First Name (a6),' +
077300150911     C                             'Middle Initial (a6),' +
077400150911     C                             'Last Name (a6),' +
077500150911     C                             'Suffix (a6),' +
077600150911     C                             'Covered 12 Months (d6),' +
077700150911     C                             'Jan (e6),' +
077800150911     C                             'Feb (e6),' +
077900150911     C                             'Mar (e6),' +
078000150911     C                             'Apr (e6),' +
078100150911     C                             'May (e6),' +
078200150911     C                             'Jun (e6),' +
078300150911     C                             'Jul (e6),' +
078400150911     C                             'Aug (e6),' +
078500150911     C                             'Sep (e6),' +
078600150911     C                             'Oct (e6),' +
078700150911     C                             'Nov (e6),' +
078800150911     C                             'Dec (e6),' +
078900150911     C                             'Individual SSN (b7),' +
079000150911     C                             'DOB (c7),' +
079100150911     C                             'First Name (a7),' +
079200150911     C                             'Middle Initial (a7),' +
079300150911     C                             'Last Name (a7),' +
079400150911     C                             'Suffix (a7),' +
079500150911     C                             'Covered 12 Months (d7),' +
079600150911     C                             'Jan (e7),' +
079700150911     C                             'Feb (e7),' +
079800150911     C                             'Mar (e7),' +
079900150911     C                             'Apr (e7),' +
080000150911     C                             'May (e7),' +
080100150911     C                             'Jun (e7),' +
080200150911     C                             'Jul (e7),' +
080300150911     C                             'Aug (e7),' +
080400150911     C                             'Sep (e7),' +
080500150911     C                             'Oct (e7),' +
080600150911     C                             'Nov (e7),' +
080700150911     C                             'Dec (e7),' +
080800150911     C                             'Individual SSN (b8),' +
080900150911     C                             'DOB (c8),' +
081000150911     C                             'First Name (a8),' +
081100150911     C                             'Middle Initial (a8),' +
081200150911     C                             'Last Name (a8),' +
081300150911     C                             'Suffix (a8),' +
081400150911     C                             'Covered 12 Months (d8),' +
081500150911     C                             'Jan (e8),' +
081600150911     C                             'Feb (e8),' +
081700150911     C                             'Mar (e8),' +
081800150911     C                             'Apr (e8),' +
081900150911     C                             'May (e8),' +
082000150911     C                             'Jun (e8),' +
082100150911     C                             'Jul (e8),' +
082200150911     C                             'Aug (e8),' +
082300150911     C                             'Sep (e8),' +
082400150911     C                             'Oct (e8),' +
082500150911     C                             'Nov (e8),' +
082600150911     C                             'Dec (e8),' +
082700150911     C                             'Individual SSN (b9),' +
082800150911     C                             'DOB (c9),' +
082900150911     C                             'First Name (a9),' +
083000150911     C                             'Middle Initial (a9),' +
083100150911     C                             'Last Name (a9),' +
083200150911     C                             'Suffix (a9),' +
083300150911     C                             'Covered 12 Months (d9),' +
083400150911     C                             'Jan (e9),' +
083500150911     C                             'Feb (e9),' +
083600150911     C                             'Mar (e9),' +
083700150911     C                             'Apr (e9),' +
083800150911     C                             'May (e9),' +
083900150911     C                             'Jun (e9),' +
084000150911     C                             'Jul (e9),' +
084100150911     C                             'Aug (e9),' +
084200150911     C                             'Sep (e9),' +
084300150911     C                             'Oct (e9),' +
084400150911     C                             'Nov (e9),' +
084500150911     C                             'Dec (e9),' +
084600150911     C                             'Individual SSN (b10),' +
084700150911     C                             'DOB (c10),' +
084800150911     C                             'First Name (a10),' +
084900150911     C                             'Middle Initial (a10),' +
085000150911     C                             'Last Name (a10),' +
085100150911     C                             'Suffix (a10),' +
085200150911     C                             'Covered 12 Months (d10),' +
085300150911     C                             'Jan (e10),' +
085400150911     C                             'Feb (e10),' +
085500150911     C                             'Mar (e10),' +
085600150911     C                             'Apr (e10),' +
085700150911     C                             'May (e10),' +
085800150911     C                             'Jun (e10),' +
085900150911     C                             'Jul (e10),' +
086000150911     C                             'Aug (e10),' +
086100150911     C                             'Sep (e10),' +
086200150911     C                             'Oct (e10),' +
086300150911     C                             'Nov (e10),' +
086400150911     C                             'Dec (e10),' +
086500150911     C                             'Individual SSN (b11),' +
086600150911     C                             'DOB (c11),' +
086700150911     C                             'First Name (a11),' +
086800150911     C                             'Middle Initial (a11),' +
086900150911     C                             'Last Name (a11),' +
087000150911     C                             'Suffix (a11),' +
087100150911     C                             'Covered 12 Months (d11),' +
087200150911     C                             'Jan (e11),' +
087300150911     C                             'Feb (e11),' +
087400150911     C                             'Mar (e11),' +
087500150911     C                             'Apr (e11),' +
087600150911     C                             'May (e11),' +
087700150911     C                             'Jun (e11),' +
087800150911     C                             'Jul (e11),' +
087900150911     C                             'Aug (e11),' +
088000150911     C                             'Sep (e11),' +
088100150911     C                             'Oct (e11),' +
088200150911     C                             'Nov (e11),' +
088300150911     C                             'Dec (e11),' +
088400150911     C                             'Individual SSN (b12),' +
088500150911     C                             'DOB (c12),' +
088600150911     C                             'First Name (a12),' +
088700150911     C                             'Middle Initial (a12),' +
088800150911     C                             'Last Name (a12),' +
088900150911     C                             'Suffix (a12),' +
089000150911     C                             'Covered 12 Months (d12),' +
089100150911     C                             'Jan (e12),' +
089200150911     C                             'Feb (e12),' +
089300150911     C                             'Mar (e12),' +
089400150911     C                             'Apr (e12),' +
089500150911     C                             'May (e12),' +
089600150911     C                             'Jun (e12),' +
089700150911     C                             'Jul (e12),' +
089800150911     C                             'Aug (e12),' +
089900150911     C                             'Sep (e12),' +
090000150911     C                             'Oct (e12),' +
090100150911     C                             'Nov (e12),' +
090200150911     C                             'Dec (e12),' +
090300150911     C                             'Individual SSN (b13),' +
090400150911     C                             'DOB (c13),' +
090500150911     C                             'First Name (a13),' +
090600150911     C                             'Middle Initial (a13),' +
090700150911     C                             'Last Name (a13),' +
090800150911     C                             'Suffix (a13),' +
090900150911     C                             'Covered 12 Months (d13),' +
091000150911     C                             'Jan (e13),' +
091100150911     C                             'Feb (e13),' +
091200150911     C                             'Mar (e13),' +
091300150911     C                             'Apr (e13),' +
091400150911     C                             'May (e13),' +
091500150911     C                             'Jun (e13),' +
091600150911     C                             'Jul (e13),' +
091700150911     C                             'Aug (e13),' +
091800150911     C                             'Sep (e13),' +
091900150911     C                             'Oct (e13),' +
092000150911     C                             'Nov (e13),' +
092100150911     C                             'Dec (e13),' +
092200150911     C                             'Individual SSN (b14),' +
092300150911     C                             'DOB (c14),' +
092400150911     C                             'First Name (a14),' +
092500150911     C                             'Middle Initial (a14),' +
092600150911     C                             'Last Name (a14),' +
092700150911     C                             'Suffix (a14),' +
092800150911     C                             'Covered 12 Months (d14),' +
092900150911     C                             'Jan (e14),' +
093000150911     C                             'Feb (e14),' +
093100150911     C                             'Mar (e14),' +
093200150911     C                             'Apr (e14),' +
093300150911     C                             'May (e14),' +
093400150911     C                             'Jun (e14),' +
093500150911     C                             'Jul (e14),' +
093600150911     C                             'Aug (e14),' +
093700150911     C                             'Sep (e14),' +
093800150911     C                             'Oct (e14),' +
093900150911     C                             'Nov (e14),' +
094000150911     C                             'Dec (e14),' +
094100150911     C                             'Individual SSN (b15),' +
094200150911     C                             'DOB (c15),' +
094300150911     C                             'First Name (a15),' +
094400150911     C                             'Middle Initial (a15),' +
094500150911     C                             'Last Name (a15),' +
094600150911     C                             'Suffix (a15),' +
094700150911     C                             'Covered 12 Months (d15),' +
094800150911     C                             'Jan (e15),' +
094900150911     C                             'Feb (e15),' +
095000150911     C                             'Mar (e15),' +
095100150911     C                             'Apr (e15),' +
095200150911     C                             'May (e15),' +
095300150911     C                             'Jun (e15),' +
095400150911     C                             'Jul (e15),' +
095500150911     C                             'Aug (e15),' +
095600150911     C                             'Sep (e15),' +
095700150911     C                             'Oct (e15),' +
095800150911     C                             'Nov (e15),' +
095900150911     C                             'Dec (e15),' +
096000150911     C                             'Individual SSN (b16),' +
096100150911     C                             'DOB (c16),' +
096200150911     C                             'First Name (a16),' +
096300150911     C                             'Middle Initial (a16),' +
096400150911     C                             'Last Name (a16),' +
096500150911     C                             'Suffix (a16),' +
096600150911     C                             'Covered 12 Months (d16),' +
096700150911     C                             'Jan (e16),' +
096800150911     C                             'Feb (e16),' +
096900150911     C                             'Mar (e16),' +
097000150911     C                             'Apr (e16),' +
097100150911     C                             'May (e16),' +
097200150911     C                             'Jun (e16),' +
097300150911     C                             'Jul (e16),' +
097400150911     C                             'Aug (e16),' +
097500150911     C                             'Sep (e16),' +
097600150911     C                             'Oct (e16),' +
097700150911     C                             'Nov (e16),' +
097800150911     C                             'Dec (e16),' +
097900150911     C                             'Individual SSN (b17),' +
098000150911     C                             'DOB (c17),' +
098100150911     C                             'First Name (a17),' +
098200150911     C                             'Middle Initial (a17),' +
098300150911     C                             'Last Name (a17),' +
098400150911     C                             'Suffix (a17),' +
098500150911     C                             'Covered 12 Months (d17),' +
098600150911     C                             'Jan (e17),' +
098700150911     C                             'Feb (e17),' +
098800150911     C                             'Mar (e17),' +
098900150911     C                             'Apr (e17),' +
099000150911     C                             'May (e17),' +
099100150911     C                             'Jun (e17),' +
099200150911     C                             'Jul (e17),' +
099300150911     C                             'Aug (e17),' +
099400150911     C                             'Sep (e17),' +
099500150911     C                             'Oct (e17),' +
099600150911     C                             'Nov (e17),' +
099700150911     C                             'Dec (e17),' +
099800150911     C                             'Individual SSN (b18),' +
099900150911     C                             'DOB (c18),' +
100000150911     C                             'First Name (a18),' +
100100150911     C                             'Middle Initial (a18),' +
100200150911     C                             'Last Name (a18),' +
100300150911     C                             'Suffix (a18),' +
100400150911     C                             'Covered 12 Months (d18),' +
100500150911     C                             'Jan (e18),' +
100600150911     C                             'Feb (e18),' +
100700150911     C                             'Mar (e18),' +
100800150911     C                             'Apr (e18),' +
100900150911     C                             'May (e18),' +
101000150911     C                             'Jun (e18),' +
101100150911     C                             'Jul (e18),' +
101200150911     C                             'Aug (e18),' +
101300150911     C                             'Sep (e18),' +
101400150911     C                             'Oct (e18),' +
101500150911     C                             'Nov (e18),' +
101600150911     C                             'Dec (e18),' +
101700150911     C                             'Individual SSN (b19),' +
101800150911     C                             'DOB (c19),' +
101900150911     C                             'First Name (a19),' +
102000150911     C                             'Middle Initial (a19),' +
102100150911     C                             'Last Name (a19),' +
102200150911     C                             'Suffix (a19),' +
102300150911     C                             'Covered 12 Months (d19),' +
102400150911     C                             'Jan (e19),' +
102500150911     C                             'Feb (e19),' +
102600150911     C                             'Mar (e19),' +
102700150911     C                             'Apr (e19),' +
102800150911     C                             'May (e19),' +
102900150911     C                             'Jun (e19),' +
103000150911     C                             'Jul (e19),' +
103100150911     C                             'Aug (e19),' +
103200150911     C                             'Sep (e19),' +
103300150911     C                             'Oct (e19),' +
103400150911     C                             'Nov (e19),' +
103500150911     C                             'Dec (e19),' +
103600150911     C                             'Individual SSN (b20),' +
103700150911     C                             'DOB (c20),' +
103800150911     C                             'First Name (a20),' +
103900150911     C                             'Middle Initial (a20),' +
104000150911     C                             'Last Name (a20),' +
104100150911     C                             'Suffix (a20),' +
104200150911     C                             'Covered 12 Months (d20),' +
104300150911     C                             'Jan (e20),' +
104400150911     C                             'Feb (e20),' +
104500150911     C                             'Mar (e20),' +
104600150911     C                             'Apr (e20),' +
104700150911     C                             'May (e20),' +
104800150911     C                             'Jun (e20),' +
104900150911     C                             'Jul (e20),' +
105000150911     C                             'Aug (e20),' +
105100150911     C                             'Sep (e20),' +
105200150911     C                             'Oct (e20),' +
105300150911     C                             'Nov (e20),' +
105400150911     C                             'Dec (e20),' +
105500150911     C                             'Individual SSN (b21),' +
105600150911     C                             'DOB (c21),' +
105700150911     C                             'First Name (a21),' +
105800150911     C                             'Middle Initial (a21),' +
105900150911     C                             'Last Name (a21),' +
106000150911     C                             'Suffix (a21),' +
106100150911     C                             'Covered 12 Months (d21),' +
106200150911     C                             'Jan (e21),' +
106300150911     C                             'Feb (e21),' +
106400150911     C                             'Mar (e21),' +
106500150911     C                             'Apr (e21),' +
106600150911     C                             'May (e21),' +
106700150911     C                             'Jun (e21),' +
106800150911     C                             'Jul (e21),' +
106900150911     C                             'Aug (e21),' +
107000150911     C                             'Sep (e21),' +
107100150911     C                             'Oct (e21),' +
107200150911     C                             'Nov (e21),' +
107300150911     C                             'Dec (e21),' +
107400150911     C                             'Individual SSN (b22),' +
107500150911     C                             'DOB (c22),' +
107600150911     C                             'First Name (a22),' +
107700150911     C                             'Middle Initial (a22),' +
107800150911     C                             'Last Name (a22),' +
107900150911     C                             'Suffix (a22),' +
108000150911     C                             'Covered 12 Months (d22),' +
108100150911     C                             'Jan (e22),' +
108200150911     C                             'Feb (e22),' +
108300150911     C                             'Mar (e22),' +
108400150911     C                             'Apr (e22),' +
108500150911     C                             'May (e22),' +
108600150911     C                             'Jun (e22),' +
108700150911     C                             'Jul (e22),' +
108800150911     C                             'Aug (e22),' +
108900150911     C                             'Sep (e22),' +
109000150911     C                             'Oct (e22),' +
109100150911     C                             'Nov (e22),' +
109200150911     C                             'Dec (e22),' +
109300150911     C                             'Individual SSN (b23),' +
109400150911     C                             'DOB (c23),' +
109500150911     C                             'First Name (a23),' +
109600150911     C                             'Middle Initial (a23),' +
109700150911     C                             'Last Name (a23),' +
109800150911     C                             'Suffix (a23),' +
109900150911     C                             'Covered 12 Months (d23),' +
110000150911     C                             'Jan (e23),' +
110100150911     C                             'Feb (e23),' +
110200150911     C                             'Mar (e23),' +
110300150911     C                             'Apr (e23),' +
110400150911     C                             'May (e23),' +
110500150911     C                             'Jun (e23),' +
110600150911     C                             'Jul (e23),' +
110700150911     C                             'Aug (e23),' +
110800150911     C                             'Sep (e23),' +
110900150911     C                             'Oct (e23),' +
111000150911     C                             'Nov (e23),' +
111100150911     C                             'Dec (e23),' +
111200150911     C                             'Individual SSN (b24),' +
111300150911     C                             'DOB (c24),' +
111400150911     C                             'First Name (a24),' +
111500150911     C                             'Middle Initial (a24),' +
111600150911     C                             'Last Name (a24),' +
111700150911     C                             'Suffix (a24),' +
111800150911     C                             'Covered 12 Months (d24),' +
111900150911     C                             'Jan (e24),' +
112000150911     C                             'Feb (e24),' +
112100150911     C                             'Mar (e24),' +
112200150911     C                             'Apr (e24),' +
112300150911     C                             'May (e24),' +
112400150911     C                             'Jun (e24),' +
112500150911     C                             'Jul (e24),' +
112600150911     C                             'Aug (e24),' +
112700150911     C                             'Sep (e24),' +
112800150911     C                             'Oct (e24),' +
112900150911     C                             'Nov (e24),' +
113000150911     C                             'Dec (e24),' +
113100150911     C                             'Individual SSN (b25),' +
113200150911     C                             'DOB (c25),' +
113300150911     C                             'First Name (a25),' +
113400150911     C                             'Middle Initial (a25),' +
113500150911     C                             'Last Name (a25),' +
113600150911     C                             'Suffix (a25),' +
113700150911     C                             'Covered 12 Months (d25),' +
113800150911     C                             'Jan (e25),' +
113900150911     C                             'Feb (e25),' +
114000150911     C                             'Mar (e25),' +
114100150911     C                             'Apr (e25),' +
114200150911     C                             'May (e25),' +
114300150911     C                             'Jun (e25),' +
114400150911     C                             'Jul (e25),' +
114500150911     C                             'Aug (e25),' +
114600150911     C                             'Sep (e25),' +
114700150911     C                             'Oct (e25),' +
114800150911     C                             'Nov (e25),' +
114900150911     C                             'Dec (e25)'
115000150702    * *
115100150702     C                   EXCEPT    OUTFA
115200150702   X* *
115300150702    * *
115400150702     C                   ENDSR
115500150702    * *
115600150911     OIRSCSVP   EADD         OUTFA
115700150929     O                       @OUTPUT           8000
