000100150929     FIRS95CP   IPE  E           K DISK
000200161221     FIRSCSVP   O  A F12000        DISK
000300050823   X***X
000400161221     D @OUTPUT         S          12000A   INZ
000500161221     D @C              C                   CONST('","')
000600051108    ***
0007000704030025  *
0008000704030250 D                 DS
0009001612300251 D  i5enm1                 1     40
0010001612300251 D   name1                 1     34
0011001612300025  *
0012001612300250 D                 DS
0013001612300251 D  i5enm2                 1     40
0014001612300251 D   name2                 1     34
0015001612300025  *
0016001612300250 D                 DS
0017001612300251 D  iftrst                 1      3  0
0018001612300251 D   cstrst                1      3
0019001507280025  *
0020001507280250 D                 DS
0021001507280251 D  ifsub#                 1      3  0
0022001507280251 D   cssub#                1      3
0023001507280025  *
0024001507280250 D                 DS
0025001507280251 D  ifacct                 1      4  0
0026001507280251 D   csacct                1      4
0027001507280025  *
0028001507280250 D                 DS
0029001507280251 D  ifmssn                 1      9  0
0030001507280251 D   csmssn                1      9
0031001507280025  *
0032001507280250 D                 DS
0033001507280251 D  ifiss#                 1      6  0
0034001507280251 D   csiss#                1      6
0035001507020025  *
0036000704030025  *
0037000704030250 D                 DS
0038001507020251 D  txhveff                1      8  0
0039001507020251 D   axhveff               1      8
0040001507020250 D                 DS
0041001507280037 D wkdate          S               D   datfmt(*iso)
004200150728     D usadt           S               D   DATFMT(*USA/)
004300161116     D bl              S              1    INZ(' ')
004400200102     D acstat          S              2    INZ('  ')
004500081114   X* *
004600150728    * *
004700150728     C     codkey        KLIST
004800150728     C                   KFLD                    cktyp             1
004900150728     C                   KFLD                    ckcod             3
005000110419      *
005100150728      *
005200200102     C                   eval      acstat = *blanks
005300200102     C                   if        i5mst = 'NJ' or i5mst = 'DC'
005400200102     C                   eval      acstat = i5mst
005500200102     C                   endif
005600150728      *
005700150728     C                   CLEAR                   @OUTPUT
005800161230     C                   EVAL      @OUTPUT = '"' + %TRIM(name1) + '"' + ','  +
005900161230     C                             '"' + %TRIM(name2) + '"' + ',' +
006000150929     C                             '"' + %TRIM(i5ead1) + '"' + ',' +
006100150929     C                             '"' + %TRIM(i5ead2) + '"' + ',' +
006200150929     C                             '"' + %TRIM(i5ecty) + '"' + ',' +
006300150929     C                             %TRIM(i5est) + ',' +
006400161220     C                             %TRIM(i5ezip) + ',' +
006500161116     C                             bl + ',' +
006600161116     C                             bl + ',' +
006700161116     C                             bl + ',' +
006800161116     C                             bl + ',' +
006900161116      * Contact Info
007000161230     C                             %TRIM(i5ecfn) + ',' +
007100161116     C                             bl + ',' +
007200161230     C                             %TRIM(i5ecln) + ',' +
007300161116     C                             bl + ',' +
007400161221     C                             %TRIM(i5ephn) + ',' +
007500161116     C                             bl + ',' +
007600150929     C                             %TRIM(i5ephn) + ',' +
007700161116     C                             %TRIM(i5epex) + ',' +
007800161116      * Contact Info END
007900171205     C                             %TRIM(i5eid) + ',' +
008000171205     C                             %TRIM(i5mssn) + ',' +
008100171205     C                             '"' + %TRIM(i5mfnm) + '"' + ',' +
008200171205     C                             %TRIM(i5mmi) + ',' +
008300171205     C                             '"' + %TRIM(i5mlnm) + '"' + ',' +
008400171205     C                             bl + ',' +
008500171205     C                             '"' + %TRIM(i5mad1) + '"' + ',' +
008600171205     C                             '"' + %TRIM(i5mad2) + '"' + ',' +
008700171205     C                             '"' + %TRIM(i5mcty) + '"' + ',' +
008800171205     C                             %TRIM(i5mst) + ',' +
008900171205     C                             %TRIM(i5mzip) + ',' +
009000171205     C**********                   %TRIM(i5mzp4) + ',' +
009100171205      * Foreign Addr Info
009200171205     C                             bl + ',' +
009300171205     C                             bl + ',' +
009400171205     C                             bl + ',' +
009500171205     C                             bl + ',' +
009600171205      * Foreign Addr Info END
009700171205     C                             '"' + %TRIM(i5meml) + '"' + ',' +
009800171205     C                             %TRIM(i5mpls) + ',' +
009900171205     C                             %TRIM(i5mcall) + ',' +
010000171205     C                             %TRIM(i5mcm1) + ',' +
010100171205     C                             %TRIM(i5mcm2) + ',' +
010200171205     C                             %TRIM(i5mcm3) + ',' +
010300171205     C                             %TRIM(i5mcm4) + ',' +
010400171205     C                             %TRIM(i5mcm5) + ',' +
010500150929     C                             %TRIM(i5mcm6) + ',' +
010600150929     C                             %TRIM(i5mcm7) + ',' +
010700150929     C                             %TRIM(i5mcm8) + ',' +
010800150929     C                             %TRIM(i5mcm9) + ',' +
010900150929     C                             %TRIM(i5mcm10) + ',' +
011000150929     C                             %TRIM(i5mcm11) + ',' +
011100150929     C                             %TRIM(i5mcm12) + ',' +
011200150929     C                             %TRIM(i5msall) + ',' +
011300150929     C                             %TRIM(i5msm1) + ',' +
011400150929     C                             %TRIM(i5msm2) + ',' +
011500150929     C                             %TRIM(i5msm3) + ',' +
011600150929     C                             %TRIM(i5msm4) + ',' +
011700150929     C                             %TRIM(i5msm5) + ',' +
011800150929     C                             %TRIM(i5msm6) + ',' +
011900150929     C                             %TRIM(i5msm7) + ',' +
012000150929     C                             %TRIM(i5msm8) + ',' +
012100150929     C                             %TRIM(i5msm9) + ',' +
012200150929     C                             %TRIM(i5msm10) + ',' +
012300150929     C                             %TRIM(i5msm11) + ',' +
012400150929     C                             %TRIM(i5msm12) + ',' +
012500150929     C                             %TRIM(i5mhall) + ',' +
012600150929     C                             %TRIM(i5mhm1) + ',' +
012700150929     C                             %TRIM(i5mhm2) + ',' +
012800150929     C                             %TRIM(i5mhm3) + ',' +
012900150929     C                             %TRIM(i5mhm4) + ',' +
013000150929     C                             %TRIM(i5mhm5) + ',' +
013100150929     C                             %TRIM(i5mhm6) + ',' +
013200150929     C                             %TRIM(i5mhm7) + ',' +
013300150929     C                             %TRIM(i5mhm8) + ',' +
013400150929     C                             %TRIM(i5mhm9) + ',' +
013500150929     C                             %TRIM(i5mhm10) + ',' +
013600150929     C                             %TRIM(i5mhm11) + ',' +
013700150929     C                             %TRIM(i5mhm12) + ',' +
013800150929     C                             %TRIM(i51cov) + ',' +
013900150929     C                             %TRIM(i51ssn) + ',' +
014000150929     C                             %TRIM(i51dob) + ',' +
014100150929     C                             '"' + %TRIM(i51fnm) + '"' + ',' +
014200150929     C                             %TRIM(i51mi) + ',' +
014300150929     C                             '"' + %TRIM(i51lnm) + '"' + ',' +
014400150929     C                             '"' + %TRIM(i51sfx) + '"' + ',' +
014500150929     C                             %TRIM(i51call) + ',' +
014600150929     C                             %TRIM(i51cm1) + ',' +
014700150929     C                             %TRIM(i51cm2) + ',' +
014800150929     C                             %TRIM(i51cm3) + ',' +
014900150929     C                             %TRIM(i51cm4) + ',' +
015000150929     C                             %TRIM(i51cm5) + ',' +
015100150929     C                             %TRIM(i51cm6) + ',' +
015200150929     C                             %TRIM(i51cm7) + ',' +
015300150929     C                             %TRIM(i51cm8) + ',' +
015400150929     C                             %TRIM(i51cm9) + ',' +
015500150929     C                             %TRIM(i51cm10) + ',' +
015600150929     C                             %TRIM(i51cm11) + ',' +
015700150929     C                             %TRIM(i51cm12) + ',' +
015800150929     C                             %TRIM(i52ssn) + ',' +
015900150929     C                             %TRIM(i52dob) + ',' +
016000150929     C                             '"' + %TRIM(i52fnm) + '"' + ',' +
016100150929     C                             %TRIM(i52mi) + ',' +
016200150929     C                             '"' + %TRIM(i52lnm) + '"' + ',' +
016300150929     C                             '"' + %TRIM(i52sfx) + '"' + ',' +
016400150929     C                             %TRIM(i52call) + ',' +
016500150929     C                             %TRIM(i52cm1) + ',' +
016600150929     C                             %TRIM(i52cm2) + ',' +
016700150929     C                             %TRIM(i52cm3) + ',' +
016800150929     C                             %TRIM(i52cm4) + ',' +
016900150929     C                             %TRIM(i52cm5) + ',' +
017000150929     C                             %TRIM(i52cm6) + ',' +
017100150929     C                             %TRIM(i52cm7) + ',' +
017200150929     C                             %TRIM(i52cm8) + ',' +
017300150929     C                             %TRIM(i52cm9) + ',' +
017400150929     C                             %TRIM(i52cm10) + ',' +
017500150929     C                             %TRIM(i52cm11) + ',' +
017600150929     C                             %TRIM(i52cm12) + ',' +
017700150929     C                             %TRIM(i53ssn) + ',' +
017800150929     C                             %TRIM(i53dob) + ',' +
017900150929     C                             '"' + %TRIM(i53fnm) + '"' + ',' +
018000150929     C                             %TRIM(i53mi) + ',' +
018100150929     C                             '"' + %TRIM(i53lnm) + '"' + ',' +
018200150929     C                             '"' + %TRIM(i53sfx) + '"' + ',' +
018300150929     C                             %TRIM(i53call) + ',' +
018400150929     C                             %TRIM(i53cm1) + ',' +
018500150929     C                             %TRIM(i53cm2) + ',' +
018600150929     C                             %TRIM(i53cm3) + ',' +
018700150929     C                             %TRIM(i53cm4) + ',' +
018800150929     C                             %TRIM(i53cm5) + ',' +
018900150929     C                             %TRIM(i53cm6) + ',' +
019000150929     C                             %TRIM(i53cm7) + ',' +
019100150929     C                             %TRIM(i53cm8) + ',' +
019200150929     C                             %TRIM(i53cm9) + ',' +
019300150929     C                             %TRIM(i53cm10) + ',' +
019400150929     C                             %TRIM(i53cm11) + ',' +
019500150929     C                             %TRIM(i53cm12) + ',' +
019600150929      *
019700150929     C                             %TRIM(i54ssn) + ',' +
019800150929     C                             %TRIM(i54dob) + ',' +
019900150929     C                             '"' + %TRIM(i54fnm) + '"' + ',' +
020000150929     C                             %TRIM(i54mi) + ',' +
020100150929     C                             '"' + %TRIM(i54lnm) + '"' + ',' +
020200150929     C                             '"' + %TRIM(i54sfx) + '"' + ',' +
020300150929     C                             %TRIM(i54call) + ',' +
020400150929     C                             %TRIM(i54cm1) + ',' +
020500150929     C                             %TRIM(i54cm2) + ',' +
020600150929     C                             %TRIM(i54cm3) + ',' +
020700150929     C                             %TRIM(i54cm4) + ',' +
020800150929     C                             %TRIM(i54cm5) + ',' +
020900150929     C                             %TRIM(i54cm6) + ',' +
021000150929     C                             %TRIM(i54cm7) + ',' +
021100150929     C                             %TRIM(i54cm8) + ',' +
021200150929     C                             %TRIM(i54cm9) + ',' +
021300150929     C                             %TRIM(i54cm10) + ',' +
021400150929     C                             %TRIM(i54cm11) + ',' +
021500150929     C                             %TRIM(i54cm12) + ',' +
021600150929      *
021700150929     C                             %TRIM(i55ssn) + ',' +
021800150929     C                             %TRIM(i55dob) + ',' +
021900150929     C                             '"' + %TRIM(i55fnm) + '"' + ',' +
022000150929     C                             %TRIM(i55mi) + ',' +
022100150929     C                             '"' + %TRIM(i55lnm) + '"' + ',' +
022200150929     C                             '"' + %TRIM(i55sfx) + '"' + ',' +
022300150929     C                             %TRIM(i55call) + ',' +
022400150929     C                             %TRIM(i55cm1) + ',' +
022500150929     C                             %TRIM(i55cm2) + ',' +
022600150929     C                             %TRIM(i55cm3) + ',' +
022700150929     C                             %TRIM(i55cm4) + ',' +
022800150929     C                             %TRIM(i55cm5) + ',' +
022900150929     C                             %TRIM(i55cm6) + ',' +
023000150929     C                             %TRIM(i55cm7) + ',' +
023100150929     C                             %TRIM(i55cm8) + ',' +
023200150929     C                             %TRIM(i55cm9) + ',' +
023300150929     C                             %TRIM(i55cm10) + ',' +
023400150929     C                             %TRIM(i55cm11) + ',' +
023500150929     C                             %TRIM(i55cm12) + ',' +
023600150929      *
023700150929     C                             %TRIM(i56ssn) + ',' +
023800150929     C                             %TRIM(i56dob) + ',' +
023900150929     C                             '"' + %TRIM(i56fnm) + '"' + ',' +
024000150929     C                             %TRIM(i56mi) + ',' +
024100150929     C                             '"' + %TRIM(i56lnm) + '"' + ',' +
024200150929     C                             '"' + %TRIM(i56sfx) + '"' + ',' +
024300150929     C                             %TRIM(i56call) + ',' +
024400150929     C                             %TRIM(i56cm1) + ',' +
024500150929     C                             %TRIM(i56cm2) + ',' +
024600150929     C                             %TRIM(i56cm3) + ',' +
024700150929     C                             %TRIM(i56cm4) + ',' +
024800150929     C                             %TRIM(i56cm5) + ',' +
024900150929     C                             %TRIM(i56cm6) + ',' +
025000150929     C                             %TRIM(i56cm7) + ',' +
025100150929     C                             %TRIM(i56cm8) + ',' +
025200150929     C                             %TRIM(i56cm9) + ',' +
025300150929     C                             %TRIM(i56cm10) + ',' +
025400150929     C                             %TRIM(i56cm11) + ',' +
025500150929     C                             %TRIM(i56cm12) + ',' +
025600150929      *
025700150929     C                             %TRIM(i57ssn) + ',' +
025800150929     C                             %TRIM(i57dob) + ',' +
025900150929     C                             '"' + %TRIM(i57fnm) + '"' + ',' +
026000150929     C                             %TRIM(i57mi) + ',' +
026100150929     C                             '"' + %TRIM(i57lnm) + '"' + ',' +
026200150929     C                             '"' + %TRIM(i57sfx) + '"' + ',' +
026300150929     C                             %TRIM(i57call) + ',' +
026400150929     C                             %TRIM(i57cm1) + ',' +
026500150929     C                             %TRIM(i57cm2) + ',' +
026600150929     C                             %TRIM(i57cm3) + ',' +
026700150929     C                             %TRIM(i57cm4) + ',' +
026800150929     C                             %TRIM(i57cm5) + ',' +
026900150929     C                             %TRIM(i57cm6) + ',' +
027000150929     C                             %TRIM(i57cm7) + ',' +
027100150929     C                             %TRIM(i57cm8) + ',' +
027200150929     C                             %TRIM(i57cm9) + ',' +
027300150929     C                             %TRIM(i57cm10) + ',' +
027400150929     C                             %TRIM(i57cm11) + ',' +
027500150929     C                             %TRIM(i57cm12) + ',' +
027600150929      *
027700150929     C                             %TRIM(i58ssn) + ',' +
027800150929     C                             %TRIM(i58dob) + ',' +
027900150929     C                             '"' + %TRIM(i58fnm) + '"' + ',' +
028000150929     C                             %TRIM(i58mi) + ',' +
028100150929     C                             '"' + %TRIM(i58lnm) + '"' + ',' +
028200150929     C                             '"' + %TRIM(i58sfx) + '"' + ',' +
028300150929     C                             %TRIM(i58call) + ',' +
028400150929     C                             %TRIM(i58cm1) + ',' +
028500150929     C                             %TRIM(i58cm2) + ',' +
028600150929     C                             %TRIM(i58cm3) + ',' +
028700150929     C                             %TRIM(i58cm4) + ',' +
028800150929     C                             %TRIM(i58cm5) + ',' +
028900150929     C                             %TRIM(i58cm6) + ',' +
029000150929     C                             %TRIM(i58cm7) + ',' +
029100150929     C                             %TRIM(i58cm8) + ',' +
029200150929     C                             %TRIM(i58cm9) + ',' +
029300150929     C                             %TRIM(i58cm10) + ',' +
029400150929     C                             %TRIM(i58cm11) + ',' +
029500150929     C                             %TRIM(i58cm12) + ',' +
029600150929      *
029700150929     C                             %TRIM(i59ssn) + ',' +
029800150929     C                             %TRIM(i59dob) + ',' +
029900150929     C                             '"' + %TRIM(i59fnm) + '"' + ',' +
030000150929     C                             %TRIM(i59mi) + ',' +
030100150929     C                             '"' + %TRIM(i59lnm) + '"' + ',' +
030200150929     C                             '"' + %TRIM(i59sfx) + '"' + ',' +
030300150929     C                             %TRIM(i59call) + ',' +
030400150929     C                             %TRIM(i59cm1) + ',' +
030500150929     C                             %TRIM(i59cm2) + ',' +
030600150929     C                             %TRIM(i59cm3) + ',' +
030700150929     C                             %TRIM(i59cm4) + ',' +
030800150929     C                             %TRIM(i59cm5) + ',' +
030900150929     C                             %TRIM(i59cm6) + ',' +
031000150929     C                             %TRIM(i59cm7) + ',' +
031100150929     C                             %TRIM(i59cm8) + ',' +
031200150929     C                             %TRIM(i59cm9) + ',' +
031300150929     C                             %TRIM(i59cm10) + ',' +
031400150929     C                             %TRIM(i59cm11) + ',' +
031500150929     C                             %TRIM(i59cm12) + ',' +
031600150929      *
031700150929     C                             %TRIM(i510ssn) + ',' +
031800150929     C                             %TRIM(i510dob) + ',' +
031900150929     C                             '"' + %TRIM(i510fnm) + '"' + ',' +
032000150929     C                             %TRIM(i510mi) + ',' +
032100150929     C                             '"' + %TRIM(i510lnm) + '"' + ',' +
032200150929     C                             '"' + %TRIM(i510sfx) + '"' + ',' +
032300150929     C                             %TRIM(i510call) + ',' +
032400150929     C                             %TRIM(i510cm1) + ',' +
032500150929     C                             %TRIM(i510cm2) + ',' +
032600150929     C                             %TRIM(i510cm3) + ',' +
032700150929     C                             %TRIM(i510cm4) + ',' +
032800150929     C                             %TRIM(i510cm5) + ',' +
032900150929     C                             %TRIM(i510cm6) + ',' +
033000150929     C                             %TRIM(i510cm7) + ',' +
033100150929     C                             %TRIM(i510cm8) + ',' +
033200150929     C                             %TRIM(i510cm9) + ',' +
033300150929     C                             %TRIM(i510cm10) + ',' +
033400150929     C                             %TRIM(i510cm11) + ',' +
033500150929     C                             %TRIM(i510cm12) + ',' +
033600150929      *
033700150929     C                             %TRIM(i511ssn) + ',' +
033800150929     C                             %TRIM(i511dob) + ',' +
033900150929     C                             '"' + %TRIM(i511fnm) + '"' + ',' +
034000150929     C                             %TRIM(i511mi) + ',' +
034100150929     C                             '"' + %TRIM(i511lnm) + '"' + ',' +
034200150929     C                             '"' + %TRIM(i511sfx) + '"' + ',' +
034300150929     C                             %TRIM(i511call) + ',' +
034400150929     C                             %TRIM(i511cm1) + ',' +
034500150929     C                             %TRIM(i511cm2) + ',' +
034600150929     C                             %TRIM(i511cm3) + ',' +
034700150929     C                             %TRIM(i511cm4) + ',' +
034800150929     C                             %TRIM(i511cm5) + ',' +
034900150929     C                             %TRIM(i511cm6) + ',' +
035000150929     C                             %TRIM(i511cm7) + ',' +
035100150929     C                             %TRIM(i511cm8) + ',' +
035200150929     C                             %TRIM(i511cm9) + ',' +
035300150929     C                             %TRIM(i511cm10) + ',' +
035400150929     C                             %TRIM(i511cm11) + ',' +
035500150929     C                             %TRIM(i511cm12) + ',' +
035600150929      *
035700150929     C                             %TRIM(i512ssn) + ',' +
035800150929     C                             %TRIM(i512dob) + ',' +
035900150929     C                             '"' + %TRIM(i512fnm) + '"' + ',' +
036000150929     C                             %TRIM(i512mi) + ',' +
036100150929     C                             '"' + %TRIM(i512lnm) + '"' + ',' +
036200150929     C                             '"' + %TRIM(i512sfx) + '"' + ',' +
036300150929     C                             %TRIM(i512call) + ',' +
036400150929     C                             %TRIM(i512cm1) + ',' +
036500150929     C                             %TRIM(i512cm2) + ',' +
036600150929     C                             %TRIM(i512cm3) + ',' +
036700150929     C                             %TRIM(i512cm4) + ',' +
036800150929     C                             %TRIM(i512cm5) + ',' +
036900150929     C                             %TRIM(i512cm6) + ',' +
037000150929     C                             %TRIM(i512cm7) + ',' +
037100150929     C                             %TRIM(i512cm8) + ',' +
037200150929     C                             %TRIM(i512cm9) + ',' +
037300150929     C                             %TRIM(i512cm10) + ',' +
037400150929     C                             %TRIM(i512cm11) + ',' +
037500150929     C                             %TRIM(i512cm12) + ',' +
037600150929      *
037700150929     C                             %TRIM(i513ssn) + ',' +
037800150929     C                             %TRIM(i513dob) + ',' +
037900150929     C                             '"' + %TRIM(i513fnm) + '"' + ',' +
038000150929     C                             %TRIM(i513mi) + ',' +
038100150929     C                             '"' + %TRIM(i513lnm) + '"' + ',' +
038200150929     C                             '"' + %TRIM(i513sfx) + '"' + ',' +
038300150929     C                             %TRIM(i513call) + ',' +
038400150929     C                             %TRIM(i513cm1) + ',' +
038500150929     C                             %TRIM(i513cm2) + ',' +
038600150929     C                             %TRIM(i513cm3) + ',' +
038700150929     C                             %TRIM(i513cm4) + ',' +
038800150929     C                             %TRIM(i513cm5) + ',' +
038900150929     C                             %TRIM(i513cm6) + ',' +
039000150929     C                             %TRIM(i513cm7) + ',' +
039100150929     C                             %TRIM(i513cm8) + ',' +
039200150929     C                             %TRIM(i513cm9) + ',' +
039300150929     C                             %TRIM(i513cm10) + ',' +
039400150929     C                             %TRIM(i513cm11) + ',' +
039500150929     C                             %TRIM(i513cm12) + ',' +
039600150929      *
039700150929     C                             %TRIM(i514ssn) + ',' +
039800150929     C                             %TRIM(i514dob) + ',' +
039900150929     C                             '"' + %TRIM(i514fnm) + '"' + ',' +
040000150929     C                             %TRIM(i514mi) + ',' +
040100150929     C                             '"' + %TRIM(i514lnm) + '"' + ',' +
040200150929     C                             '"' + %TRIM(i514sfx) + '"' + ',' +
040300150929     C                             %TRIM(i514call) + ',' +
040400150929     C                             %TRIM(i514cm1) + ',' +
040500150929     C                             %TRIM(i514cm2) + ',' +
040600150929     C                             %TRIM(i514cm3) + ',' +
040700150929     C                             %TRIM(i514cm4) + ',' +
040800150929     C                             %TRIM(i514cm5) + ',' +
040900150929     C                             %TRIM(i514cm6) + ',' +
041000150929     C                             %TRIM(i514cm7) + ',' +
041100150929     C                             %TRIM(i514cm8) + ',' +
041200150929     C                             %TRIM(i514cm9) + ',' +
041300150929     C                             %TRIM(i514cm10) + ',' +
041400150929     C                             %TRIM(i514cm11) + ',' +
041500150929     C                             %TRIM(i514cm12) + ',' +
041600150929      *
041700150929     C                             %TRIM(i515ssn) + ',' +
041800150929     C                             %TRIM(i515dob) + ',' +
041900150929     C                             '"' + %TRIM(i515fnm) + '"' + ',' +
042000150929     C                             %TRIM(i515mi) + ',' +
042100150929     C                             '"' + %TRIM(i515lnm) + '"' + ',' +
042200150929     C                             '"' + %TRIM(i515sfx) + '"' + ',' +
042300150929     C                             %TRIM(i515call) + ',' +
042400150929     C                             %TRIM(i515cm1) + ',' +
042500150929     C                             %TRIM(i515cm2) + ',' +
042600150929     C                             %TRIM(i515cm3) + ',' +
042700150929     C                             %TRIM(i515cm4) + ',' +
042800150929     C                             %TRIM(i515cm5) + ',' +
042900150929     C                             %TRIM(i515cm6) + ',' +
043000150929     C                             %TRIM(i515cm7) + ',' +
043100150929     C                             %TRIM(i515cm8) + ',' +
043200150929     C                             %TRIM(i515cm9) + ',' +
043300150929     C                             %TRIM(i515cm10) + ',' +
043400150929     C                             %TRIM(i515cm11) + ',' +
043500150929     C                             %TRIM(i515cm12) + ',' +
043600150929      *
043700150929     C                             %TRIM(i516ssn) + ',' +
043800150929     C                             %TRIM(i516dob) + ',' +
043900150929     C                             '"' + %TRIM(i516fnm) + '"' + ',' +
044000150929     C                             %TRIM(i516mi) + ',' +
044100150929     C                             '"' + %TRIM(i516lnm) + '"' + ',' +
044200150929     C                             '"' + %TRIM(i516sfx) + '"' + ',' +
044300150929     C                             %TRIM(i516call) + ',' +
044400150929     C                             %TRIM(i516cm1) + ',' +
044500150929     C                             %TRIM(i516cm2) + ',' +
044600150929     C                             %TRIM(i516cm3) + ',' +
044700150929     C                             %TRIM(i516cm4) + ',' +
044800150929     C                             %TRIM(i516cm5) + ',' +
044900150929     C                             %TRIM(i516cm6) + ',' +
045000150929     C                             %TRIM(i516cm7) + ',' +
045100150929     C                             %TRIM(i516cm8) + ',' +
045200150929     C                             %TRIM(i516cm9) + ',' +
045300150929     C                             %TRIM(i516cm10) + ',' +
045400150929     C                             %TRIM(i516cm11) + ',' +
045500150929     C                             %TRIM(i516cm12) + ',' +
045600150929      *
045700150929     C                             %TRIM(i517ssn) + ',' +
045800150929     C                             %TRIM(i517dob) + ',' +
045900150929     C                             '"' + %TRIM(i517fnm) + '"' + ',' +
046000150929     C                             %TRIM(i517mi) + ',' +
046100150929     C                             '"' + %TRIM(i517lnm) + '"' + ',' +
046200150929     C                             '"' + %TRIM(i517sfx) + '"' + ',' +
046300150929     C                             %TRIM(i517call) + ',' +
046400150929     C                             %TRIM(i517cm1) + ',' +
046500150929     C                             %TRIM(i517cm2) + ',' +
046600150929     C                             %TRIM(i517cm3) + ',' +
046700150929     C                             %TRIM(i517cm4) + ',' +
046800150929     C                             %TRIM(i517cm5) + ',' +
046900150929     C                             %TRIM(i517cm6) + ',' +
047000150929     C                             %TRIM(i517cm7) + ',' +
047100150929     C                             %TRIM(i517cm8) + ',' +
047200150929     C                             %TRIM(i517cm9) + ',' +
047300150929     C                             %TRIM(i517cm10) + ',' +
047400150929     C                             %TRIM(i517cm11) + ',' +
047500150929     C                             %TRIM(i517cm12) + ',' +
047600150929      *
047700150929     C                             %TRIM(i518ssn) + ',' +
047800150929     C                             %TRIM(i518dob) + ',' +
047900150929     C                             '"' + %TRIM(i518fnm) + '"' + ',' +
048000150929     C                             %TRIM(i518mi) + ',' +
048100150929     C                             '"' + %TRIM(i518lnm) + '"' + ',' +
048200150929     C                             '"' + %TRIM(i518sfx) + '"' + ',' +
048300150929     C                             %TRIM(i518call) + ',' +
048400150929     C                             %TRIM(i518cm1) + ',' +
048500150929     C                             %TRIM(i518cm2) + ',' +
048600150929     C                             %TRIM(i518cm3) + ',' +
048700150929     C                             %TRIM(i518cm4) + ',' +
048800150929     C                             %TRIM(i518cm5) + ',' +
048900150929     C                             %TRIM(i518cm6) + ',' +
049000150929     C                             %TRIM(i518cm7) + ',' +
049100150929     C                             %TRIM(i518cm8) + ',' +
049200150929     C                             %TRIM(i518cm9) + ',' +
049300150929     C                             %TRIM(i518cm10) + ',' +
049400150929     C                             %TRIM(i518cm11) + ',' +
049500150929     C                             %TRIM(i518cm12) + ',' +
049600150929      *
049700150929     C                             %TRIM(i519ssn) + ',' +
049800150929     C                             %TRIM(i519dob) + ',' +
049900150929     C                             '"' + %TRIM(i519fnm) + '"' + ',' +
050000150929     C                             %TRIM(i519mi) + ',' +
050100150929     C                             '"' + %TRIM(i519lnm) + '"' + ',' +
050200150929     C                             '"' + %TRIM(i519sfx) + '"' + ',' +
050300150929     C                             %TRIM(i519call) + ',' +
050400150929     C                             %TRIM(i519cm1) + ',' +
050500150929     C                             %TRIM(i519cm2) + ',' +
050600150929     C                             %TRIM(i519cm3) + ',' +
050700150929     C                             %TRIM(i519cm4) + ',' +
050800150929     C                             %TRIM(i519cm5) + ',' +
050900150929     C                             %TRIM(i519cm6) + ',' +
051000150929     C                             %TRIM(i519cm7) + ',' +
051100150929     C                             %TRIM(i519cm8) + ',' +
051200150929     C                             %TRIM(i519cm9) + ',' +
051300150929     C                             %TRIM(i519cm10) + ',' +
051400150929     C                             %TRIM(i519cm11) + ',' +
051500150929     C                             %TRIM(i519cm12) + ',' +
051600150929      *
051700150929     C                             %TRIM(i520ssn) + ',' +
051800150929     C                             %TRIM(i520dob) + ',' +
051900150929     C                             '"' + %TRIM(i520fnm) + '"' + ',' +
052000150929     C                             %TRIM(i520mi) + ',' +
052100150929     C                             '"' + %TRIM(i520lnm) + '"' + ',' +
052200150929     C                             '"' + %TRIM(i520sfx) + '"' + ',' +
052300150929     C                             %TRIM(i520call) + ',' +
052400150929     C                             %TRIM(i520cm1) + ',' +
052500150929     C                             %TRIM(i520cm2) + ',' +
052600150929     C                             %TRIM(i520cm3) + ',' +
052700150929     C                             %TRIM(i520cm4) + ',' +
052800150929     C                             %TRIM(i520cm5) + ',' +
052900150929     C                             %TRIM(i520cm6) + ',' +
053000150929     C                             %TRIM(i520cm7) + ',' +
053100150929     C                             %TRIM(i520cm8) + ',' +
053200150929     C                             %TRIM(i520cm9) + ',' +
053300150929     C                             %TRIM(i520cm10) + ',' +
053400150929     C                             %TRIM(i520cm11) + ',' +
053500150929     C                             %TRIM(i520cm12) + ',' +
053600150929      *
053700150929     C                             %TRIM(i521ssn) + ',' +
053800150929     C                             %TRIM(i521dob) + ',' +
053900150929     C                             '"' + %TRIM(i521fnm) + '"' + ',' +
054000150929     C                             %TRIM(i521mi) + ',' +
054100150929     C                             '"' + %TRIM(i521lnm) + '"' + ',' +
054200150929     C                             '"' + %TRIM(i521sfx) + '"' + ',' +
054300150929     C                             %TRIM(i521call) + ',' +
054400150929     C                             %TRIM(i521cm1) + ',' +
054500150929     C                             %TRIM(i521cm2) + ',' +
054600150929     C                             %TRIM(i521cm3) + ',' +
054700150929     C                             %TRIM(i521cm4) + ',' +
054800150929     C                             %TRIM(i521cm5) + ',' +
054900150929     C                             %TRIM(i521cm6) + ',' +
055000150929     C                             %TRIM(i521cm7) + ',' +
055100150929     C                             %TRIM(i521cm8) + ',' +
055200150929     C                             %TRIM(i521cm9) + ',' +
055300150929     C                             %TRIM(i521cm10) + ',' +
055400150929     C                             %TRIM(i521cm11) + ',' +
055500150929     C                             %TRIM(i521cm12) + ',' +
055600150929      *
055700150929     C                             %TRIM(i522ssn) + ',' +
055800150929     C                             %TRIM(i522dob) + ',' +
055900150929     C                             '"' + %TRIM(i522fnm) + '"' + ',' +
056000150929     C                             %TRIM(i522mi) + ',' +
056100150929     C                             '"' + %TRIM(i522lnm) + '"' + ',' +
056200150929     C                             '"' + %TRIM(i522sfx) + '"' + ',' +
056300150929     C                             %TRIM(i522call) + ',' +
056400150929     C                             %TRIM(i522cm1) + ',' +
056500150929     C                             %TRIM(i522cm2) + ',' +
056600150929     C                             %TRIM(i522cm3) + ',' +
056700150929     C                             %TRIM(i522cm4) + ',' +
056800150929     C                             %TRIM(i522cm5) + ',' +
056900150929     C                             %TRIM(i522cm6) + ',' +
057000150929     C                             %TRIM(i522cm7) + ',' +
057100150929     C                             %TRIM(i522cm8) + ',' +
057200150929     C                             %TRIM(i522cm9) + ',' +
057300150929     C                             %TRIM(i522cm10) + ',' +
057400150929     C                             %TRIM(i522cm11) + ',' +
057500150929     C                             %TRIM(i522cm12) + ',' +
057600150929      *
057700150929     C                             %TRIM(i523ssn) + ',' +
057800150929     C                             %TRIM(i523dob) + ',' +
057900150929     C                             '"' + %TRIM(i523fnm) + '"' + ',' +
058000150929     C                             %TRIM(i523mi) + ',' +
058100150929     C                             '"' + %TRIM(i523lnm) + '"' + ',' +
058200150929     C                             '"' + %TRIM(i523sfx) + '"' + ',' +
058300150929     C                             %TRIM(i523call) + ',' +
058400150929     C                             %TRIM(i523cm1) + ',' +
058500150929     C                             %TRIM(i523cm2) + ',' +
058600150929     C                             %TRIM(i523cm3) + ',' +
058700150929     C                             %TRIM(i523cm4) + ',' +
058800150929     C                             %TRIM(i523cm5) + ',' +
058900150929     C                             %TRIM(i523cm6) + ',' +
059000150929     C                             %TRIM(i523cm7) + ',' +
059100150929     C                             %TRIM(i523cm8) + ',' +
059200150929     C                             %TRIM(i523cm9) + ',' +
059300150929     C                             %TRIM(i523cm10) + ',' +
059400150929     C                             %TRIM(i523cm11) + ',' +
059500150929     C                             %TRIM(i523cm12) + ',' +
059600150929      *
059700150929     C                             %TRIM(i524ssn) + ',' +
059800150929     C                             %TRIM(i524dob) + ',' +
059900150929     C                             '"' + %TRIM(i524fnm) + '"' + ',' +
060000150929     C                             %TRIM(i524mi) + ',' +
060100150929     C                             '"' + %TRIM(i524lnm) + '"' + ',' +
060200150929     C                             '"' + %TRIM(i524sfx) + '"' + ',' +
060300150929     C                             %TRIM(i524call) + ',' +
060400150929     C                             %TRIM(i524cm1) + ',' +
060500150929     C                             %TRIM(i524cm2) + ',' +
060600150929     C                             %TRIM(i524cm3) + ',' +
060700150929     C                             %TRIM(i524cm4) + ',' +
060800150929     C                             %TRIM(i524cm5) + ',' +
060900150929     C                             %TRIM(i524cm6) + ',' +
061000150929     C                             %TRIM(i524cm7) + ',' +
061100150929     C                             %TRIM(i524cm8) + ',' +
061200150929     C                             %TRIM(i524cm9) + ',' +
061300150929     C                             %TRIM(i524cm10) + ',' +
061400150929     C                             %TRIM(i524cm11) + ',' +
061500150929     C                             %TRIM(i524cm12) + ',' +
061600150929      *
061700150929     C                             %TRIM(i525ssn) + ',' +
061800150929     C                             %TRIM(i525dob) + ',' +
061900150929     C                             '"' + %TRIM(i525fnm) + '"' + ',' +
062000150929     C                             %TRIM(i525mi) + ',' +
062100150929     C                             '"' + %TRIM(i525lnm) + '"' + ',' +
062200150929     C                             '"' + %TRIM(i525sfx) + '"' + ',' +
062300150929     C                             %TRIM(i525call) + ',' +
062400150929     C                             %TRIM(i525cm1) + ',' +
062500150929     C                             %TRIM(i525cm2) + ',' +
062600150929     C                             %TRIM(i525cm3) + ',' +
062700150929     C                             %TRIM(i525cm4) + ',' +
062800150929     C                             %TRIM(i525cm5) + ',' +
062900150929     C                             %TRIM(i525cm6) + ',' +
063000150929     C                             %TRIM(i525cm7) + ',' +
063100150929     C                             %TRIM(i525cm8) + ',' +
063200150929     C                             %TRIM(i525cm9) + ',' +
063300150929     C                             %TRIM(i525cm10) + ',' +
063400150929     C                             %TRIM(i525cm11) + ',' +
063500200103     C                             %TRIM(i525cm12) + ',' +
063600200103     C                             %TRIM(acstat)
063700150702    * *
063800060315     C                   EXCEPT    OUTFA
063900150702   S* *
064000150929   S* *
064100150702     C     *INZSR        BEGSR
064200150702    * *
064300150911    * *        Build Column Headings Row
064400150702     C                   CLEAR                   @OUTPUT
064500150911     C                   EVAL      @OUTPUT = 'Name of Employer 1 (Box 7),' +
064600150911     C                             'Name of Employer 2 (Box 7),' +
064700150911     C                             'Employer Address 1 (Box 9),' +
064800150911     C                             'Employer Address 2 (Box 9),' +
064900150911     C                             'Employer City (Box 11),' +
065000150911     C                             'Employer State  (Box 12),' +
065100150911     C                             'Employer Zip (Box 13),' +
065200161116     C                             'Employer Foreign Address Indicator,' +
065300161116     C                             'Employer Foreign State Name (Box 12),' +
065400161116     C                             'Employer Foreign Postal Code (Box 13),' +
065500171207     C                             'Employer Foreign Country Code (Box 13),' +
065600161116     C                             '1094 Contact First Name,' +
065700161116     C                             '1094 Contact Middle Initial,' +
065800161116     C                             '1094 Contact Last Name,' +
065900161116     C                             '1094 Contact Suffix,' +
066000161116     C                             '1095 Contact Phone (Box 10),' +
066100161116     C                             '1095 Contact Phone Ext (Box 10),' +
066200161116     C                             '1094 Contact Phone,' +
066300161116     C                             '1094 Contact Phone Ext,' +
066400150911     C                             'Employer Identification Number (Box 8),' +
066500150911     C                             'Employee Social Security Number (Box 2),' +
066600150911     C                             'Employee First Name (Box 1),' +
066700150911     C                             'Employee Middle Initial (Box 1),' +
066800161116     C                             'Employee Last Name (Box 1),' +
066900161116     C                             'Employee Suffix (Box 1),' +
067000150911     C                             'Employee Address 1 (Box 3),' +
067100150911     C                             'Employee Address 2 (Box 3),' +
067200150911     C                             'Employee City (Box 4),' +
067300150911     C                             'Employee State (Box 5),' +
067400150911     C                             'Employee Zip (Box 6),' +
067500161116     C                             'Employee Foreign Address Indicator,' +
067600161116     C                             'Employee Foreign State Name (Box 5),' +
067700161116     C                             'Employee Foreign Postal Code (Box 6),' +
067800171207     C                             'Employee Foreign Country Code (Box 6),' +
067900181212     C                             'Employee Email (Online Retrieval),' +
068000150911     C                             'Plan Start Month,' +
068100161221     C                             'All 12 Month Offer Of Coverage (Line 14),' +
068200161221     C                             'Jan Offer Of Coverage (Line 14),' +
068300161221     C                             'Feb Offer Of Coverage (Line 14),' +
068400161221     C                             'Mar Offer Of Coverage (Line 14),' +
068500161221     C                             'Apr Offer Of Coverage (Line 14),' +
068600161221     C                             'May Offer Of Coverage (Line 14),' +
068700161221     C                             'Jun Offer Of Coverage (Line 14),' +
068800161221     C                             'Jul Offer Of Coverage (Line 14),' +
068900161221     C                             'Aug Offer Of Coverage (Line 14),' +
069000161221     C                             'Sep Offer Of Coverage (Line 14),' +
069100161221     C                             'Oct Offer Of Coverage (Line 14),' +
069200161221     C                             'Nov Offer Of Coverage (Line 14),' +
069300161221     C                             'Dec Offer Of Coverage (Line 14),' +
069400161221     C                             'Employee Required Contribution For All 12 '+
069500161221     C                             'Months (Line 15),' +
069600161221     C                             'Employee Required Contribution For Jan (Li'+
069700161221     C                             'ne 15),' +
069800161221     C                             'Employee Required Contribution For Feb (Li'+
069900161221     C                             'ne 15),' +
070000161221     C                             'Employee Required Contribution For Mar (Li'+
070100161221     C                             'ne 15),' +
070200161221     C                             'Employee Required Contribution For Apr (Li'+
070300161221     C                             'ne 15),' +
070400161221     C                             'Employee Required Contribution For May (Li'+
070500161221     C                             'ne 15),' +
070600161221     C                             'Employee Required Contribution For Jun (Li'+
070700161221     C                             'ne 15),' +
070800161221     C                             'Employee Required Contribution For Jul (Li'+
070900161221     C                             'ne 15),' +
071000161221     C                             'Employee Required Contribution For Aug (Li'+
071100161221     C                             'ne 15),' +
071200161221     C                             'Employee Required Contribution For Sep (Li'+
071300161221     C                             'ne 15),' +
071400161221     C                             'Employee Required Contribution For Oct (Li'+
071500161221     C                             'ne 15),' +
071600161221     C                             'Employee Required Contribution For Nov (Li'+
071700161221     C                             'ne 15),' +
071800161221     C                             'Employee Required Contribution For Dec (Li'+
071900161221     C                             'ne 15),' +
072000161221     C                             'Safe Harbor And Other Relief For All 12 M' +
072100161116     C                             'onths (Line 16),' +
072200161221     C                             'Safe Harbor And Other Relief For Jan (Lin' +
072300161116     C                             'e 16),' +
072400161221     C                             'Safe Harbor And Other Relief For Feb (Lin' +
072500161116     C                             'e 16),' +
072600161221     C                             'Safe Harbor And Other Relief For Mar (Lin' +
072700161116     C                             'e 16),' +
072800161221     C                             'Safe Harbor And Other Relief For Apr (Lin' +
072900161116     C                             'e 16),' +
073000161221     C                             'Safe Harbor And Other Relief For May (Lin' +
073100161116     C                             'e 16),' +
073200161221     C                             'Safe Harbor And Other Relief For Jun (Lin' +
073300161116     C                             'e 16),' +
073400161221     C                             'Safe Harbor And Other Relief For Jul (Lin' +
073500161116     C                             'e 16),' +
073600161221     C                             'Safe Harbor And Other Relief For Aug (Lin' +
073700161116     C                             'e 16),' +
073800161221     C                             'Safe Harbor And Other Relief For Sep (Lin' +
073900161116     C                             'e 16),' +
074000161221     C                             'Safe Harbor And Other Relief For Oct (Lin' +
074100161116     C                             'e 16),' +
074200161221     C                             'Safe Harbor And Other Relief For Nov (Lin' +
074300161116     C                             'e 16),' +
074400161221     C                             'Safe Harbor And Other Relief For Dec (Lin' +
074500161116     C                             'e 16),' +
074600150911     C                             'Covered Individual Checkbox (Part III),' +
074700161116     C                             'Individual SSN Or TIN (b1),' +
074800150911     C                             'DOB (c1),' +
074900150911     C                             'First Name (a1),' +
075000150911     C                             'Middle Initial (a1),' +
075100150911     C                             'Last Name (a1),' +
075200150911     C                             'Suffix (a1),' +
075300150911     C                             'Covered 12 Months (d1),' +
075400150911     C                             'Jan (e1),' +
075500150911     C                             'Feb (e1),' +
075600150911     C                             'Mar (e1),' +
075700150911     C                             'Apr (e1),' +
075800150911     C                             'May (e1),' +
075900150911     C                             'Jun (e1),' +
076000150911     C                             'Jul (e1),' +
076100150911     C                             'Aug (e1),' +
076200150911     C                             'Sep (e1),' +
076300150911     C                             'Oct (e1),' +
076400150911     C                             'Nov (e1),' +
076500150911     C                             'Dec (e1),' +
076600161116     C                             'Individual SSN Or TIN (b2),' +
076700150911     C                             'DOB (c2),' +
076800150911     C                             'First Name (a2),' +
076900150911     C                             'Middle Initial (a2),' +
077000150911     C                             'Last Name (a2),' +
077100150911     C                             'Suffix (a2),' +
077200150911     C                             'Covered 12 Months (d2),' +
077300150911     C                             'Jan (e2),' +
077400150911     C                             'Feb (e2),' +
077500150911     C                             'Mar (e2),' +
077600150911     C                             'Apr (e2),' +
077700150911     C                             'May (e2),' +
077800150911     C                             'Jun (e2),' +
077900150911     C                             'Jul (e2),' +
078000150911     C                             'Aug (e2),' +
078100150911     C                             'Sep (e2),' +
078200150911     C                             'Oct (e2),' +
078300150911     C                             'Nov (e2),' +
078400150911     C                             'Dec (e2),' +
078500161116     C                             'Individual SSN Or TIN (b3),' +
078600150911     C                             'DOB (c3),' +
078700150911     C                             'First Name (a3),' +
078800150911     C                             'Middle Initial (a3),' +
078900150911     C                             'Last Name (a3),' +
079000150911     C                             'Suffix (a3),' +
079100150911     C                             'Covered 12 Months (d3),' +
079200150911     C                             'Jan (e3),' +
079300150911     C                             'Feb (e3),' +
079400150911     C                             'Mar (e3),' +
079500150911     C                             'Apr (e3),' +
079600150911     C                             'May (e3),' +
079700150911     C                             'Jun (e3),' +
079800150911     C                             'Jul (e3),' +
079900150911     C                             'Aug (e3),' +
080000150911     C                             'Sep (e3),' +
080100150911     C                             'Oct (e3),' +
080200150911     C                             'Nov (e3),' +
080300150911     C                             'Dec (e3),' +
080400161116     C                             'Individual SSN Or TIN (b4),' +
080500150911     C                             'DOB (c4),' +
080600150911     C                             'First Name (a4),' +
080700150911     C                             'Middle Initial (a4),' +
080800150911     C                             'Last Name (a4),' +
080900150911     C                             'Suffix (a4),' +
081000150911     C                             'Covered 12 Months (d4),' +
081100150911     C                             'Jan (e4),' +
081200150911     C                             'Feb (e4),' +
081300150911     C                             'Mar (e4),' +
081400150911     C                             'Apr (e4),' +
081500150911     C                             'May (e4),' +
081600150911     C                             'Jun (e4),' +
081700150911     C                             'Jul (e4),' +
081800150911     C                             'Aug (e4),' +
081900150911     C                             'Sep (e4),' +
082000150911     C                             'Oct (e4),' +
082100150911     C                             'Nov (e4),' +
082200150911     C                             'Dec (e4),' +
082300161116     C                             'Individual SSN Or TIN (b5),' +
082400150911     C                             'DOB (c5),' +
082500150911     C                             'First Name (a5),' +
082600150911     C                             'Middle Initial (a5),' +
082700150911     C                             'Last Name (a5),' +
082800150911     C                             'Suffix (a5),' +
082900150911     C                             'Covered 12 Months (d5),' +
083000150911     C                             'Jan (e5),' +
083100150911     C                             'Feb (e5),' +
083200150911     C                             'Mar (e5),' +
083300150911     C                             'Apr (e5),' +
083400150911     C                             'May (e5),' +
083500150911     C                             'Jun (e5),' +
083600150911     C                             'Jul (e5),' +
083700150911     C                             'Aug (e5),' +
083800150911     C                             'Sep (e5),' +
083900150911     C                             'Oct (e5),' +
084000150911     C                             'Nov (e5),' +
084100150911     C                             'Dec (e5),' +
084200161116     C                             'Individual SSN Or TIN (b6),' +
084300150911     C                             'DOB (c6),' +
084400150911     C                             'First Name (a6),' +
084500150911     C                             'Middle Initial (a6),' +
084600150911     C                             'Last Name (a6),' +
084700150911     C                             'Suffix (a6),' +
084800150911     C                             'Covered 12 Months (d6),' +
084900150911     C                             'Jan (e6),' +
085000150911     C                             'Feb (e6),' +
085100150911     C                             'Mar (e6),' +
085200150911     C                             'Apr (e6),' +
085300150911     C                             'May (e6),' +
085400150911     C                             'Jun (e6),' +
085500150911     C                             'Jul (e6),' +
085600150911     C                             'Aug (e6),' +
085700150911     C                             'Sep (e6),' +
085800150911     C                             'Oct (e6),' +
085900150911     C                             'Nov (e6),' +
086000150911     C                             'Dec (e6),' +
086100161116     C                             'Individual SSN Or TIN (b7),' +
086200150911     C                             'DOB (c7),' +
086300150911     C                             'First Name (a7),' +
086400150911     C                             'Middle Initial (a7),' +
086500150911     C                             'Last Name (a7),' +
086600150911     C                             'Suffix (a7),' +
086700150911     C                             'Covered 12 Months (d7),' +
086800150911     C                             'Jan (e7),' +
086900150911     C                             'Feb (e7),' +
087000150911     C                             'Mar (e7),' +
087100150911     C                             'Apr (e7),' +
087200150911     C                             'May (e7),' +
087300150911     C                             'Jun (e7),' +
087400150911     C                             'Jul (e7),' +
087500150911     C                             'Aug (e7),' +
087600150911     C                             'Sep (e7),' +
087700150911     C                             'Oct (e7),' +
087800150911     C                             'Nov (e7),' +
087900150911     C                             'Dec (e7),' +
088000161116     C                             'Individual SSN Or TIN (b8),' +
088100150911     C                             'DOB (c8),' +
088200150911     C                             'First Name (a8),' +
088300150911     C                             'Middle Initial (a8),' +
088400150911     C                             'Last Name (a8),' +
088500150911     C                             'Suffix (a8),' +
088600150911     C                             'Covered 12 Months (d8),' +
088700150911     C                             'Jan (e8),' +
088800150911     C                             'Feb (e8),' +
088900150911     C                             'Mar (e8),' +
089000150911     C                             'Apr (e8),' +
089100150911     C                             'May (e8),' +
089200150911     C                             'Jun (e8),' +
089300150911     C                             'Jul (e8),' +
089400150911     C                             'Aug (e8),' +
089500150911     C                             'Sep (e8),' +
089600150911     C                             'Oct (e8),' +
089700150911     C                             'Nov (e8),' +
089800150911     C                             'Dec (e8),' +
089900161116     C                             'Individual SSN Or TIN (b9),' +
090000150911     C                             'DOB (c9),' +
090100150911     C                             'First Name (a9),' +
090200150911     C                             'Middle Initial (a9),' +
090300150911     C                             'Last Name (a9),' +
090400150911     C                             'Suffix (a9),' +
090500150911     C                             'Covered 12 Months (d9),' +
090600150911     C                             'Jan (e9),' +
090700150911     C                             'Feb (e9),' +
090800150911     C                             'Mar (e9),' +
090900150911     C                             'Apr (e9),' +
091000150911     C                             'May (e9),' +
091100150911     C                             'Jun (e9),' +
091200150911     C                             'Jul (e9),' +
091300150911     C                             'Aug (e9),' +
091400150911     C                             'Sep (e9),' +
091500150911     C                             'Oct (e9),' +
091600150911     C                             'Nov (e9),' +
091700150911     C                             'Dec (e9),' +
091800161116     C                             'Individual SSN Or TIN (b10),' +
091900150911     C                             'DOB (c10),' +
092000150911     C                             'First Name (a10),' +
092100150911     C                             'Middle Initial (a10),' +
092200150911     C                             'Last Name (a10),' +
092300150911     C                             'Suffix (a10),' +
092400150911     C                             'Covered 12 Months (d10),' +
092500150911     C                             'Jan (e10),' +
092600150911     C                             'Feb (e10),' +
092700150911     C                             'Mar (e10),' +
092800150911     C                             'Apr (e10),' +
092900150911     C                             'May (e10),' +
093000150911     C                             'Jun (e10),' +
093100150911     C                             'Jul (e10),' +
093200150911     C                             'Aug (e10),' +
093300150911     C                             'Sep (e10),' +
093400150911     C                             'Oct (e10),' +
093500150911     C                             'Nov (e10),' +
093600150911     C                             'Dec (e10),' +
093700161116     C                             'Individual SSN Or TIN (b11),' +
093800150911     C                             'DOB (c11),' +
093900150911     C                             'First Name (a11),' +
094000150911     C                             'Middle Initial (a11),' +
094100150911     C                             'Last Name (a11),' +
094200150911     C                             'Suffix (a11),' +
094300150911     C                             'Covered 12 Months (d11),' +
094400150911     C                             'Jan (e11),' +
094500150911     C                             'Feb (e11),' +
094600150911     C                             'Mar (e11),' +
094700150911     C                             'Apr (e11),' +
094800150911     C                             'May (e11),' +
094900150911     C                             'Jun (e11),' +
095000150911     C                             'Jul (e11),' +
095100150911     C                             'Aug (e11),' +
095200150911     C                             'Sep (e11),' +
095300150911     C                             'Oct (e11),' +
095400150911     C                             'Nov (e11),' +
095500150911     C                             'Dec (e11),' +
095600161116     C                             'Individual SSN Or TIN (b12),' +
095700150911     C                             'DOB (c12),' +
095800150911     C                             'First Name (a12),' +
095900150911     C                             'Middle Initial (a12),' +
096000150911     C                             'Last Name (a12),' +
096100150911     C                             'Suffix (a12),' +
096200150911     C                             'Covered 12 Months (d12),' +
096300150911     C                             'Jan (e12),' +
096400150911     C                             'Feb (e12),' +
096500150911     C                             'Mar (e12),' +
096600150911     C                             'Apr (e12),' +
096700150911     C                             'May (e12),' +
096800150911     C                             'Jun (e12),' +
096900150911     C                             'Jul (e12),' +
097000150911     C                             'Aug (e12),' +
097100150911     C                             'Sep (e12),' +
097200150911     C                             'Oct (e12),' +
097300150911     C                             'Nov (e12),' +
097400150911     C                             'Dec (e12),' +
097500161116     C                             'Individual SSN Or TIN (b13),' +
097600150911     C                             'DOB (c13),' +
097700150911     C                             'First Name (a13),' +
097800150911     C                             'Middle Initial (a13),' +
097900150911     C                             'Last Name (a13),' +
098000150911     C                             'Suffix (a13),' +
098100150911     C                             'Covered 12 Months (d13),' +
098200150911     C                             'Jan (e13),' +
098300150911     C                             'Feb (e13),' +
098400150911     C                             'Mar (e13),' +
098500150911     C                             'Apr (e13),' +
098600150911     C                             'May (e13),' +
098700150911     C                             'Jun (e13),' +
098800150911     C                             'Jul (e13),' +
098900150911     C                             'Aug (e13),' +
099000150911     C                             'Sep (e13),' +
099100150911     C                             'Oct (e13),' +
099200150911     C                             'Nov (e13),' +
099300150911     C                             'Dec (e13),' +
099400161116     C                             'Individual SSN Or TIN (b14),' +
099500150911     C                             'DOB (c14),' +
099600150911     C                             'First Name (a14),' +
099700150911     C                             'Middle Initial (a14),' +
099800150911     C                             'Last Name (a14),' +
099900150911     C                             'Suffix (a14),' +
100000150911     C                             'Covered 12 Months (d14),' +
100100150911     C                             'Jan (e14),' +
100200150911     C                             'Feb (e14),' +
100300150911     C                             'Mar (e14),' +
100400150911     C                             'Apr (e14),' +
100500150911     C                             'May (e14),' +
100600150911     C                             'Jun (e14),' +
100700150911     C                             'Jul (e14),' +
100800150911     C                             'Aug (e14),' +
100900150911     C                             'Sep (e14),' +
101000150911     C                             'Oct (e14),' +
101100150911     C                             'Nov (e14),' +
101200150911     C                             'Dec (e14),' +
101300161116     C                             'Individual SSN Or TIN (b15),' +
101400150911     C                             'DOB (c15),' +
101500150911     C                             'First Name (a15),' +
101600150911     C                             'Middle Initial (a15),' +
101700150911     C                             'Last Name (a15),' +
101800150911     C                             'Suffix (a15),' +
101900150911     C                             'Covered 12 Months (d15),' +
102000150911     C                             'Jan (e15),' +
102100150911     C                             'Feb (e15),' +
102200150911     C                             'Mar (e15),' +
102300150911     C                             'Apr (e15),' +
102400150911     C                             'May (e15),' +
102500150911     C                             'Jun (e15),' +
102600150911     C                             'Jul (e15),' +
102700150911     C                             'Aug (e15),' +
102800150911     C                             'Sep (e15),' +
102900150911     C                             'Oct (e15),' +
103000150911     C                             'Nov (e15),' +
103100150911     C                             'Dec (e15),' +
103200161116     C                             'Individual SSN Or TIN (b16),' +
103300150911     C                             'DOB (c16),' +
103400150911     C                             'First Name (a16),' +
103500150911     C                             'Middle Initial (a16),' +
103600150911     C                             'Last Name (a16),' +
103700150911     C                             'Suffix (a16),' +
103800150911     C                             'Covered 12 Months (d16),' +
103900150911     C                             'Jan (e16),' +
104000150911     C                             'Feb (e16),' +
104100150911     C                             'Mar (e16),' +
104200150911     C                             'Apr (e16),' +
104300150911     C                             'May (e16),' +
104400150911     C                             'Jun (e16),' +
104500150911     C                             'Jul (e16),' +
104600150911     C                             'Aug (e16),' +
104700150911     C                             'Sep (e16),' +
104800150911     C                             'Oct (e16),' +
104900150911     C                             'Nov (e16),' +
105000150911     C                             'Dec (e16),' +
105100161116     C                             'Individual SSN Or TIN (b17),' +
105200150911     C                             'DOB (c17),' +
105300150911     C                             'First Name (a17),' +
105400150911     C                             'Middle Initial (a17),' +
105500150911     C                             'Last Name (a17),' +
105600150911     C                             'Suffix (a17),' +
105700150911     C                             'Covered 12 Months (d17),' +
105800150911     C                             'Jan (e17),' +
105900150911     C                             'Feb (e17),' +
106000150911     C                             'Mar (e17),' +
106100150911     C                             'Apr (e17),' +
106200150911     C                             'May (e17),' +
106300150911     C                             'Jun (e17),' +
106400150911     C                             'Jul (e17),' +
106500150911     C                             'Aug (e17),' +
106600150911     C                             'Sep (e17),' +
106700150911     C                             'Oct (e17),' +
106800150911     C                             'Nov (e17),' +
106900150911     C                             'Dec (e17),' +
107000161116     C                             'Individual SSN Or TIN (b18),' +
107100150911     C                             'DOB (c18),' +
107200150911     C                             'First Name (a18),' +
107300150911     C                             'Middle Initial (a18),' +
107400150911     C                             'Last Name (a18),' +
107500150911     C                             'Suffix (a18),' +
107600150911     C                             'Covered 12 Months (d18),' +
107700150911     C                             'Jan (e18),' +
107800150911     C                             'Feb (e18),' +
107900150911     C                             'Mar (e18),' +
108000150911     C                             'Apr (e18),' +
108100150911     C                             'May (e18),' +
108200150911     C                             'Jun (e18),' +
108300150911     C                             'Jul (e18),' +
108400150911     C                             'Aug (e18),' +
108500150911     C                             'Sep (e18),' +
108600150911     C                             'Oct (e18),' +
108700150911     C                             'Nov (e18),' +
108800150911     C                             'Dec (e18),' +
108900161116     C                             'Individual SSN Or TIN (b19),' +
109000150911     C                             'DOB (c19),' +
109100150911     C                             'First Name (a19),' +
109200150911     C                             'Middle Initial (a19),' +
109300150911     C                             'Last Name (a19),' +
109400150911     C                             'Suffix (a19),' +
109500150911     C                             'Covered 12 Months (d19),' +
109600150911     C                             'Jan (e19),' +
109700150911     C                             'Feb (e19),' +
109800150911     C                             'Mar (e19),' +
109900150911     C                             'Apr (e19),' +
110000150911     C                             'May (e19),' +
110100150911     C                             'Jun (e19),' +
110200150911     C                             'Jul (e19),' +
110300150911     C                             'Aug (e19),' +
110400150911     C                             'Sep (e19),' +
110500150911     C                             'Oct (e19),' +
110600150911     C                             'Nov (e19),' +
110700150911     C                             'Dec (e19),' +
110800161116     C                             'Individual SSN Or TIN (b20),' +
110900150911     C                             'DOB (c20),' +
111000150911     C                             'First Name (a20),' +
111100150911     C                             'Middle Initial (a20),' +
111200150911     C                             'Last Name (a20),' +
111300150911     C                             'Suffix (a20),' +
111400150911     C                             'Covered 12 Months (d20),' +
111500150911     C                             'Jan (e20),' +
111600150911     C                             'Feb (e20),' +
111700150911     C                             'Mar (e20),' +
111800150911     C                             'Apr (e20),' +
111900150911     C                             'May (e20),' +
112000150911     C                             'Jun (e20),' +
112100150911     C                             'Jul (e20),' +
112200150911     C                             'Aug (e20),' +
112300150911     C                             'Sep (e20),' +
112400150911     C                             'Oct (e20),' +
112500150911     C                             'Nov (e20),' +
112600150911     C                             'Dec (e20),' +
112700161116     C                             'Individual SSN Or TIN (b21),' +
112800150911     C                             'DOB (c21),' +
112900150911     C                             'First Name (a21),' +
113000150911     C                             'Middle Initial (a21),' +
113100150911     C                             'Last Name (a21),' +
113200150911     C                             'Suffix (a21),' +
113300150911     C                             'Covered 12 Months (d21),' +
113400150911     C                             'Jan (e21),' +
113500150911     C                             'Feb (e21),' +
113600150911     C                             'Mar (e21),' +
113700150911     C                             'Apr (e21),' +
113800150911     C                             'May (e21),' +
113900150911     C                             'Jun (e21),' +
114000150911     C                             'Jul (e21),' +
114100150911     C                             'Aug (e21),' +
114200150911     C                             'Sep (e21),' +
114300150911     C                             'Oct (e21),' +
114400150911     C                             'Nov (e21),' +
114500150911     C                             'Dec (e21),' +
114600161116     C                             'Individual SSN Or TIN (b22),' +
114700150911     C                             'DOB (c22),' +
114800150911     C                             'First Name (a22),' +
114900150911     C                             'Middle Initial (a22),' +
115000150911     C                             'Last Name (a22),' +
115100150911     C                             'Suffix (a22),' +
115200150911     C                             'Covered 12 Months (d22),' +
115300150911     C                             'Jan (e22),' +
115400150911     C                             'Feb (e22),' +
115500150911     C                             'Mar (e22),' +
115600150911     C                             'Apr (e22),' +
115700150911     C                             'May (e22),' +
115800150911     C                             'Jun (e22),' +
115900150911     C                             'Jul (e22),' +
116000150911     C                             'Aug (e22),' +
116100150911     C                             'Sep (e22),' +
116200150911     C                             'Oct (e22),' +
116300150911     C                             'Nov (e22),' +
116400150911     C                             'Dec (e22),' +
116500161116     C                             'Individual SSN Or TIN (b23),' +
116600150911     C                             'DOB (c23),' +
116700150911     C                             'First Name (a23),' +
116800150911     C                             'Middle Initial (a23),' +
116900150911     C                             'Last Name (a23),' +
117000150911     C                             'Suffix (a23),' +
117100150911     C                             'Covered 12 Months (d23),' +
117200150911     C                             'Jan (e23),' +
117300150911     C                             'Feb (e23),' +
117400150911     C                             'Mar (e23),' +
117500150911     C                             'Apr (e23),' +
117600150911     C                             'May (e23),' +
117700150911     C                             'Jun (e23),' +
117800150911     C                             'Jul (e23),' +
117900150911     C                             'Aug (e23),' +
118000150911     C                             'Sep (e23),' +
118100150911     C                             'Oct (e23),' +
118200150911     C                             'Nov (e23),' +
118300150911     C                             'Dec (e23),' +
118400161116     C                             'Individual SSN Or TIN (b24),' +
118500150911     C                             'DOB (c24),' +
118600150911     C                             'First Name (a24),' +
118700150911     C                             'Middle Initial (a24),' +
118800150911     C                             'Last Name (a24),' +
118900150911     C                             'Suffix (a24),' +
119000150911     C                             'Covered 12 Months (d24),' +
119100150911     C                             'Jan (e24),' +
119200150911     C                             'Feb (e24),' +
119300150911     C                             'Mar (e24),' +
119400150911     C                             'Apr (e24),' +
119500150911     C                             'May (e24),' +
119600150911     C                             'Jun (e24),' +
119700150911     C                             'Jul (e24),' +
119800150911     C                             'Aug (e24),' +
119900150911     C                             'Sep (e24),' +
120000150911     C                             'Oct (e24),' +
120100150911     C                             'Nov (e24),' +
120200150911     C                             'Dec (e24),' +
120300161116     C                             'Individual SSN Or TIN (b25),' +
120400150911     C                             'DOB (c25),' +
120500150911     C                             'First Name (a25),' +
120600150911     C                             'Middle Initial (a25),' +
120700150911     C                             'Last Name (a25),' +
120800150911     C                             'Suffix (a25),' +
120900150911     C                             'Covered 12 Months (d25),' +
121000150911     C                             'Jan (e25),' +
121100150911     C                             'Feb (e25),' +
121200150911     C                             'Mar (e25),' +
121300150911     C                             'Apr (e25),' +
121400150911     C                             'May (e25),' +
121500150911     C                             'Jun (e25),' +
121600150911     C                             'Jul (e25),' +
121700150911     C                             'Aug (e25),' +
121800150911     C                             'Sep (e25),' +
121900150911     C                             'Oct (e25),' +
122000150911     C                             'Nov (e25),' +
122100200102     C                             'Dec (e25),' +
122200200102     C                             'ACA State Filing'
122300150702    * *
122400150702     C                   EXCEPT    OUTFA
122500150702   X* *
122600150702    * *
122700150702     C                   ENDSR
122800150702    * *
122900150911     OIRSCSVP   EADD         OUTFA
123000161221     O                       @OUTPUT          12000
