0001000204020002  *****************************************************************************
000200150915      * IRS95CBLR  Group Benefit Services                                         *
000300150924      *            WRITTEN BY - R.L.J.                                            *
000400150924      *            DATE - 09/2015                                                 *
000500150915      *  DESCRIPTION - Build file IRS 1095C for a TSA                             *
000600150924      *                                                                           *
0007000204020002  *****************************************************************************
0008000204020015  *  Change Log:                                                              *
000900060427      *  xxx mm/dd/yyyy                                                           *
001000150924      *                                                                *
0011001509170018 F******************************************************************
0012001509240019 FACCMST    IF   E           K DISK
0013001509300019 FAC2MST    IF   E           K DISK
001400150928     FMCOVMPLN  IF   E           K DISK
001500150924     FMEMAC#1   IF   E           K DISK
001600150928     FPLNMST    IF   E           K DISK
001700150928     FCODES     IF   E           K DISK
0018001509280020 FIRS95CP   UF A E           K DISK
0019001509240025  *
002000150924    * *
002100150924     D                 DS
002200150924     D @KEYPRM                 1     10A
002300150924     D #KTRST                  1      3S 0
002400150924     D #KSUB#                  4      6S 0
002500150924     D #KACCT                  7     10S 0
0026001509240025  *
0027001509240250 D                 DS
0028001509150251 D azip                    1      9  0
0029001509150251 D  azip5                  1      5
0030001509150251 D  azip4                  6      9
0031001509280025  *
0032001509280250 D                 DS
0033001509280251 D zip                     1      9  0
0034001801180251 D  mzip9                  1      9
0035001801180251 D  mzip5                  1      5
0036001509280251 D  mzip4                  6      9
0037001509280025  *
0038001509280250 D                 DS
0039001509280251 D mbenrl                  1      8  0
0040001509280251 D  enrmm                  5      6
0041000604270025  *
0042001509280250 D                 DS
0043001509280251 D   emprinfo              1    201
0044001509280251 D    i5enm1               1     40
0045001509280251 D    i5enm2              41     80
0046001509280251 D    i5ead1              81    110
0047001509280251 D    i5ead2             111    140
0048001509280251 D    i5ecty             141    160
0049001509280251 D    i5est              161    162
0050001509280251 D    i5ezp5             163    167
0051001509280251 D    i5ezp4             168    171
0052001509280251 D    i5ephn             172    181
0053001509280251 D    i5epex             182    189
0054001509280251 D    i5eid              190    201
0055001509280025  *
0056001509280250 D                 DS
0057001509280251 D   covall                1     12
0058001509280251 D    cov01                1      1
0059001509280251 D    cov02                2      2
0060001509280251 D    cov03                3      3
0061001509280251 D    cov04                4      4
0062001509280251 D    cov05                5      5
0063001509280251 D    cov06                6      6
0064001509280251 D    cov07                7      7
0065001509280251 D    cov08                8      8
0066001509280251 D    cov09                9      9
0067001509280251 D    cov10               10     10
0068001509280251 D    cov11               11     11
0069001509280251 D    cov12               12     12
007000150928      *
007100150928     D                 DS
007200150928     D plncat                  1      3
007300150928     D   cdkey1                1      1
007400150928     D   cdkey2                2      3
007500150928      *
0076000604270025  *
0077000604270250 D                 DS
0078001509280251 D  svempr                      201
0079001509300251 D  a2typ                         1    INZ('F')
0080001509280251 D  cutoff                         D   DATFMT(*ISO)
0081000604270251 D  cutofn                        8S 0
0082000604270251 D  sal92                         9S 2
0083001509280251 D  mseq#                         2  0 INZ(0)
0084000604280251 D  sps                           1
0085000604280251 D  deplif                        1
0086000605040251 D  trst600                       3  0 INZ(600)
0087000605040251 D  sub#3                         3  0 INZ(3)
008800020415      *
008900150915    * *
009000150915     C     acckey        KLIST
009100150915     C                   KFLD                    #ktrst
009200150915     C                   KFLD                    #ksub#
009300150915     C                   KFLD                    #kacct
009400150930    * *
009500150930     C     ac2key        KLIST
009600150930     C                   KFLD                    a2typ
009700150930     C                   KFLD                    #ktrst
009800150930     C                   KFLD                    #ksub#
009900150930     C                   KFLD                    #kacct
010000150928    * *
010100150928     C     covkey        KLIST
010200150928     C                   KFLD                    mbssno
010300150928     C                   KFLD                    mseq#
010400150928     C                   KFLD                    #ktrst
010500150928     C                   KFLD                    #ksub#
010600150928    * *
010700150928     C     plnkey        KLIST
010800150928     C                   KFLD                    mctrst
010900150928     C                   KFLD                    mcsub#
011000150928     C                   KFLD                    mcplan
011100150928    * *
011200150928     C     codkey        KLIST
011300150928     C                   KFLD                    cdkey1
011400150928     C                   KFLD                    cdkey2
011500150915    * *
011600150915    * *
011700150915    * *
011800150915     C     *ENTRY        PLIST
011900150915     C                   PARM                    @PARM            10
012000150915     C                   MOVEL(P)  @PARM         @KEYPRM
012100150915    * *
0122001509150291  *        Get Account Record
0123001509220297 C     acckey        chain     accmst                             21
0124001509220296 C                   If        *in21 = '0'
0125001509220291  *
0126001509220291 C                   clear                   irs95cr
0127001509220291 C                   exsr      bldacc
0128001509280291 C                   eval      svempr = emprinfo
0129001509220291  *
013000150922      *        Locate members in TSA
0131001509160297 C     acckey        setll     memac#1                            22
0132001509220296 C                   dou       *in22 = '1'
0133001509160297 C     acckey        reade     memac#1                                22
0134001509280296 C                   if        *in22 = '0'
0135001509280291  *
0136001509280296 C                   if        mbenrl = termdt
0137001509280296 C                   iter
0138001509280296 C                   endif
0139001509280291  *
0140001509280296 C                   If        mbenrl < 20160101 and
0141001509280296 C                             (termdt = 0 or termdt > 20141231)
0142001509280291 C                   exsr      bldmbr
0143000605040291  *
0144001509280297 C                   endif                                                  *in21 = '1'
0145001509280297 C                   endif                                                  *in21 = '1'
0146001509280291  *
0147001509280297 C                   enddo                                                  *in21 = '1'
0148001509280291  *
0149001509280297 C                   endif                                                  *in21 = '1'
0150000605040291  *
0151000204020297 C                   movel     '1'           *inlr
0152000204020297 C                   return
0153000605040291  *
0154000605040107  ********************************************************************************
0155000204020107  *
0156001509150107  *     BLDACC - Build Account portion of record
0157000204020107  *
0158000204020107  ********************************************************************************
015900150915     C     bldacc        begsr
0160000604270107  *
016100150915     C                   movel(P)  acnam1        i5enm1
016200150915     C                   movel(P)  acnam2        i5enm2
016300150915     C                   movel(P)  aaddr1        i5ead1
016400150915     C                   movel(P)  aaddr2        i5ead2
016500150915     C                   movel(P)  acity         i5ecty
016600150915     C                   movel(P)  astate        i5est
016700150915     C                   movel     azip5         i5ezp5
016800150915     C                   movel     azip4         i5ezp4
0169001510210296 C                   If        i5ezp4 = '0000'
017000151021     C                   movel(P)  *blanks       i5ezp4
017100151021     C                   endif
017200150915     C                   movel     aarea         i5ephn
017300150915     C                   move      aphone        i5ephn
0174001509300291  *        Get Acc 2 Record
0175001509300297 C     ac2key        chain     ac2mst                             31
0176001509300296 C                   If        *in31 = '0' and a2tax_id# <> 0
017700150930     C                   movel(P)  a2tax_id#     i5eid
017800150930     C                   else
017900150928     C                   movel(P)  @keyprm       i5eid
018000150930     C                   endif
0181001509150107  *                                                                     **********
018200150915     C                   endsr
0183001509150107  ********************************************************************************
0184001509150107  *
0185001509150107  *     BLDMBR - Build Member record
0186001509150107  *
0187001509150107  ********************************************************************************
018800150915     C     bldmbr        begsr
0189001509150107  *
0190001509280296 C                   clear                   irs95cr
0191001509280107  *
0192001509280296 C                   eval      emprinfo = svempr
0193001509150107  *
019400150928     C                   movel     mbssno        i5mssn
019500150928     C                   movel     mfname        i5mfnm
019600150928     C                   move      mmi           i5mmi
019700150928     C                   movel     mlname        i5mlnm
019800150928     C                   movel     addr1         i5mad1
019900150928     C                   movel     addr2         i5mad2
020000150928     C                   movel     city          i5mcty
020100150928     C                   movel     state         i5mst
020200150928     C                   movel     mlname        i5mlnm
020300150928     C                   movel     mlname        i5mlnm
020400150928     C                   movel     mlname        i5mlnm
020500180118     C                   movel     mzip9         i5mzip
0206001801180296 C****               If        i5mzp4 = '0000'
020700180118     C****               movel(P)  *blanks       i5mzp4
020800180118     C****               endif
020900151014     C                   movel(P)  fill66        i5meml
0210001509280107  *        Person 1 info (same as mbr)
0211001509290107  *          Leave blank for FI - Per KT
021200150929     C*******            movel     mbssno        i51ssn
021300150929     C**                 movel     mfname        i51fnm
021400150929     C**                 move      mmi           i51mi
021500150929     C********           movel     mlname        i51lnm
0216001802060107  *        Plan Offer Info
0217001802060296 C                   If        mbenrl < 20150201
021800180206     C                   eval      i5mpls = '01'
021900180206     C                   else
022000180206     C                   eval      i5mpls = enrmm
022100180206     C                   endif
022200180206      *           All 2015 Months?
0223001802060296 C                   If        mbenrl < 20150201 and
0224001802060296 C                             (termdt = 0 or termdt > 20151231)
022500180206     C                   eval      i5mcall = '1A'
022600180206     C                   else
022700180206      *               Jan?
0228001802060296 C                   If        mbenrl < 20150201 and
0229001802060296 C                             (termdt = 0 or termdt > 20150101)
023000180206     C                   eval      i5mcm1 = '1A'
023100180206     C                   endif
023200180206      *               Feb?
0233001509280296 C                   If        mbenrl < 20150301 and
0234001509280296 C                             (termdt = 0 or termdt > 20150201)
023500150928     C                   eval      i5mcm2 = '1A'
023600150928     C                   endif
023700150928      *               Mar?
0238001509280296 C                   If        mbenrl < 20150401 and
0239001509280296 C                             (termdt = 0 or termdt > 20150301)
024000150928     C                   eval      i5mcm3 = '1A'
024100150928     C                   endif
024200150928      *               Apr?
0243001509280296 C                   If        mbenrl < 20150501 and
0244001509280296 C                             (termdt = 0 or termdt > 20150401)
024500150928     C                   eval      i5mcm4 = '1A'
024600150928     C                   endif
024700150928      *               May?
0248001509280296 C                   If        mbenrl < 20150601 and
0249001509280296 C                             (termdt = 0 or termdt > 20150501)
025000150928     C                   eval      i5mcm5 = '1A'
025100150928     C                   endif
025200150928      *               Jun?
0253001509280296 C                   If        mbenrl < 20150701 and
0254001509280296 C                             (termdt = 0 or termdt > 20150601)
025500150928     C                   eval      i5mcm6 = '1A'
025600150928     C                   endif
025700150928      *               Jul?
0258001509280296 C                   If        mbenrl < 20150801 and
0259001509280296 C                             (termdt = 0 or termdt > 20150701)
026000150928     C                   eval      i5mcm7 = '1A'
026100150928     C                   endif
026200150928      *               Aug?
0263001509280296 C                   If        mbenrl < 20150901 and
0264001509280296 C                             (termdt = 0 or termdt > 20150801)
026500150928     C                   eval      i5mcm8 = '1A'
026600150928     C                   endif
026700150928      *               Sep?
0268001509280296 C                   If        mbenrl < 20151001 and
0269001509280296 C                             (termdt = 0 or termdt > 20150901)
027000150928     C                   eval      i5mcm9 = '1A'
027100150928     C                   endif
027200150928      *               Oct?
0273001509280296 C                   If        mbenrl < 20151101 and
0274001509280296 C                             (termdt = 0 or termdt > 20151001)
027500150928     C                   eval      i5mcm10 = '1A'
027600150928     C                   endif
027700150928      *               Nov?
0278001509280296 C                   If        mbenrl < 20151201 and
0279001509280296 C                             (termdt = 0 or termdt > 20151101)
028000150928     C                   eval      i5mcm11 = '1A'
028100150928     C                   endif
028200150928      *               Dec?
0283001509280296 C                   If        mbenrl < 20160101 and
0284001509280296 C                             (termdt = 0 or termdt > 20151201)
028500150928     C                   eval      i5mcm12 = '1A'
028600150928     C                   endif
0287001509280107  *
028800150928     C                   endif
0289001509280107  *
0290001509280107  *        Determine Coverage Time Frame for Member
029100150928     C                   eval      covall = '000000000000'
0292000604270107  *
029300150928      *           Find Medical Plan Coverage
0294001509280297 C     covkey        setll     mcovmpln                           23
0295001509280296 C                   dou       *in23 = '1'
0296001509280297 C     covkey        reade     mcovmpln                               23
0297001509280296 C                   if        *in23 = '0'
0298001509280107  *
0299001509280296 C                   If        candt <> 0 and candt < 20150101
030000150928     C                   iter
030100150928     C                   endif
0302001509280107  *
0303001509280296 C                   If        enrldt > 20151231
030400150928     C                   iter
030500150928     C                   endif
030600150928      *           Get Plan rec to chk for MED
0307001509280297 C     plnkey        chain     plnmst                             24
0308001509280296 C                   if        *in24 = '0'
0309001509280107  *
0310001509280297 C     codkey        chain     codes                              25
0311001509280296 C                   if        *in25 = '0'
0312001509280107  *
031300150928     C                   if        action <> 'M'
031400150928     C                   iter
031500150928     C                   endif
0316001509280107  *
031700150928      *           All 2015 Months?
0318001509280296 C                   If        enrldt < 20150201 and
0319001509280296 C                             (candt = 0 or candt > 20151231)
032000150928     C                   eval      i5mhall = '2C'
032100150928     C                   eval      covall = '111111111111'
032200150928     C                   leave
032300150928     C                   endif
032400150928      *               Jan?
0325001509280296 C                   If        enrldt < 20150201 and
0326001509280296 C                             (candt = 0 or candt > 20150101)
032700150928     C                   eval      cov01 = '1'
032800150928     C                   endif
032900150928      *               Feb?
0330001509280296 C                   If        enrldt < 20150301 and
0331001509280296 C                             (candt = 0 or candt > 20150201)
033200150928     C                   eval      cov02 = '1'
033300150928     C                   endif
033400150928      *               Mar?
0335001509280296 C                   If        enrldt < 20150401 and
0336001509280296 C                             (candt = 0 or candt > 20150301)
033700150928     C                   eval      cov03 = '1'
033800150928     C                   endif
033900150928      *               Apr?
0340001509280296 C                   If        enrldt < 20150501 and
0341001509280296 C                             (candt = 0 or candt > 20150401)
034200150928     C                   eval      cov04 = '1'
034300150928     C                   endif
034400150928      *               May?
0345001509280296 C                   If        enrldt < 20150601 and
0346001509280296 C                             (candt = 0 or candt > 20150501)
034700150928     C                   eval      cov05 = '1'
034800150928     C                   endif
034900150928      *               Jun?
0350001509280296 C                   If        enrldt < 20150701 and
0351001509280296 C                             (candt = 0 or candt > 20150601)
035200150928     C                   eval      cov06 = '1'
035300150928     C                   endif
035400151002      *               Jul?
0355001510020296 C                   If        enrldt < 20150801 and
0356001510020296 C                             (candt = 0 or candt > 20150701)
035700151002     C                   eval      cov07 = '1'
035800151002     C                   endif
035900151002      *               Aug?
0360001510020296 C                   If        enrldt < 20150901 and
0361001510020296 C                             (candt = 0 or candt > 20150801)
036200151002     C                   eval      cov08 = '1'
036300151002     C                   endif
036400151002      *               Sep?
0365001510020296 C                   If        enrldt < 20151001 and
0366001510020296 C                             (candt = 0 or candt > 20150901)
036700151002     C                   eval      cov09 = '1'
036800150928     C                   endif
036900150928      *               Oct?
0370001509280296 C                   If        enrldt < 20151101 and
0371001509280296 C                             (candt = 0 or candt > 20151001)
037200150928     C                   eval      cov10 = '1'
037300150928     C                   endif
037400150928      *               Nov?
0375001509280296 C                   If        enrldt < 20151201 and
0376001509280296 C                             (candt = 0 or candt > 20151101)
037700150928     C                   eval      cov11 = '1'
037800150928     C                   endif
037900150928      *               Dec?
0380001509280296 C                   If        enrldt < 20160101 and
0381001509280296 C                             (candt = 0 or candt > 20151201)
038200150928     C                   eval      cov12 = '1'
038300150928     C                   endif
038400150928      *
038500060427     C                   endif
038600150928      *
038700150928     C                   endif
0388001509280107  *
038900060427     C                   endif
0390000303270107  *
039100150928     C                   enddo
0392001509280107  *
039300150928     C                   If        covall = '111111111111'
039400150928     C                   eval      i5mhall = '2C'
039500150929     C*****              eval      i51call = '1'
039600150928     C                   else
0397001509280107  *
039800150928     C                   If        cov01 = '1'
039900150928     C                   eval      i5mhm1 = '2C'
040000150929     C******             eval      i51cm1 = '1'
040100150928     C                   endif
0402001509280107  *
040300150928     C                   If        cov02 = '1'
040400150928     C                   eval      i5mhm2 = '2C'
040500150929     C******             eval      i51cm2 = '1'
040600150928     C                   endif
0407001509280107  *
040800150928     C                   If        cov03 = '1'
040900150928     C                   eval      i5mhm3 = '2C'
041000150929     C******             eval      i51cm3 = '1'
041100150928     C                   endif
0412001509280107  *
041300150928     C                   If        cov04 = '1'
041400150928     C                   eval      i5mhm4 = '2C'
041500150929     C******             eval      i51cm4 = '1'
041600150928     C                   endif
0417001509280107  *
041800150928     C                   If        cov05 = '1'
041900150928     C                   eval      i5mhm5 = '2C'
042000150929     C******             eval      i51cm5 = '1'
042100150928     C                   endif
0422001509280107  *
042300150928     C                   If        cov06 = '1'
042400150928     C                   eval      i5mhm6 = '2C'
042500150929     C*****              eval      i51cm6 = '1'
042600150928     C                   endif
0427001509280107  *
042800150928     C                   If        cov07 = '1'
042900150928     C                   eval      i5mhm7 = '2C'
043000150929     C*****              eval      i51cm7 = '1'
043100150928     C                   endif
0432001509280107  *
043300150928     C                   If        cov08 = '1'
043400150928     C                   eval      i5mhm8 = '2C'
043500150929     C******             eval      i51cm8 = '1'
043600150928     C                   endif
0437001509280107  *
043800150928     C                   If        cov09 = '1'
043900150928     C                   eval      i5mhm9 = '2C'
044000150929     C******             eval      i51cm9 = '1'
044100150928     C                   endif
0442001509280107  *
044300150928     C                   If        cov10 = '1'
044400150928     C                   eval      i5mhm10 = '2C'
044500150929     C*******            eval      i51cm10 = '1'
044600150928     C                   endif
0447001509280107  *
044800150928     C                   If        cov11 = '1'
044900150928     C                   eval      i5mhm11 = '2C'
045000150929     C*******            eval      i51cm11 = '1'
045100150928     C                   endif
0452001509280107  *
045300150928     C                   If        cov12 = '1'
045400150928     C                   eval      i5mhm12 = '2C'
045500150929     C******             eval      i51cm12 = '1'
045600150928     C                   endif
0457000604270107  *
045800150928     C                   endif
0459000604270296  *
046000150928     C                   write     IRS95CR
0461000204150107  *
046200020415     C                   endsr
