000100160513      *===========================================================================
000200160512     H option(*noDebugIo)
000300160513      *===========================================================================
000400181031      * KAISER011R - Kaiser - Select records to be sent
000500180313      *================================================================================
000600180313      * Date        Int   Description
000700180313      * ----------  ---   -------------------------------------------------------------
000800180314      * 03/14/2018  jt    Original creation
000900160513      *===========================================================================
001000160512
001100181108     fkaiserdtl uf a e           k disk    rename(kaiserdr:mainFile)
001200180523
001300181108     fkaiserdtl1if   e           k disk    rename(kaiserdr:mainFile2)
001400181108
001500181101     fkaiserdtlsif   e           k disk    rename(kaiserdsr:savedFile)
001600181108     f                                     prefix(m)
001700181101
001800181108     fkaiserdtlxif a e           k disk    rename(kaiserdr:finalFile)
001900181108
002000181101     fkaiserhld if a e           k disk    rename(kaiserdfr:holdFile)
002100181101
002200181030      *================================================================================
002300181030      *   opcode to convert yyyymmdd to mmddyyyy
002400181030      *   xxx = %editc( %dec(%char(%date(numericdate:*iso):*mdy0):8:0):'X');
002500160512      *=================================================================
002600061017
002700181101     d writeRcd        s              1
002800181101     d today           s              8  0
002900150820
003000160511      //==================================================================
003100160511      // mainline
003200160511      //===================================================================
003300150820
003400160511       exsr init;
003500160511       exsr main;
003600160511       exsr exit;
003700160511
003800180309      //===================================================================
003900181030      // main
004000180309      //===================================================================
004100180309
004200181101       begsr main;
004300180309
004400181108        // Get new records...
004500181106        setll *loval mainFile;
004600181106        read mainFile;
004700181106
004800181106        dow not %eof;
004900181106
005000181108         exsr findMember;
005100181106
005200181106        read mainFile;
005300181106        enddo;
005400181108
005500181108        // Get records that changed...
005600181101        setll *loval mainFile;
005700181101        read mainFile;
005800180309
005900180309        dow not %eof;
006000180309
006100181101         exsr compare;
006200181101
006300181101         if writeRcd = 'Y';
006400181101          exsr writeMember;
006500181101         endif;
006600180309
006700181101        read mainFile;
006800180309        enddo;
006900180309
007000181108        // Get all records for the ones that changed...
007100181108        setll *loval holdFile;
007200181108        read holdFile;
007300181108
007400181108        dow not %eof;
007500181108
007600181108         exsr get_allRecords;
007700181108
007800181108        read holdFile;
007900181108        enddo;
008000181108
008100180309       endsr;
008200180309
008300160511      //===================================================================
008400181101      // compare
008500160511      //===================================================================
008600160511
008700181101       begsr compare;
008800160511
008900181101        writeRcd = 'N';
009000181101
009100181108        chain (dmssn:dsssn:ddob:dlast:dfirst:dmit) savedFile;
009200181030        if %found;
009300181101
009400181108         if dadd1 <> mdadd1;
009500181101          writeRcd = 'Y';
009600181101         endif;
009700181101
009800181108         if dadd2 <> mdadd2;
009900181101          writeRcd = 'Y';
010000181101         endif;
010100181101
010200181108         if dcityd <> mdcityd;
010300181101          writeRcd = 'Y';
010400181101         endif;
010500181101
010600181108         if dstated <> mdstated;
010700181101          writeRcd = 'Y';
010800181101         endif;
010900181101
011000181108         if dcityd <> mdcityd;
011100181101          writeRcd = 'Y';
011200181101         endif;
011300181101
011400181108         if dzipd <> mdzipd;
011500181101          writeRcd = 'Y';
011600181101         endif;
011700181101
011800190304         if dhphone <> mdhphone;
011900181101          writeRcd = 'Y';
012000181101         endif;
012100181101
012200181108         if dwphone <> mdwphone;
012300181101          writeRcd = 'Y';
012400181101         endif;
012500181101
012600181108         if deffdate <> mdeffdate;
012700181108          writeRcd = 'Y';
012800181108         endif;
012900181108
013000181108         if dtrmdate <> mdtrmdate;
013100181108          writeRcd = 'Y';
013200181108         endif;
013300190304
013400190304         if dgrp# <> mdgrp#;
013500190304          writeRcd = 'Y';
013600190304         endif;
013700190304
013800181030        endif;
013900180508
014000160511       endsr;
014100160511
014200181101      //===================================================================
014300181101      // write member
014400181101      //===================================================================
014500181101
014600181101       begsr writeMember;
014700181101
014800181101        write holdFile;
014900180523
015000160516       endsr;
015100180424
015200181108      //===================================================================
015300181108      // compare equal
015400181108      //===================================================================
015500181108
015600181108       begsr findMember;
015700181108
015800181108        chain (dmssn:dsssn:ddob:dlast:dfirst:dmit) savedFile;
015900181108        if not %found;
016000181108         write finalFile;
016100181108        endif;
016200181108
016300181108       endsr;
016400181108
016500181108      //===================================================================
016600181108      // compare equal
016700181108      //===================================================================
016800181108
016900181108       begsr get_allRecords;
017000181108
017100181108        setll dsssn mainFile2;
017200181108        reade dsssn mainFile2;
017300181108        dow not %eof;
017400181108
017500181108         chain (dmssn:dsssn:ddob:dlast:dfirst:dmit) finalFile;
017600181108         if not %found;
017700181108          write finalFile;
017800181108         endif;
017900181108
018000181108        reade dsssn mainFile2;
018100181108        enddo;
018200181108
018300181108       endsr;
018400181108
018500160511      //===================================================================
018600160511      // exit
018700160511      //===================================================================
018800160511
018900160511       begsr exit;
019000160511
019100160511        *inlr = '1';
019200160511        return;
019300160511
019400160511       endsr;
019500160511
019600160511      //===================================================================
019700160511      // init
019800160511      //===================================================================
019900160520
020000160511       begsr init;
020100160511
020200160519        today = %dec(%char(%date:*iso0):8:0);
020300170710
020400160511       endsr;
020500010412
020600160511       //==============================================================
