000100210825     FLAYOUT    IPE  E           K DISK
000200210825     FLAYCSVP   O  A F 2000        DISK
000300050823   X***X
000400060315     D @OUTPUT         S           2000A   INZ
000500051108     D @C              C                   CONST('","')
000600051108    ***
0007000704030025  *
0008002108250025  *
0009002108250250 D                 DS
0010002108250251 D  whfobo                 1      5  0
0011002108250251 D   ahfobo                1      5
0012002108250025  *
0013002108250250 D                 DS
0014002108250251 D  whfldb                 1      5  0
0015002108250251 D   ahfldb                1      5
0016002108250025  *
001700081114      *
001800080313     C                   CLEAR                   @OUTPUT
001900210825     C                   EVAL      @OUTPUT = (whfile) + ',' +
002000210825     C                             (whlib) + ',' +
002100210825     C                             (whfldi) + ',' +
002200210825     C                             (whftxt) + ',' +
002300210825     C                             (ahfobo) + ',' +
002400210825     C                             (ahfldb)
002500201006    * *
002600060315     C                   EXCEPT    OUTFA
002700201006   S* *
002800201006     C     *INZSR        BEGSR
002900201006    * *
003000210825     C                   EVAL      @OUTPUT = 'File,' +
003100210825     C                             'Library,' +
003200210825     C                             'Field Name,' +
003300210825     C                             'Description,' +
003400210825     C                             'Position,' +
003500210825     C                             'Length'
003600201006    * *
003700201006     C                   EXCEPT    OUTFA
003800201006    * *
003900201006     C                   ENDSR
004000201006    * *
004100201006     C
004200060315    ***
004300210825     OLAYCSVP   EADD         OUTFA
004400060315     O                       @OUTPUT           2000
