000100180323      *=========================================================================
000200180323     h dftactgrp(*no) option(*noDebugIo) bnddir('GBSBIND')
000300180323      *=========================================================================
000400210504      * METCENR - Run MetLife Census
000500180326      *========================================================================
000600180326      * Date         Int  Description
000700180326      * ---------    ---  -----------------------------------------------------
000800200213      * 02/13/2020   jt   Original Creation
000900180326      *========================================================================
001000180628
001100210504     fmetcend   cf   e             WorkStn Handler('PROFOUNDUI(HANDLER)')
001200180323
001300180323      //========================================================================
001400180323
001500180323     d psds           sds
001600180323     d proc_name         *proc
001700180323
001800210504     d runCensus       pr                  ExtPgm('METLIFECSC')
001900210504     d  strust                        2    const
001901210504     d  smonth                        2    const
002000180323
002100180323      //========================================================================
002200180323      // mainline
002300180323      //========================================================================
002400180323
002500180323       exsr init;
002600180323       exsr main;
002700180323       exsr exit;
002800180323
002900180323      //========================================================================
003000180323      // main
003100180323      //========================================================================
003200180323
003300180323       begsr main;
003400180323
003500180323        dow btnExit = '0';
003600180323
003700180323         exfmt screen1;
003800180323
003900180323         exsr checkButton;
004000180323
004100180323        enddo;
004200180323
004300180323       endsr;
004400180323
004500180323      //========================================================================
004600180323      // checkButton
004700180323      //========================================================================
004800180323
004900180323       begsr checkButton;
005200180323
005300180323        if btnExit = '1';
005400180323         leavesr;
005500210504        endif;
005600180323
005700180323        if btnEnter = '1';
005800180323         exsr validCheck;
005900180323        endif;
006000180323
006100210504        if errTrust = '0' and errMonth = '0';
006101210504         exfmt msgWindow;
006200210504         runCensus(strust : smonth);
006300180323        endif;
006400180323
006500180405        btnEnter = '0';
006600180323
006700180323       endsr;
006800180323
006900180323      //========================================================================
007000180323      // valid check
007100180323      //========================================================================
007200180323
007300180323       begsr validCheck;
007400180323
007500210504        errTrust = '0';
007501210504        errMonth = '0';
007600180323
007700210504        if strust = ' ';
007800210504         errTrust = '1';
007900180323        endif;
008000180323
008001210504        if sMonth = ' ';
008002210504         errMonth = '1';
008003210504        endif;
008004210504
008100180323       endsr;
008200180323
008300180323      //========================================================================
008400180323      // exit
008500180323      //========================================================================
008600180323
008700180323       begsr exit;
008800180323
008900180323        *inlr = '1';
009000180323        return;
009100180323
009200180323       endsr;
009300180323
009400180323      //========================================================================
009500180323      // init
009600180323      //========================================================================
009700180323
009800180323       begsr init;
009900180323
010000180323        btnEnter = '0';
010100180323        btnExit = '0';
010300180323        pgmname = proc_name;
010400210504        sTrust = ' ';
010401210504        sMonth = ' ';
010600180323
010700180323       endsr;
010800180323
010900180323      //========================================================================
