0001000204020002  **************************************************************************
000200190731      * METLDELR   Group Benefit Services
000300020402      *            WRITTEN BY - R.L.J.
000400190731      *            DATE - 07/2019
000500020403      *  DESCRIPTION - Compare Hold file with Current file to produce
000600191002      *                Change file. Create control file data.
0007000204020002  **************************************************************************
0008001910010015  *  Change Log:
000900191001      *   10.01.2019 RLJ Added subroutine to create control file
001000191002      *                  with record count and time stamp.
001100191001      *                                                                *
0012009102150018 F******************************************************************
0013001907310020 FMETLDTHP  IF   E           K DISK
0014001907310020 FMETLDHDP  IF   E           K DISK
0015001907310020 FMETLCHGP  O  A E             DISK
0016001910010020 FMETLDCTLP O  A E             DISK
0017000907210029  *
0018000907210250 D                 DS
0019000204030251 D  getcur                 1      1    INZ(*blank)
0020000204030251 D  gethld                 2      2    INZ(*blank)
0021000204030029  *
0022000204030250 D                 DS
0023001907310251 D  curkey                 1     39
0024001907310251 D*  mdssn                 1      9
0025001907310251 D*  mdpltp               10     39
0026000505250029  *
0027001907310250 D                 DS
0028001907310251 D  hldkey                 1     39
0029001907310251 D*  mhssn                 1      9
0030001907310251 D*  mhpltp               10     39
0031001907310029  *
0032000204030250 D                 DS
0033001907310251 D  curmet                 1    356
0034001907310251 D   mdsys                 1      3
0035001907310251 D   mdssn                 4     12
0036001907310251 D   mdsex                13     20
0037001907310251 D   mddob                21     30
0038001907310251 D   mdfnam               31     55
0039001907310251 D   mdlnam               56     90
0040001907310251 D   mdadr1               91    120
0041001907310251 D   mdadr2              121    150
0042001907310251 D   mdcity              151    180
0043001907310251 D   mdst                181    182
0044001907310251 D   mdzip               183    187
0045001907310251 D   mdzip4              188    191
0046001907310251 D   mdphon              192    201
0047001907310251 D   mdeml               202    266
0048001907310251 D   mdplan              267    270
0049001907310251 D   mdpltp              271    300
0050001907310251 D   mdpsts              301    310
0051001907310251 D   mdpefd              311    320
0052001907310251 D   mdpisd              321    330
0053001907310251 D   mdptmd              331    340
0054001907310251 D   mdpefn              341    348  0
0055001907310251 D   mdptmn              349    356  0
0056000505250029  *
0057000505250250 D                 DS
0058001907310251 D  hldmet                 1    356
0059001907310251 D   mhsys                 1      3
0060001907310251 D   mhssn                 4     12
0061001907310251 D   mhsex                13     20
0062001907310251 D   mhdob                21     30
0063001907310251 D   mhfnam               31     55
0064001907310251 D   mhlnam               56     90
0065001907310251 D   mhadr1               91    120
0066001907310251 D   mhadr2              121    150
0067001907310251 D   mhcity              151    180
0068001907310251 D   mhst                181    182
0069001907310251 D   mhzip               183    187
0070001907310251 D   mhzip4              188    191
0071001907310251 D   mhphon              192    201
0072001907310251 D   mheml               202    266
0073001907310251 D   mhplan              267    270
0074001907310251 D   mhpltp              271    300
0075001907310251 D   mhpsts              301    310
0076001907310251 D   mhpefd              311    320
0077001907310251 D   mhpisd              321    330
0078001907310251 D   mhptmd              331    340
0079001907310251 D   mhpefn              341    348  0
0080001907310251 D   mhptmn              349    356  0
0081000809040029  *
0082000809040250 D                 DS
0083001907310251 D  chgmet                 1    356
0084001907310251 D   mcsys                 1      3
0085001907310251 D   mcssn                 4     12
0086001907310251 D   mcsex                13     20
0087001907310251 D   mcdob                21     30
0088001907310251 D   mcfnam               31     55
0089001907310251 D   mclnam               56     90
0090001907310251 D   mcadr1               91    120
0091001907310251 D   mcadr2              121    150
0092001907310251 D   mccity              151    180
0093001907310251 D   mcst                181    182
0094001907310251 D   mczip               183    187
0095001907310251 D   mczip4              188    191
0096001907310251 D   mcphon              192    201
0097001907310251 D   mceml               202    266
0098001907310251 D   mcplan              267    270
0099001907310251 D   mcpltp              271    300
0100001907310251 D   mcpsts              301    310
0101001907310251 D   mcpefd              311    320
0102001907310251 D   mcpisd              321    330
0103001907310251 D   mcptmd              331    340
0104001907310251 D   mcpefn              341    348  0
0105001907310251 D   mcptmn              349    356  0
0106000910140029  *
0107000809040250 D                 DS
010800080904     D  ISOToday       S               d     inz
010900080904     D  Today          S              8p 0   inz
011000191001     D  Todaa          S              8
0111000809040251 D  cutoff         S               D   DATFMT(*ISO)
0112000809040251 D  cutofn         S              8S 0
0113001310070037 D sysdateymd      S               d   datfmt(*iso)
0114001910010251 D  reccnt         S              8S 0 INZ(0)
0115001910010251 D  reccna         S              8
0116000809040029  *
0117000809040250 D                 DS
011800080904     D  gbdate                 1      8  0
011900080904     D   gbyr                  1      4  0
012000080904     D   gbmo                  5      6  0
012100080904     D   gbdy                  7      8  0
0122000809040029  *
0123000809040250 D                 DS
012400070718     D  wkday          S               D     inz
012500110419      *
0126001104190053 D                 DS
0127001104190054 D  dbc1           C                   'Std Card Std Mail to Cardhlder'
0128001104190111  *
012900110419      *
013000190731     C***  cardky        klist
013100190731     C*                  kfld                    fcmid#
013200190731     C***                kfld                    fcseq#
013300110419      *
013400080904      *
013500080904     C                   move      udate         ISOtoday
013600080904     C                   move      ISOtoday      today
013700191001     C                   move      today         todaa
013800080904      *
0139000809040291  * Main Line - Loop thru current and hold file - comparing the 2
0140001907310297 C     *LOVAL        setll     metldthp
0141001907310297 C     *LOVAL        setll     metldhdp
0142000303310296 C                   dou       *in21 = '1'
014300020403      *
0144000807210296 C                   if        getcur = *blank
0145001907310297 C                   read      metldthp                               21
014600190731      *
0147000807210296 C                   If        *in21 = '1'
0148000807210296 C                   movel     'E'           getcur
014900190731      *
0150001907310296 C                   If        gethld = 'E'
0151000807210296 C                   leave
0152000807210296 C                   endif
015300190731      *
0154001907310296 C                   else
015500190731      *
0156001907310296 C                   movel     mdssn         curkey
0157001907310296 C                   move      mdpltp        curkey
0158000807210296 C                   endif
015900190731      *
0160000807210296 C                   else
016100190731      *
0162000807210296 C                   If        getcur <> 'E'
0163000204050296 C                   movel     *blank        getcur
0164000204050296 C                   endif
0165000303310296 C                   endif
0166000508240291  *
0167000204050296 C                   if        gethld = *blank
0168000807310296  *
0169000807310296 C                   dou       *in22 = '1'
0170001907310297 C                   read      metldhdp                               22
0171000909180296  *
0172001907310296 C                   If        *in22 = '0'
0173000807310296 C                   leave
0174000807310296 C                   endif
0175000807310296 C                   enddo
0176000807310296  *
0177000204050296 C                   If        *in22 = '1'
0178000204050296 C                   movel     'E'           gethld
0179000408020296 C                   If        getcur = 'E'
0180000408020296 C                   leave
0181000505250296 C                   else
0182001907310296 C                   exsr      putchg
0183000809020296 C                   iter
0184000809020296 C                   endif
0185001907310296 C                   else
0186001907310296 C                   movel     mhssn         hldkey
0187001907310296 C                   move      mhpltp        hldkey
0188000809020296 C                   endif
0189000204050296 C                   else
0190000303310296 C                   If        gethld <> 'E'
0191000204050296 C                   movel     *blank        gethld
0192000204050296 C                   endif
0193000807210296 C                   endif
019400091014      *
0195000910140296 C                   if        curkey < hldkey
0196001907310297 C                   exsr      putchg
0197000910140296 C                   movel     'N'           gethld
0198000910140296 C                   iter
0199000910140296 C                   endif
020000020405      *
0201000408020296 C                   if        curkey > hldkey and
0202000408020296 C                             gethld <> 'E'
0203001907310297 C****               exsr      putx
0204000204050296 C                   movel     'N'           getcur
0205000204050296 C                   iter
0206000204050296 C                   endif
020700020405      *
0208001908010296 C                   if        curmet <> hldmet
0209001908010297 C                   exsr      putchg
0210001908010296 C                   iter
0211001908010296 C                   endif
021200190801      *
0213001908010296 C                   enddo
021400191001      *
0215001910010297 C                   exsr      bldctl
021600190801      *
0217001908010296 C                   movel     '1'           *inlr
0218001908010296 C                   return
0219000204020107  **************************************************************************
0220001908010107  *
0221001907310107  *     PUTCHG - Write the New or changed rec to the change file
0222001908010107  *
0223000204020107  **************************************************************************
022400190801     C     putchg        begsr
0225001908010107  *                                                                     ****
022600190801     C                   eval      chgmet = curmet
022700191001     C                   eval      reccnt = reccnt + 1
022800190801      *
022900190801     C                   write     metlchgr
023000190801      *
023100190801     C                   endsr
0232001910010107  **************************************************************************
0233001910010107  *
0234001910010107  *     BLDCTL - Build Control File
0235001910010107  *
0236001910010107  **************************************************************************
023700191001     C     bldctl        begsr
0238001910010107  *                                                                     ****
023900191001     C                   eval      reccna = %EDITC(reccnt:'4')
0240001910010107  *                                                                     ****
024100191001     C                   eval      metlcta = *blanks
024200191001     C                   eval      metlcta =
024300191001     C                                     'DATA_FILE_NAME|' +
024400191001     C                                     'RECORD_COUNT_IN_DATE_FILE|' +
024500191001     C                                     'TRUST_INDICATOR|' +
024600191001     C                                     'PROCESS_INDICATOR'
024700191001      *
024800191001     C                   write     metldctlr
0249001910010107  *                                                                     ****
025000191001     C                   eval      metlcta = *blanks
025100191001     C                   eval      metlcta =
025200191001     C                                     'FILEDROP_GBS_' +
025300191001     C                                     todaa +
025400191022     C                                     '050101_000001|' +
025500191001     C                                     %trim(reccna) + '|' +
025600191001     C                                     'ML|POLICY_ADD_UPDATE'
025700191001      *
025800191001     C                   write     metldctlr
025900191001      *
026000191001     C                   endsr
