000100160513      *===========================================================================
000200160512     H option(*noDebugIo)
000300160513      *===========================================================================
000400181019      * NASaa010R - Nasco - Generate extract - (Antwerpen Automotive)
000500180313      *================================================================================
000600180313      * Date        Int   Description
000700180313      * ----------  ---   -------------------------------------------------------------
000800180823      * 08/23/2018  jt    Original creation
000900160513      *===========================================================================
001000160512
001100181019     fnasaaheadro    e             disk    rename(headfr:fileHead)
001200180824
001300181019     fnasaaaheado    e             disk    rename(headar:acctHead)
001400180824
001500181019     fnasaadtl  if   e           k disk    rename(detailr:nascoFile)
001600180824
001700181019     fnasaaatralo    e             disk    rename(atrailr:acctTrail)
001800180824
001900181019     fnasaatrailo    e             disk    rename(trailr:fileTrail)
002000180824
002100160512      *=================================================================
002200061017
002300180824     d datetime        s             14
002400160519     d today           s              8  0
002500180824     d time            s              6  0
002600180824     d totalrecords    s             10  0
002700180824     d totalrecords2   s              8  0
002800180824
002900181019     d nasaa009r       pi
003000180824     d  action                       11    const
003100180824
003200160511      //==================================================================
003300160511      // mainline
003400160511      //===================================================================
003500150820
003600160511       exsr init;
003700160511       exsr main;
003800160511       exsr exit;
003900160511
004000160511      //===================================================================
004100160511      // main
004200160511      //===================================================================
004300160511
004400160511       begsr main;
004500160511
004600180824        select;
004700180824         when action = 'FILEHEADER';
004800180824          exsr fileHeader;
004900180824
005000180824         when action = 'ACCTHEADER';
005100180824          exsr acctHeader;
005200180824
005300180824         when action = 'ACCTTRAILER';
005400180824          exsr acctTrailer;
005500180824
005600180824         when action = 'FILETRAILER';
005700180824          exsr fileTrailer;
005800180824        endsl;
005900180824
006000160511       endsr;
006100160511
006200180309      //===================================================================
006300180824      // file header
006400180309      //===================================================================
006500180309
006600180824       begsr fileHeader;
006700180309
006800180824        hrtype = '01';
006900180824        hreleasev = '001';
007000180824        hfcreate = datetime;
007100181205        htaxid = '0520965101';
007200180824        huniqueid =  ' ';
007300180828        hsrole =  'G';
007400180824        hfiller = ' ';
007500180824        hhold = 'X';
007600180824
007700180824        write fileHead;
007800180309
007900180309       endsr;
008000180309
008100180824      //===================================================================
008200180824      // account header
008300180824      //===================================================================
008400180824
008500180824       begsr acctHeader;
008600180824
008700180824        ahrtype = '10';
008800181205        ahftype = 'PF';
008900181128        ahgrpname = 'ANTWERPEN AUTOMOTIVE';
009000181128        ahgrptaxid = '999999999';
009100181128        ahcontact = ' ';
009200180824        ahcntcphn# = ' ';
009300180824        ahdatesbm = %editc(%dec(%char(%date(today:*iso):*usa0):8:0):'X');
009400180824        ahmbrtrmdt = ' ';
009500180824        ahsales# = ' ';
009600180824        ahpcpind = ' ';
009700180824        ahrsubmitt = ' ';
009800180824        ahrsubmdt = ' ';
009900180824        ahrnwind = 'N';
010000180824        ahgrptype = ' ';
010100180824        ahfiller = ' ';
010200180824        ahhold = 'X';
010300180824
010400180824        write acctHead;
010500180824
010600180824       endsr;
010700180824
010800180824      //===================================================================
010900180824      // account trailer
011000180824      //===================================================================
011100180824
011200180824       begsr acctTrailer;
011300180824
011400180824        setll *loval nascoFile;
011500180824        read nascoFile;
011600180824
011700180824        dow not %eof;
011800180824
011900180824         totalRecords = totalrecords + 1;
012000180824
012100180824        read nascoFile;
012200180824        enddo;
012300180824
012400180824        artype = '30';
012500181205        aftype = 'PF';
012600180824        atotaldr = %editc(totalrecords:'X');
012700180824        afiller = ' ';
012800180824        ahold = 'X';
012900180824
013000180824        write acctTrail;
013100180824
013200180824       endsr;
013300180824
013400180824      //===================================================================
013500180824      // file trailer
013600180824      //===================================================================
013700180824
013800180824       begsr fileTrailer;
013900180824
014000180824        setll *loval nascoFile;
014100180824        read nascoFile;
014200180824
014300180824        dow not %eof;
014400180824
014500180824         totalRecords2 = totalrecords2 + 1;
014600180824
014700180824        read nascoFile;
014800180824        enddo;
014900180824
015000180824        trtype = '02';
015100180824        ttotalag = '000004';
015200180824        ttotalrc = %editc(totalrecords2:'X');
015300180824        tfiller = ' ';
015400180824        thold = 'X';
015500180824
015600180824        write fileTrail;
015700180824
015800180824       endsr;
015900180824
016000160511      //===================================================================
016100160511      // exit
016200160511      //===================================================================
016300160511
016400160511       begsr exit;
016500160511
016600160511        *inlr = '1';
016700160511        return;
016800160511
016900160511       endsr;
017000160511
017100160511      //===================================================================
017200160511      // init
017300160511      //===================================================================
017400160520
017500160511       begsr init;
017600180309
017700180824        time = %dec(%time);
017800160519        today = %dec(%char(%date:*iso0):8:0);
017900180824        datetime = %editc(%dec(%char(%date(today:*iso):*usa0):8:0):'X') +
018000180824                   %editc(time:'X');
018100160511       endsr;
018200010412
018300160511       //==============================================================
