000100110819     H*DFTNAME(NEWYOR)
0002009102150002 F******************************************************************
0003009102150012 F*                                                                *
0004009809140014 F*                                                                *
0005009809140010 F*  Y2K CONVERT - 1998                                            *
0006009809140015 F*                                                                *
0007001108190011 F******************************************************************
0008001108220014 F* 08.22.2011 SSK EXTERNALIZE DDS
0009001108220014 F*                CHANGE FROM IPE OF MCOV TO MCOVC15 TO READ ONLY
0010001108220014 F*                  ACTIVE RECORDS AND REMOVE S36PRC SORT
0011001108220014 F*
0012001108190011 F******************************************************************
001300110822     FMCOVC15   IF   E           K DISK
001400110822     FMEMBER    IF   E           K DISK
001500110822     FPLNUNIQUE IF   E           K DISK
001600110822     FTRMUNIQUE IF   E           K DISK
001700110822     FREPORT    O    F  132        PRINTER OFLIND(*INOF)
001800110822   X***X
001900110822     D H#TRST          S                   LIKE(MCTRST)
002000110822     D TRS_BRK         S               N
002100110822     D YES             S               N   INZ(*ON)
002200110822     D NO              S               N   INZ(*OFF)
002300110822   X***X
002400110822      *
002500110822     C                   DOU       %EOF(MCOVC15)
002600110822     C                   READ      MCOVR
002700110822     C                   IF        NOT %EOF(MCOVC15)
002800110822      *
002900110822     C                   IF        MCTRST <> H#TRST
003000110822     C                   MOVE      MCTRST        H#TRST
003100110822     C                   EVAL      TRS_BRK = YES
003200110822     C                   ELSE
003300110822     C                   EVAL      TRS_BRK = NO
003400110822     C                   ENDIF
003500110822      *
003600110822     C                   EXSR      $MAIN
003700110822      *
003800110822     C                   IF        TRS_BRK = YES
003900110822     C     COUNT         IFNE      0
004000110822     C                   EXCEPT    TOTAL
004100110822     C                   END
004200110822     C                   Z-ADD     0             COUNT
004300110822     C                   Z-ADD     0             IN
004400110822     C                   Z-ADD     0             FM
004500110822     C                   ENDIF
004600110822      *
004700110822     C                   ENDIF
004800110822     C                   ENDDO
004900110822      *
005000110822     C                   EVAL      *INLR = *ON
005100110822      *
005200110822   S***S
005300110822     C     *INZSR        BEGSR
005400110822      *
005500110822     C     PLNKEY        KLIST
005600110822     C                   KFLD                    MCTRST
005700110822     C                   KFLD                    MCSUB#
005800110822     C                   KFLD                    MCPLAN
005900110822      *
006000110822     C                   ENDSR
006100110822   S***S
006200110822     C     $MAIN         BEGSR
006300110822      *
006400961223     C   99              SETOFF                                       99
006500110822      *
006600110822     C     MDSEQ#        IFNE      0
006700110822     C                   LEAVESR
006800961223     C                   END
006900110822      *
007000110822     C     PLNKEY        CHAIN     PLNMSR                             91
007100961223     C  N91PLNCAT        IFNE      'PMM'
007200110822     C                   LEAVESR
007300961223     C                   END
007400110822      *
007500110822     C     MCSSNO        CHAIN     MEMBR                              98
007600110822     C   98              LEAVESR
007700110822      *
007800961223     C     STATE         IFNE      'NY'
007900110822     C                   LEAVESR
008000961223     C                   END
008100110822      *
008200970102     C                   MOVE      '  '          COVOUT            2
008300110822      *
008400110822     C                   SELECT
008500110822      * *
008600110822     C                   WHEN      MCOVTP = 'TIN'
008700961223     C                   ADD       1             IN                4 0
008800970102     C                   MOVE      'IN'          COVOUT
008900110822      * *
009000110822     C                   WHEN      MCOVTP = 'TMI'
009100970102     C                   MOVE      'MI'          COVOUT            2
009200961223     C                   ADD       1             IN
009300110822      * *
009400110822     C                   OTHER
009500110822     C                   ADD       1             FM                4 0
009600110822     C                   MOVE      'FM'          COVOUT            2
009700110822      * *
009800110822     C                   ENDSL
009900110822      *
010000961223     C                   ADD       1             COUNT             4 0
010100961223     C     FLG           IFNE      1
010200961223     C                   SETON                                        99
010300961223     C                   Z-ADD     1             FLG               1 0
010400970102     C                   EXCEPT    HEAD
010500110822     C     MCTRST        CHAIN     TRSMSR                             97
010600961223     C                   EXCEPT    TST
010700110822     C                   ENDIF
010800110822      *
010900110822     C   OFMCTRST        CHAIN     TRSMSR                             97
011000970102     C   OF              EXCEPT    HEAD
011100970102     C   OF              EXCEPT    TST
011200110822      *
011300110822     C                   IF        TRS_BRK = YES AND *INOF = YES
011400110822     C     MCTRST        CHAIN     TRSMSR                             97
011500110822     C                   EXCEPT    HEAD
011600110822     C                   EXCEPT    TST
011700110822     C                   ENDIF
011800110822      *
011900961223     C                   EXCEPT    DETAIL
012000110822      *
012100110822     C                   ENDSR
012200110822   S***S
012300110822   S***S
012400110822   S***S
012500110822   S***S
0126009102150132 O******************************************************
0127009102150133 O*  OUTPUT SPECIFICATIONS                             *
0128009102150134 O******************************************************
0129009102150135 O*
0130009701020136 OREPORT    E            HEAD           2 03
0131009102150138 O                                           45 '*****'
0132009612230139 O                                           65 'NEW YORK MEMBERS'
0133009102150140 O                                           91 '*****'
0134009701020151 O          E            HEAD           1
0135009701020153 O                                           24 'PROGRAM NAME: NEWYORK   '
0136009102150154 O                                          125 'PAGE:'
0137009102150155 O                       PAGE          Z    131
0138009701020156 O          E            HEAD           1
0139009102150158 O                                           14 'RUN DATE:'
0140009102150159 O                       UDATE         Y     25
0141009701020162 O          E            HEAD           1
0142009102150164 O                                           24 '""""""""""""""""""""""""'
0143009102150165 O                                           48 '""""""""""""""""""""""""'
0144009102150166 O                                           72 '""""""""""""""""""""""""'
0145009102150167 O                                           96 '""""""""""""""""""""""""'
0146009102150168 O                                          120 '""""""""""""""""""""""""'
0147009102150169 O                                          132 '""""""""""""'
0148009701020170 O          E            HEAD           1
0149009102150172 O                                           10 'MEMBER'
0150009102150173 O                                           30 'MEMBER'
0151009701020174 O                                           62 'MEMBER'
0152009701020175 O          E            HEAD           1
0153009102150177 O                                           12 'SOC.SEC.#'
0154009102150178 O                                           29 'NAME'
0155009701020179 O                                           56 'COV.'
0156009701020180 O                                           60 'SEX'
0157009701020181 O                                           81 'CITY'
0158009701020182 O                                           95 'ST'
0159009612230183 O                                          104 'ZIP'
0160009701020185 O          E    99      HEAD           1
0161009102150187 O                                           24 '""""""""""""""""""""""""'
0162009102150188 O                                           48 '""""""""""""""""""""""""'
0163009102150189 O                                           72 '""""""""""""""""""""""""'
0164009102150190 O                                           96 '""""""""""""""""""""""""'
0165009102150191 O                                          120 '""""""""""""""""""""""""'
0166009102150192 O                                          132 '""""""""""""'
0167009612230193 O          E            TST         1  2
0168009102150195 O                                            7 'TRUST -'
0169009102150196 O                       TNAME               28
0170009612230197 O          E            DETAIL         1
0171001108190198 O                       MBSSNO              12 '   -  -    '
0172001108190199 O                       MLNAME              38
0173001108190199 O                       MFNAME              52
017400970102     O                       COVOUT              55
0175009612230201 O                       SEX                 60
0176009612230202 O                       CITY                80
0177009612230203 O                       STATE               95
0178009612230203 O                       ZIP                100 '     -    '
0179009612230206 O          E            TOTAL       2  1
0180009612230207 O                                           30 'TOTAL MEMBERS IN TRUST:'
0181009612230208 O                       COUNT         ZB    38
0182009612230207 O                                           50 'INDIVIDUAL:'
0183009612230208 O                       IN            ZB    58
0184009612230207 O                                           70 'FAMILY:'
0185009612230208 O                       FM            ZB    78
