000100001107     H Indent ('| ')
000200990630      *? ***************************************************************
000300070131      *             GROUP BENIFIT SERVICES SOFTWARE           2007     *
000400010322      *                                                                *
000500000118      *  Written by:    S. Zien                                        *
000600070116      *  Date Written:   1/16/07                                       *
000700070131      *  Description:   Nonemp active members with no active PSP/PVA.  *
000800000118      *                                                                *
000900000118      *                                                                *
001000000118      *                R E V I S I O N    H I S T O R Y                *
001100000118      *  Date                                                          *
001200000118      *  Revised   Initials    Revision                                *
001300000118      *  --------  --------    --------------------------------------  *
001400070131      *   1/31/07    szz       Initial version.                        *
001500001211      *                                                                *
001600001106      *                                                                *
001700990630      *? ***************************************************************
001800010322
001801070131     FMEMBER    IF   E           K Disk
001802070131     FMCOV      IF   E           K Disk
001803070131     FPLNMST    IF   E           K Disk
002003070131     FNONEMCSV  O  A E             Disk
002500991230    ? * Program status data structure
002600991230    ?D PGMD          ESDS                  EXTNAME(IOPGMD)
003137050509      *
003141070116     D #ISO            S               D   Datfmt(*ISO)
003142070201     D CatFlag         S              1    Inz(*Blanks)
003143070201     D Yes             S              1    Inz('Y')
003144070201     D No              S              1    Inz('N')
003145070201     D VolLifSps       S              3    Inz('PSP')
003146070201     D VolLifDep       S              3    Inz('PVA')
005800991229
006104070131     C                   Read      MEMBER
006105070131     C                   Dow       Not %Eof(MEMBER)
006106070131     C                   If        TERMDT  =   *Zero       And
006107070201     C                             NONEMP  =   Yes
006111050505     C                   Exsr      Process
006112070116     C                   End
006113070131     C                   Read      MEMBER
006117050505     C                   Enddo
006118050505
009200050505     C                   Eval      *InLR = *On
009202050506      * ? _____________________________________________________________
010501070116      *? *                                                             *
010503070116     C     Process       BegSR
010504070116      *? *_____________________________________________________________*
010505070201     C                   Eval      CatFlag =  No
010506070131     C     MBSSNO        Setll     MCOV
010507070131     C     MBSSNO        Reade     MCOV
010508070131     C                   Dow       Not %Eof(MCOV)
010509070201     C                   If        CANDT   =  *Zero
010510070131     C     PKey          Chain     PLNMST
010511070131     C                   If        %Found(PLNMST)
010512070201     C                   If        PLNCAT  =  VolLifSps   Or
010513070201     C                             PLNCAT  =  VolLifDep
010514070201     C                   Eval      CatFlag =  Yes
010515070201     C                   Leave
010516070201     C                   End
010517070131     C                   End
010518070131     C                   End
010519070131     C                   Reade     MCOV
010520070131     C                   Enddo
010521070201     C                   If        CatFlag =  No
010522070201     C                   Exsr      WriteSpread
010523070201     C                   End
010524070131      *
010525070131     C                   EndSr
010526070131      * ? _____________________________________________________________
010527070131      *? *                                                             *
010528070131     C     WriteSpread   BegSr
010529070131      *? *_____________________________________________________________*
024859050509     C                   Eval      WKRECORD  =   '"' +
024870070131     C                              %Trim(%Editc(MBSSNO:'P'))   + '","' +
024871070201     C                                                  MLNAME  + '","' +
024872070201     C                                                  MFNAME  + '","' +
024873070201     C                                                     MMI  + '","' +
024874070201     C                                                  NONEMP  + '","' +
024875070201     C                              %Trim(%Editc(MBTRST:'P'))   + '","' +
024876070201     C                              %Trim(%Editc(MBSUB#:'P'))   + '","' +
024881070201     C                              %Trim(%Editc(MBACCT:'P'))   + '",'
024882070131     C                   Write     NONEMCSR
024884050509     C*
024885070116     C                   EndSr
024947050509      * ? _____________________________________________________________
024948050509      *? *                                                             *
024951070116     C     WriteSpTitle  BegSr
024952070116      *? *_____________________________________________________________*
024953050509     C*
024954070131     C                   Eval      WKRECORD  =   '"' +  'Member#'  + '","' +
024955070201     C                                                'Last Name'  + '","' +
024956070201     C                                               'First Name'  + '","' +
024957070201     C                                                     'M.I.'  + '","' +
024958070201     C                                                  'NonEmp?'  + '","' +
024959070201     C                                                    'Trust'  + '","' +
024960070201     C                                                     'Sub#'  + '","' +
024969070201     C                                                     'Acct'  + '",'
024970070131     C                   Write     NONEMCSR
024971050509     C*
0249720701160320 C                   EndSr
024973070116      * ? _____________________________________________________________
024974070116     C     KLIST         BegSr
024976070116      *? *_____________________________________________________________*
024983070131    ?C     PKey          Klist                                                  ACKCTL
024984070131    ?C                   Kfld                    MBTRST
024985070131    ?C                   Kfld                    MBSUB#
024986070131    ?C                   Kfld                    MCPLAN                         POSITION TO 1
024987070131      *
0249880701160320 C                   EndSr
029701070116      * ? _____________________________________________________________
030000070116     C     *INZSR        BegSr
030001070116      *? *_____________________________________________________________*
030105050616      *
030106050505     C     *DATE         Mult      10000.0001    Today             8 0
031119070116
031123050509     C                   Exsr      WriteSpTitle
032000991229
032800991020     C                   ENDSR
