000100141016   X***X CARRIER CONTROL ID #0000000115 NVA EXPORT
000200110824   X***X
000300110824   X***X
000400110824   X***X ACCOUNTS SET-UP
000500141015   X***X TTT-SSS-AAAA  ALL ACCOUNTS
000600110824   X***X
000700110824   X***X
000800110824   X***X
000900110824   X***X
001000110824   X***X
001100110824     FCARXPTP   IF   E           K DISK
001200110824     FCARACCP   IF   E           K DISK
001300110824     FCARPLNP   IF   E           K DISK
001400110824   X***X
001500141016     FNVA030WF  O  A E           K DISK
001600141016     ** EXPORT FILE
001700141016     FNVA031WF  IF A E           K DISK
001800110824     ** TERM TRACKER
001900110824     **
002000110824     FMEMAC#1   IF   E           K DISK
002100110824     FMCOVMPLN  IF   E           K DISK
002200110824     FDEPNDC    IF   E           K DISK
002300141016     FDCOVA     IF   E           K DISK
002400110824   X***X
002500141016     D CARR#CTL        S             10A   INZ('0000000115')
002600110824   X***X
002700110824     D DS@CARPLN     E DS                  EXTNAME(CARPLNP)
002800110824     D DS@CARACC     E DS                  EXTNAME(CARACCP)
002900110824     D DS@CARXPT     E DS                  EXTNAME(CARXPTP)
003000141017     D DS@MEMBER     E DS                  EXTNAME(MEMBER)
003100110824   X***X
003200110824     ** WORK ARRAY FOR PLANS
003300110824     **
003400110824     ** PC# - PLAN COUNT
003500110824     ** PP# - PLAN POINTER
003600110824     **
003700110824     D CARPLN@       E DS                  EXTNAME(CARPLNP)
003800110824     D                                     OCCURS(60) PREFIX(X:1)
003900110824     D PC#             S              3S 0
004000110824     D PP#             S              3S 0
004100110824     D @PLANIN         S              4A
004200111115     D #EFFDTE         S              8S 0
004300110824     D @CCTRIN         S              3A
004400111006     D @ENRIN          S              3A
004500111006     D @ENROU          S              3A
004600141027     D @GROUP          S                   LIKE(CPCID1)
004700110824   X***X
004800111006     D C11@10          S             10A
004900111006     D C11@01          S              1A
005000110824     **
005100110824     ** WRITE TYPE = MEMBER OR DEPEND
005200110824     D WRT@TYPE        S              6A
005300110824     **
005400120711   X***X
005500141017     D PERSCNT         S              3S 0
005600130118     D #TODAY          S              8S 0
005700111006     D #DATE           S              8S 0
005800111006     D #10             S             10S 0
005900111006     D #11             S             11S 0
006000111116     D #7S0            S              7S 0 INZ
006100111116     D #11S0           S             11S 0 INZ
006200111006     D #12             S             12S 0
006300110824     D #XST            S              6S 0
006400110824     D #IST            S               T
006500110824     D #ISO            S               D   DATFMT(*ISO)
006600110824     D #MINUEND        S               D   DATFMT(*ISO)
006700110824     D #SUBTRAEND      S               D   DATFMT(*ISO)
006800110824     D #DIFFRNC        S              5S 0
006900110824     D #2S0            S              2S 0
007000110824     D #CANCEL         S              8S 0
007100130118     D #SAL            S             11S 0
007200130118     D PLN@CAT         S             10A
007300130118     D @XSX            S              8A
007400130118     D @9              S              9A
007500110824     D #XSX            S              8S 0
007600110824     D #XSX2           S              8S 0
007700110824     D DATE@OUT        S             10A
007800111006     D DNTLATE         S              1A
007900121128   X***X
008000111006     D TERM_VIS        S               N
008100110824     D YES             S               N   INZ(*ON)
008200110824     D NO              S               N   INZ(*OFF)
008300121128   X***X
008400110824     D KF@TRS          S                   LIKE(MCTRST)
008500110824     D KF@SUB          S                   LIKE(MCSUB#)
008600110824     D KF@ACC          S                   LIKE(ACC#)
008700110824     D KF@ENR          S              3A   INZ
008800110824     D KF@CARG         S              2A   INZ
008900110824     D KF@CCTR         S                   LIKE(CCFLG)
009000110824     D KF@PLN          S                   LIKE(MCPLAN)
009100141017     D KF@TRM          S              8S 0
009200110824     D KF@SSN          S                   LIKE(MBSSNO)
009300110824     D KF@SEQ          S                   LIKE(DPSEQ#)
009400110824     D KF@MPLN         S              4A
009500141028     D #8D0            S              8S 0
009600110824     D #8D1            S              8S 0 INZ
009700110824    ***
009800110824     D #RECCNT         S             10S 0 INZ
009900110824    ***
010000110824    *** VISION         ARRAYS
010100110824    *** CAT: PVS, PVR
010200110824     D VIS#CNE         S              3S 0 INZ
010300110824     D VIS#NDX         S              3S 0 INZ
010400110824     D VIS@PLN         S              4A   DIM(20)
010500110824     D VIS@ENR         S              3A   DIM(20)
010600110824     D VIS@FRM         S              8S 0 DIM(20)
010700110824     D VIS@TRM         S              8S 0 DIM(20)
010800141024     D VIS@GRP         S             20A   DIM(20)
010900110824    ***
011000141016     D                 DS
011100141016     D ADDREZZ               001    220A
011200141016     D A2SEG                 001    002A
011300141016     D A2PCI                 003    012A
011400141016     D A2GRP                 013    027A
011500141016     D A2SSN                 028    045A
011600141016     D A200                  046    047A                                         00
011700141016     D A2DTE                 048    055A
011800141016     D A2HMS                 056    061A                                         080000
011900141016     D A2ADDR1               062    091A
012000141016     D***FILLER              092    096A
012100141016     D A2ADDR2               097    126A
012200141016     D***FILLER              127    166A
012300141016     D A2CITY                167    186A
012400141016     D***FILLER              187    191A
012500141016     D A2STATE               192    193A
012600141016     D A2ZIP                 194    203A                                         ZIP-0000
012700141016     D A2PHONE               204    213A                                         AREA/CODE
012800141016     D***FILLER              214    220A
012900110824    ***
013000141016     D                 DS
013100141016     D DEMOGRFX              001    220A
013200141016     D D1SEG                 001    002A
013300141016     D D1PCI                 003    012A
013400141016     D D1GRP                 013    027A
013500141016     D D1SSN                 028    045A
013600141016     D D100                  046    047A                                         00
013700141016     D D1DTE                 048    055A
013800141016     D D1HMS                 056    061A                                         080000
013900141016     D***FILLER              062    062A
014000141016     D D1PERCOD              063    065A
014100141016     D D1RELCOD              066    066A
014200141016     D D1LNAME               067    091A
014300141016     D D1FNAME               092    106A
014400141016     D D1MMI                 107    107A
014500141016     D D1SUFX                108    113A
014600141016     D D1DOB                 114    121A
014700141016     D D1GENDR               122    122A
014800141016     D D1DEPSS               123    131A
014900141016     D D1N1                  132    132A
015000141016     D D1ENRD                133    140A
015100141016     D D1CAND                141    148A
015200141028     D D1COB                 149    149A
015300141016     D****FILLER             150    150A
015400141016     D****FILLER             151    220A
015500141016    ***
015600141016     D                 DS
015700141016     D COVERAGE              001    220A
015800141016     D C3SEG                 001    002A
015900141016     D C3PCI                 003    012A
016000141016     D C3GRP                 013    027A
016100141016     D C3SSN                 028    045A
016200141016     D C300                  046    047A                                         00
016300141016     D C3DTE                 048    055A
016400141016     D C3HMS                 056    061A                                         080000
016500141016     D***FILLER              062    062A
016600141016     D C3ENRDT               063    070A
016700141016     D C3CANDT               071    078A
016800141016     D***FILLER              079    086A
016900141016     D***FILLER              087    087A
017000141016     D C3Z                   088    095A                                         00000000
017100141016     D***FILLER              096    110A
017200141016     D C3HIRE                111    118A
017300141016     D C3TERM                119    126A
017400141016     D C3COVTP               127    127A
017500141016     D***FILLER              128    220A
017600141016    ***
017700110824    ***
017800141016     D #MAXTERM        S              8S 0
017900141016     D P               S              3S 0
018000110824     D @STEP           S              5A
018100141016     D @DATE           S              8A
018200110824   X***X
018300141017       @STEP = 'PREP0';
018400110824    ***
018500110824     C                   DOU       @STEP = 'LEAVE'
018600111007     C     @STEP         CASEQ     'PREP0'       $PREP0
018700111007     C     @STEP         CASEQ     'STEP0'       $STEP0
018800111007     C     @STEP         CASEQ     'PREP1'       $PREP1
018900111007     C     @STEP         CASEQ     'STEP1'       $STEP1
019000111007     C     @STEP         CASEQ     'STEP2'       $STEP2
019100111007     C     @STEP         CASEQ     'STEP3'       $STEP3
019200111007     C     @STEP         CASEQ     'PREP4'       $PREP4
019300111007     C     @STEP         CASEQ     'STEP4'       $STEP4
019400111007     C     @STEP         CASEQ     'PREP5'       $PREP5
019500111007     C     @STEP         CASEQ     'STEP5'       $STEP5
019600111007     C     @STEP         CASEQ     'STEP6'       $STEP6
019700111007     C     @STEP         CASEQ     'PREP7'       $PREP7
019800111007     C     @STEP         CASEQ     'STEP7'       $STEP7
019900110824     C                   ENDCS
020000110824     C                   ENDDO
020100111006    ***
020200141017       *INLR = *ON;
020300141017    ***
020400110824   S***S
020500141017    ***
020600110824     C     $PREP0        BEGSR
020700110824    ***
020800141017       CHAIN CARR#CTL CARXPTR;
020900110824    ***
021000141017       SETLL CARR#CTL CARACCR;
021100110824    ***
021200141017       #ISO = %DATE;
021300130118     C                   MOVE      #ISO          #TODAY
021400141016     C                   MOVE      #TODAY        @DATE
021500141016    ***
021600141016     C                   ADDDUR    30:*D         #ISO
021700141016     C                   MOVE      #ISO          #MAXTERM
021800110824    ***
021900141017       @STEP = 'STEP0';
022000110824    ***
022100110824     C                   ENDSR
022200110824   S***S
022300110824     C     $STEP0        BEGSR
022400110824    ***
022500110824     C     CARR#CTL      READE     CARACCR
022600110824    ***
022700141017       IF %EOF(CARACCP);
022800141017          @STEP = 'LEAVE';
022900141017          LEAVESR;
023000141017       ENDIF;
023100110824    ***
023200110825    *** CAN THE ACCOUNT BE EXPORTED?
023300110824    ***
023400141017       IF CASTATUS = 'N';
023500141017          LEAVESR;
023600141017       ENDIF;
023700111025    ***
023800141017       @STEP = 'PREP1';
023900110824    ***
024000110824     C                   ENDSR
024100110824   S***S
024200110824     C     $PREP1        BEGSR
024300110824    ***
024400141017       KF@TRS = CATRST;
024500141017       KF@SUB = CASUB#;
024600141017       KF@ACC = CAACCT;
024700110824    ***
024800141017       EXSR $PLANLOAD;
024900110824    ***
025000141017       @STEP = 'STEP1';
025100110824    ***
025200110824     C                   ENDSR
025300110824   S***S
025400110824     C     $STEP1        BEGSR
025500110824    ***
025600141017       KF@PLN = *BLANKS;
025700141017       KF@TRM = 0;
025800141017       KF@SSN = 0;
025900141017       KF@SEQ = 0;
026000110824    ***
026100141017       SETLL KL#TSA MEMBR;
026200110824    ***
026300141017       @STEP = 'STEP2';
026400110824    ***
026500110824     C                   ENDSR
026600110824   S***S
026700110824     C     $STEP2        BEGSR
026800110824    ***
026900141017       READE KL#TSA MEMBR;
027000110824    ***
027100141017       IF %EOF(MEMAC#1);
027200141017          @STEP = 'STEP0';
027300141017          LEAVESR;
027400141017       ENDIF;
027500110824    ***
027600141017       KF@SSN = MBSSNO;
027700141017       KF@SEQ = 00;
027800110824    ***
027900141017       SETLL KL#MPLN MCOVR;
028000110824    ***
028100141017       EXSR $CLRSTG;
028200110824    ***
028300141017       @STEP = 'STEP3';
028400110824    ***
028500110824     C                   ENDSR
028600110824   S***S
028700110824     C     $STEP3        BEGSR
028800110824    ***
028900141016       READE KL#MPLN MCOVR;
029000141016    ***
029100141016       IF %EOF(MCOVMPLN);
029200141016          @STEP = 'PREP4';
029300141016          LEAVESR;
029400141016       ENDIF;
029500110824    ***
029600141016       @PLANIN = MCPLAN;
029700141016       @ENRIN = MCOVTP;
029800141016       #EFFDTE = ENRLDT;
029900141016       #CANCEL = CANDT;
030000110824     **
030100141016       IF #CANCEL = 0;
030200141016          #CANCEL = 99999999;
030300141016       ENDIF;
030400141016    ***
030500141016       EXSR $QUIK;
030600110824     **
030700141016       EXSR $PLANSRCH;
030800110824    ***
030900141016       IF PLN@CAT <> 'VIS';
031000141016          LEAVESR;
031100141016       ENDIF;
031200110824    ***
031300141016       EXSR $AD2MARY;
031400110824    ***
031500110824     C                   ENDSR
031600141016    ***
031700110824   S***S
031800141016    ***
031900110824     C     $AD2MARY      BEGSR
032000141028    ***
032100141028       IF VIS#CNE = 0;
032200141028          EXSR $ADDENT;
032300141028          LEAVESR;
032400141028       ENDIF;
032500141028    ***
032600141028       IF VIS@TRM(VIS#CNE) = 99999999;
032700141028          LEAVESR;
032800141028       ENDIF;
032900110824    ***
033000141028       IF #EFFDTE = #CANCEL AND #CANCEL <= VIS@TRM(VIS#CNE);
033100141028          LEAVESR;
033200141028       ENDIF;
033300141028    ***
033400141028       VIS#NDX = 0;
033500141017    ***
033600141028       FOR VIS#NDX = 1 TO VIS#CNE;
033700141028    ***
033800141028     *****IF VIS@PLN(VIS#NDX) = @PLANIN AND VIS@ENR(VIS#NDX) = @ENROU AND
033900141028          IF   VIS@GRP(VIS#NDX) = CPCID1;
034000141028    ***
034100141028             #8D0 = VIS@TRM(VIS#NDX);
034200141028     C                   MOVE      #8D0          #ISO
034300141028     C                   ADDDUR    1:*D          #ISO
034400141028     C                   MOVE      #ISO          #8D1
034500141028    ***
034600141028             IF #EFFDTE = #8D0 OR #EFFDTE = #8D1;
034700141028    *           VIS@PLN(VIS#CNE) = @PLANIN;
034800141028    *           VIS@ENR(VIS#CNE) = @ENROU;
034900141028                VIS@TRM(VIS#NDX) = #CANCEL;
035000141028                LEAVESR;
035100141028             ENDIF;
035200141016    ***
035300141028          ENDIF;
035400141028    ***
035500141028       ENDFOR;
035600141028    ***
035700141028       EXSR $ADDENT;
035800141028    ***
035900141028     C                   ENDSR
036000141028    ***
036100141028   S***S
036200141028    ***
036300141028     C     $ADDENT       BEGSR
036400121128    ***
036500141028       VIS#CNE += 1;
036600141028    *  VIS@PLN(VIS#CNE) = @PLANIN;
036700141028    *  VIS@ENR(VIS#CNE) = @ENROU;
036800141028    *  VIS@FRM(VIS#CNE) = #EFFDTE;
036900141028    *  VIS@TRM(VIS#CNE) = #CANCEL;
037000141028    *  VIS@GRP(VIS#CNE) = CPCID1;
037100141028    ***
037200110824     C                   ENDSR
037300141017    ***
037400110824   S***S
037500141017    ***
037600110824     C     $QUIK         BEGSR
037700111006    ***
037800141016       @CCTRIN = *BLANKS;
037900141028    ***
038000141028       IF @ENRIN <> 'TIN' AND @ENRIN <> 'TFA';
038100141028          @ENROU = 'T99';
038200141028       ELSE;
038300141028          @ENROU = @ENRIN;
038400141028       ENDIF;
038500141016    ***
038600141016    *** 30 DAY TOLERANCE FOR TERM DATES
038700141016    ***  UNDER 30 WE SEND, FUTURE TERMS > 30 DAYS ARE RESET TO ZERO.
038800141016    ***
038900141016       IF #CANCEL > 0 AND #CANCEL < 99999999;
039000141016          IF #CANCEL > #MAXTERM;
039100141016             #CANCEL = 99999999;
039200141016          ENDIF;
039300141016       ENDIF;
039400110824    ***
039500110824     C                   ENDSR
039600141017    ***
039700110824   S***S
039800141017    ***
039900110824     C     $PREP4        BEGSR
040000110824    ***
040100141017       IF VIS#CNE = 0;
040200141017          @STEP = 'STEP2';
040300141017          LEAVESR;
040400141017       ENDIF;
040500110824    ***
040600141017       TERM_VIS = NO;
040700110824    ***
040800141017       EXSR $CHKHEM;
040900110824    ***
041000141017       @STEP = 'STEP4';
041100110824    ***
041200110824     C                   ENDSR
041300141017    ***
041400110824   S***S
041500110824    *** GENERATE MEMBER RECORD
041600110824    ***
041700110824     C     $STEP4        BEGSR
041800110824    ***
041900141017       IF VIS#CNE = 0;
042000141017          @STEP = 'STEP2';
042100141017          LEAVESR;
042200141017       ENDIF;
042300110824    ***
042400141017       WRT@TYPE = 'MEMBER';
042500141016    ***
042600141016    *** IF WE HAVE A TERM DATE, NVA REQUEST TERMS ARE BUMPED BACK A DAY.
042700141016    ***
042800141016    ***
042900141016       IF VIS@TRM(VIS#CNE) < 99999999 AND VIS@TRM(VIS#CNE) > 0;
043000141017          #DATE = VIS@TRM(VIS#CNE);
043100141016     C                   MOVE      #DATE         #ISO
043200141016     C                   SUBDUR    1:*D          #ISO
043300141016     C                   MOVE      #ISO          #DATE
043400141017          VIS@TRM(VIS#CNE) = #DATE;
043500141016       ENDIF;
043600141024    ***
043700141027    *  @GROUP = VIS@GRP(VIS#CNE);
043800110824    ***
043900141017       EXSR $CRTM10;
044000110824    ***
044100141017       EXSR $CRTM20;
044200141016    ***
044300141017       EXSR $CRTM30;
044400110824    ***
044500141017       @STEP = 'PREP5';
044600110824    ***
044700110824     C                   ENDSR
044800141017    ***
044900110824   S***S
045000141017    ***
045100141016     C     $CRTM10       BEGSR
045200110824    ***
045300141016       CLEAR NV30F;
045400141016       CLEAR DEMOGRFX;
045500111006    ***
045600141016       D1SEG = '10';
045700141016       D1PCI = %TRIM(CACID2);
045800141027       D1GRP = %TRIM(@GROUP);
045900141016       D1SSN = %EDITC(MBSSNO:'X');
046000141016       D100 = '00';
046100141016       D1DTE = @DATE;
046200141016       D1HMS = '080000';
046300141016    ***
046400141016       D1PERCOD = '001';
046500141016       D1RELCOD = '1';
046600141016       D1FNAME = %TRIM(MFNAME);
046700141016       D1MMI = MMI;
046800141016       D1LNAME = %TRIM(MLNAME);
046900141016       EXSR $SUFFIX;
047000141016    ***
047100141017       D1DOB = %EDITC(BIRTH:'X');
047200141016       D1GENDR = SEX;
047300141024       D1DEPSS = *BLANKS;
047400141016       D1N1 = 'N';
047500141016    ***
047600141016       #DATE = VIS@FRM(VIS#CNE);
047700141016       D1ENRD = %EDITC(#DATE:'X');
047800141016       IF VIS@TRM(VIS#CNE) = 99999999;
047900141016          D1CAND = '000000000';
048000141016       ELSE;
048100141016          #DATE = VIS@TRM(VIS#CNE);
048200141016          D1CAND = %EDITC(#DATE:'X');
048300141016       ENDIF;
048400141028       D1COB = COB;
048500141016    ***
048600141016       F0DATA = DEMOGRFX;
048700141016       F0KEY1 = '10';
048800141016       F0KEY2 = %TRIM(CACID2);
048900141027       F0KEY3 = %TRIM(@GROUP);
049000141016       F0KEY4 = %EDITC(MBSSNO:'X');
049100141016       F0KEY5 = '001';
049200141017       F0KEY6 = %TRIM(CACID1);
049300141016    ***
049400141016       WRITE NV30F;
049500141016    ***
049600141016     C                   ENDSR
049700141017    ***
049800141016   S***S
049900141017    ***
050000141016     C     $CRTM20       BEGSR
050100141016    ***
050200141016       CLEAR NV30F;
050300141016       CLEAR ADDREZZ;
050400141016    ***
050500141016       A2SEG = '20';
050600141016       A2PCI = %TRIM(CACID2);
050700141027       A2GRP = %TRIM(@GROUP);
050800141016       A2SSN = %EDITC(MBSSNO:'X');
050900141016       A200 = '00';
051000141016       A2DTE = @DATE;
051100141016       A2HMS = '080000';
051200141016    ***
051300141016       A2ADDR1 = %TRIM(ADDR1);
051400141016       A2ADDR2 = %TRIM(ADDR2);
051500141016       A2CITY = %TRIM(CITY);
051600141016       A2STATE = STATE;
051700141016    ***
051800141016       @9 = %EDITC(ZIP:'X');
051900141016       A2ZIP = %SUBST(@9:1:5) + '-' + %SUBST(@9:6:4);
052000141024       // IF AREA <> 0 AND AREA <> 555 AND PHONE <> 0;
052100141024       //   A2PHONE = %EDITC(AREA:'X') + %EDITC(PHONE:'X');
052200141024       // ENDIF;           WHY WE NEVER SENT PHONE, I DO NOT KNOW.  BUT THIS IS A REWRITE.
052300141024       //                     NOT A REDESIGN.
052400141024       A2PHONE = *BLANKS;
052500141016    ***
052600141016       F0DATA = ADDREZZ;
052700141016       F0KEY1 = '20';
052800141016       F0KEY2 = %TRIM(CACID2);
052900141027       F0KEY3 = %TRIM(@GROUP);
053000141016       F0KEY4 = %EDITC(MBSSNO:'X');
053100141016       F0KEY5 = '001';
053200141017       F0KEY6 = %TRIM(CACID1);
053300141016    ***
053400141016       WRITE NV30F;
053500110824    ***
053600110824     C                   ENDSR
053700141017    ***
053800110824   S***S
053900141017    ***
054000141016     C     $SUFFIX       BEGSR
054100111028    ***
054200141016       P = 0;
054300141016    ***
054400141016       P = %SCAN(' SR ':D1LNAME);
054500141016       IF P > 0;
054600141016          D1SUFX = 'SR';
054700141016          LEAVESR;
054800141016       ENDIF;
054900141016    ***
055000141016       P = %SCAN(' SR. ':D1LNAME);
055100141016       IF P > 0;
055200141016          D1SUFX = 'SR';
055300141016          LEAVESR;
055400141016       ENDIF;
055500141016    ***
055600141016       P = %SCAN(' JR ':D1LNAME);
055700141016       IF P > 0;
055800141016          D1SUFX = 'JR';
055900141016          LEAVESR;
056000141016       ENDIF;
056100141016    ***
056200141016       P = %SCAN(' III ':D1LNAME);
056300141016       IF P > 0;
056400141016          D1SUFX = 'III';
056500141016          LEAVESR;
056600141016       ENDIF;
056700141016    ***
056800141016       P = %SCAN(' II ':D1LNAME);
056900141016       IF P > 0;
057000141016          D1SUFX = 'II';
057100141016          LEAVESR;
057200141016       ENDIF;
057300141016    ***
057400141016       P = %SCAN(' IV ':D1LNAME);
057500141016       IF P > 0;
057600141016          D1SUFX = 'IV';
057700141016          LEAVESR;
057800141016       ENDIF;
057900141016    ***
058000141016       P = %SCAN(' V ':D1LNAME);
058100141016       IF P > 0;
058200141016          D1SUFX = 'V';
058300141016          LEAVESR;
058400141016       ENDIF;
058500141016    ***
058600141016       P = %SCAN(' VI ':D1LNAME);
058700141016       IF P > 0;
058800141016          D1SUFX = 'VI';
058900141016          LEAVESR;
059000141016       ENDIF;
059100141016    ***
059200141016     C                   ENDSR
059300141017    ***
059400141016   S***S
059500141017    ***
059600141016     C     $CRTM30       BEGSR
059700141016    ***
059800141016       CLEAR NV30F;
059900141016       CLEAR COVERAGE;
060000141016    ***
060100141021       C3SEG = '30';
060200141016       C3PCI = %TRIM(CACID2);
060300141027       C3GRP = %TRIM(@GROUP);
060400141016       C3SSN = %EDITC(MBSSNO:'X');
060500141016       C300 = '00';
060600141016       C3DTE = @DATE;
060700141016       C3HMS = '080000';
060800141016    ***
060900141016       #DATE = VIS@FRM(VIS#CNE);
061000141016       C3ENRDT = %EDITC(#DATE:'X');
061100141024    ***
061200141024       IF VIS@TRM(VIS#CNE) = 99999999;
061300141024          C3CANDT = '000000000';
061400141024       ELSE;
061500141024          #DATE = VIS@TRM(VIS#CNE);
061600141024          C3CANDT = %EDITC(#DATE:'X');
061700141024       ENDIF;
061800141016    ***
061900141016       C3Z = '00000000';
062000141016       C3HIRE = %EDITC(EMPDT:'X');
062100141016    ***
062200141016       IF TERMDT > #MAXTERM;
062300141016          TERMDT = 0;
062400141016       ENDIF;
062500141016       C3TERM = %EDITC(TERMDT:'X');
062600141016    ***
062700141016       IF VIS@ENR(VIS#CNE) = 'TIN';
062800141016          C3COVTP = 'S';
062900141016       ELSEIF VIS@ENR(VIS#CNE) = 'TFA';
063000141016          C3COVTP = 'F';
063100141016       ELSE;
063200141016          C3COVTP = 'L';
063300141016       ENDIF;
063400141016    ***
063500141016       F0DATA = COVERAGE;
063600141016       F0KEY1 = '30';
063700141016       F0KEY2 = %TRIM(CACID2);
063800141027       F0KEY3 = %TRIM(@GROUP);
063900141016       F0KEY4 = %EDITC(MBSSNO:'X');
064000141016       F0KEY5 = '001';
064100141017       F0KEY6 = %TRIM(CACID1);
064200141016    ***
064300141016       WRITE NV30F;
064400111028    ***
064500111028     C                   ENDSR
064600141017    ***
064700110824   S***S
064800141017    ***
064900110824     C     $PREP5        BEGSR
065000110824    ***
065100141017       CHAIN (KF@SSN) DEPENR;
065200141017       IF NOT %FOUND(DEPNDC);
065300141017          @STEP = 'STEP2';
065400141017          LEAVESR;
065500141017       ENDIF;
065600141017    ***
065700141024       PERSCNT = 2;
065800111007    ***
065900141017       SETLL (KF@SSN) DEPENR;
066000111007    ***
066100141017       @STEP = 'STEP5';
066200111007    ***
066300111007     C                   ENDSR
066400110824   S***S
066500111007     C     $STEP5        BEGSR
066600111007    ***
066700141017       READE (KF@SSN) DEPENR;
066800111007    ***
066900141017       IF %EOF(DEPNDC);
067000141017          @STEP = 'STEP2';
067100141017          LEAVESR;
067200141017       ENDIF;
067300111007    ***
067400141017       KF@SEQ = DPSEQ#;
067500111007    ***
067600141017       CHAIN KL#DCV DCOVR;
067700141017       IF NOT %FOUND(DCOVA);
067800141017          LEAVESR;
067900141017       ENDIF;
068000111007    ***
068100141017       EXSR $CLRSTG;
068200111007    ***
068300141017       SETLL KL#DCV DCOVR;
068400111007    ***
068500141017       @STEP = 'STEP6';
068600111007    ***
068700111007     C                   ENDSR
068800111007   S***S
068900111007     C     $STEP6        BEGSR
069000111007    ***
069100141017       READE KL#DCV DCOVR;
069200111007    ***
069300141017       IF %EOF(DCOVA);
069400141017          @STEP = 'PREP7';
069500141017          LEAVESR;
069600141017       ENDIF;
069700141017    ***
069800141017       @PLANIN = DVPLAN;
069900141028       @ENRIN = 'XXX';
070000141017       #EFFDTE = DENRDT;
070100141017       #CANCEL = CCANDT;
070200111007    ***
070300141017       IF #CANCEL = 0;
070400141017          #CANCEL = 99999999;
070500141017       ENDIF;
070600141017    ***
070700141017       EXSR $QUIK;
070800111007    ***
070900141017       EXSR $PLANSRCH;
071000111007    ***
071100141017       IF PLN@CAT <> 'VIS';
071200141017          LEAVESR;
071300141017       ENDIF;
071400111007    ***
071500141017       EXSR $AD2MARY;
071600111007    ***
071700111007     C                   ENDSR
071800111007   S***S
071900111007     C     $PREP7        BEGSR
072000111007    ***
072100141017       IF VIS#CNE = 0;
072200141017          @STEP = 'STEP5';
072300141017          LEAVESR;
072400141017       ENDIF;
072500111007    ***
072600141017       TERM_VIS = NO;
072700141017    ***
072800141017       EXSR $CHKHEM;
072900111007    ***
073000141017       @STEP = 'STEP7';
073100111007    ***
073200111007     C                   ENDSR
073300111007   S***S
073400111007     C     $STEP7        BEGSR
073500111007    ***
073600141017       IF VIS#CNE = 0;
073700141017          @STEP = 'STEP5';
073800141017          LEAVESR;
073900141017       ENDIF;
074000111007    ***
074100141017       WRT@TYPE = 'DEPEND';
074200111007    ***
074300141017       IF VIS@TRM(VIS#CNE) < 99999999 AND VIS@TRM(VIS#CNE) > 0;
074400141017          #DATE = VIS@TRM(VIS#CNE);
074500141017     C                   MOVE      #DATE         #ISO
074600141017     C                   SUBDUR    1:*D          #ISO
074700141017     C                   MOVE      #ISO          #DATE
074800141017          VIS@TRM(VIS#CNE) = #DATE;
074900141017       ENDIF;
075000141017    ***
075100141027    *  @GROUP = VIS@GRP(VIS#CNE);
075200141024    ***
075300141017       EXSR $CRTD10;
075400111007    ***
075500141017       @STEP = 'STEP5';
075600111007    ***
075700111007     C                   ENDSR
075800141017    ***
075900141017   S***S
076000141017    ***
076100141017     C     $CRTD10       BEGSR
076200141017    ***
076300141017       CLEAR NV30F;
076400141017       CLEAR DEMOGRFX;
076500141017    ***
076600141017       D1SEG = '10';
076700141017       D1PCI = %TRIM(CACID2);
076800141027       D1GRP = %TRIM(@GROUP);
076900141017       D1SSN = %EDITC(KF@SSN:'X');
077000141017       D100 = '00';
077100141017       D1DTE = @DATE;
077200141017       D1HMS = '080000';
077300141017    ***
077400141017       SELECT;
077500141017          WHEN DRELCD = 'RWI' OR DRELCD = 'RHU';
077600141024             D1PERCOD = '002';
077700141017             D1RELCOD = '2';
077800141017          WHEN DRELCD = 'RSO' OR DRELCD = 'RDA';
077900141024             PERSCNT += 1;
078000141024             D1PERCOD = %EDITC(PERSCNT:'X');
078100141017             D1RELCOD = '3';
078200141017          WHEN DRELCD = 'RPA';
078300141024             PERSCNT += 1;
078400141024             D1PERCOD = %EDITC(PERSCNT:'X');
078500141017             D1RELCOD = '8';
078600141017          OTHER;
078700141024             PERSCNT += 1;
078800141024             D1PERCOD = %EDITC(PERSCNT:'X');
078900141017             D1RELCOD = '4';
079000141017       ENDSL;
079100141017    ***
079200141017       D1FNAME = %TRIM(DFNAME);
079300141017       D1MMI = DMI;
079400141017       D1LNAME = %TRIM(DLNAME);
079500141017       EXSR $SUFFIX;
079600141017    ***
079700141017       D1DOB = %EDITC(DBIRTH:'X');
079800141017       D1GENDR = DSEX;
079900141017    ***
080000141017       IF DEPSS# > 0;
080100141017          D1DEPSS = %EDITC(DEPSS#:'X');
080200141017       ELSE;
080300141017          D1DEPSS = '000000000';
080400141017       ENDIF;
080500141017    ***
080600141017       D1N1 = 'N';
080700141017    ***
080800141017       #DATE = VIS@FRM(VIS#CNE);
080900141017       D1ENRD = %EDITC(#DATE:'X');
081000141017       IF VIS@TRM(VIS#CNE) = 99999999;
081100141017          D1CAND = '000000000';
081200141017       ELSE;
081300141017          #DATE = VIS@TRM(VIS#CNE);
081400141017          D1CAND = %EDITC(#DATE:'X');
081500141017       ENDIF;
081600141028       D1COB = DCOB;
081700141017    ***
081800141017       F0DATA = DEMOGRFX;
081900141017       F0KEY1 = '10';
082000141017       F0KEY2 = %TRIM(CACID2);
082100141027       F0KEY3 = %TRIM(@GROUP);
082200141017       F0KEY4 = %EDITC(KF@SSN:'X');
082300141017       F0KEY5 = D1PERCOD;
082400141017       F0KEY6 = %TRIM(CACID1);
082500141017    ***
082600141017       WRITE NV30F;
082700141017    ***
082800141017     C                   ENDSR
082900141017    ***
083000111007   S***S
083100111007     C     *INZSR        BEGSR
083200111007    ***
083300111007     C     KL#ACCTL      KLIST
083400111007     C                   KFLD                    CARR#CTL
083500111007     C                   KFLD                    KF@TRS
083600111007     C                   KFLD                    KF@SUB
083700111007     C                   KFLD                    KF@ACC
083800120711    ***
083900120711     C     KL#AUX        KLIST
084000120711     C                   KFLD                    KF@TRS
084100120711     C                   KFLD                    KF@SUB
084200120711     C                   KFLD                    KF@ACC
084300120711     C                   KFLD                    KF@SSN
084400120711     C                   KFLD                    KF@SEQ
084500111007    ***
084600111007     C     KL#TSA        KLIST
084700111007     C                   KFLD                    KF@TRS
084800111007     C                   KFLD                    KF@SUB
084900111007     C                   KFLD                    KF@ACC
085000111007    ***
085100111007     C     KL#MPLN       KLIST
085200111007     C                   KFLD                    KF@SSN
085300111007     C                   KFLD                    KF@SEQ
085400111007     C                   KFLD                    KF@TRS
085500111007     C                   KFLD                    KF@SUB
085600111007     C                   KFLD                    KF@ACC
085700111007    ***
085800111007     C     KL#CPLN       KLIST
085900111007     C                   KFLD                    CARR#CTL
086000111007     C                   KFLD                    KF@TRS
086100111007     C                   KFLD                    KF@SUB
086200111007     C                   KFLD                    KF@ACC
086300111007     C                   KFLD                    KF@CCTR
086400111007     C                   KFLD                    KF@PLN
086500111007    ***
086600111007     C     KL#DCV        KLIST
086700111007     C                   KFLD                    KF@SSN
086800111007     C                   KFLD                    KF@SEQ
086900141017     C                   KFLD                    KF@TRS
087000141017     C                   KFLD                    KF@SUB
087100111007    ***
087200111007     C     KL#MTR        KLIST
087300111007     C                   KFLD                    KF@SSN
087400111007     C                   KFLD                    KF@SEQ
087500141017     C                   KFLD                    KF@TRM
087600111007     C                   KFLD                    KF@PLN
087700111007     C                   KFLD                    KF@ENR
087800111007     C                   KFLD                    KF@TRS
087900111007     C                   KFLD                    KF@SUB
088000111007     C                   KFLD                    KF@ACC
088100111007    ***
088200111007     C                   ENDSR
088300111007   S***S
088400111007    *** PLANS LOADED BY ACCOUNT
088500111007    ***
088600111007     C     $PLANLOAD     BEGSR
088700111007    ***
088800111007     C                   EVAL      PP# = 0
088900111007     C                   DO        50
089000111007     C                   ADD       1             PP#
089100111007     C     PP#           OCCUR     CARPLN@
089200111007     C                   CLEAR                   CARPLN@
089300111007     C                   ENDDO
089400111007     C                   EVAL      PC# = 0
089500111007     C                   EVAL      PP# = 0
089600111007    ***
089700111007     C     KL#ACCTL      SETLL     CARPLNR
089800111007     C                   DOU       %EOF(CARPLNP)
089900111007     C     KL#ACCTL      READE     CARPLNR
090000111007     C                   IF        NOT %EOF(CARPLNP)
090100111007    ***
090200111007     C                   ADD       1             PC#
090300111007     C     PC#           OCCUR     CARPLN@
090400111007     C                   EVAL      CARPLN@ = DS@CARPLN
090500111007    ***
090600111007     C                   ENDIF
090700111007     C                   ENDDO
090800111007    ***
090900111007     C                   ENDSR
091000111007   S***S
091100111007     C     $CLRSTG       BEGSR
091200111007    ***
091300111007     C                   EVAL      #CANCEL = 0
091400111007    ***
091500111007     C                   EVAL                    VIS#CNE = 0
091600111007     C                   EVAL                    VIS#NDX = 0
091700111007     C                   CLEAR                   VIS@PLN
091800111007     C                   CLEAR                   VIS@ENR
091900111007     C                   CLEAR                   VIS@FRM
092000111007     C                   CLEAR                   VIS@TRM
092100141024     C                   CLEAR                   VIS@GRP
092200141017    ***
092300111007     C                   ENDSR
092400111007   S***S
092500111007     C     $CHKHEM       BEGSR
092600111007    ***
092700141016     C                   IF        VIS@TRM(VIS#CNE) = 99999999
092800141016     C                   LEAVESR
092900141016     C                   ENDIF
093000141016    ***
093100141016     C                   EVAL      TERM_VIS = YES
093200141017     C                   EVAL      KF@TRM = VIS@TRM(VIS#CNE)
093300141016     C                   EVAL      KF@PLN = VIS@PLN(VIS#CNE)
093400141016     C                   EVAL      KF@ENR = VIS@ENR(VIS#CNE)
093500141016    ***
093600141016     C     KL#MTR        CHAIN     NV31F
093700141016     C                   IF        %FOUND(NVA031WF)
093800141016     C                   EVAL      VIS#CNE = 0
093900141016     C                   EVAL      TERM_VIS = NO
094000141016     C                   LEAVESR
094100141016     C                   ENDIF
094200111007    ***
094300141016    *C                   CLEAR                   NV31F
094400141016     C                   EVAL      N1SSNO         = KF@SSN
094500141017     C                   EVAL      N1DEPNO        = KF@SEQ
094600141017     C                   EVAL      N1TERMDT       = KF@TRM
094700141016     C                   EVAL      N1PLAN         = KF@PLN
094800141017     C                   EVAL      N1COVTP        = KF@ENR
094900141017     C                   EVAL      N1TRST         = KF@TRS
095000141016     C                   EVAL      N1SUB#         = KF@SUB
095100141016     C                   EVAL      N1ACCT         = KF@ACC
095200141017     C                   EVAL      N1TRANSDT      = #TODAY
095300141016     C                   WRITE     NV31F
095400111007    ***
095500111007    *C                   ENDSR
095600141017   S***S
095700111007     C     $PLANSRCH     BEGSR
095800111007    ***
095900130118     C                   MOVE      *BLANKS       PLN@CAT
096000111007     C                   EVAL      PP# = 0
096100111007     C                   CLEAR                   DS@CARPLN
096200111007    ***
096300111007     C                   DO        PC#
096400111007    * *
096500111007     C                   ADD       1             PP#
096600111007     C     PP#           OCCUR     CARPLN@
096700111007    * *
096800141016     C                   IF        XPPLAN = @PLANIN
096900111007     C                   EVAL      DS@CARPLN = CARPLN@
097000141016     C                   EVAL      PLN@CAT = 'VIS'
097100141016     C                   LEAVESR
097200111007     C                   ENDIF
097300111007    * *
097400111007     C                   ENDDO
097500111007    ***
097600111007     C                   ENDSR
097700111007   S***S
