000100160613     H option(*noDebugIo)
000200180626      *===========================================================================
000300180626      * PCORINEW - PCORI Anual report
000400180626      *===========================================================================
000500180626      * Date        Int   Description
000600180626      * ----------  ---   --------------------------------------------------------
000700180626      * 06/26/2018  jt    Original creation
000800150529
000900180626      *===========================================================================
001000150529
001100180625     fgrat24    if   e           k disk    ExtFile('F.GRAT24')
001200180625     f                                     rename(grater:rateFile)
001300150529
001400180625     fsmansp    if   e           k disk    rename(smanr:smanFile)
001500150529
001600180625     fplnunique if   e           k disk    rename(plnmsr:planFile)
001700150529
001800180625     facmunique if   e           k disk    rename(accmsr:actmFile)
001900180625
002000180625     fac2mstl2  if   e           k disk    rename(accmsr2:actm2File)
002100180625
002200180625     fmcovxx    if   e           k disk    ExtFile('F.MCOVXX')
002300180625     f                                     rename(mcovr:covFile)
002400150529
002500180625     fmember    if   e           k disk    ExtFile('F.MEMBER')
002600180625     f                                     rename(membr:memberFile)
002700150529
002800180625     fpcoripf   uf a e           k disk    rename(pcorir:pcoriFile)
002900180626
003000180626     fpcoripfsumuf a e           k disk    rename(pcorir:pcorisFile)
003100180626
003200180626     fpcoripfcatuf a e           k disk    rename(pcoricr:pcoricFile)
003300180625
003400180626      //==========================================================================
003500180625
003600180626     d #bgn            s              8  0
003700180626     d #end            s              8  0
003800180626     d #bgnpln         s              8  0
003900180626     d #endpln         s              8  0
004000180626     d holdDate#       s             12  0
004100180627     d holdPlan        s              4
004200180627     d candtHold       s              8  0
004300180628     d inType          s              3
004400180626
004500190717     d pcorinewct      pi
004600190717     d  inTerms                       1
004601190717     d  inFromDate                    8  0
004602190717     d  inToDate                      8  0
004700190717
004800170524      //==========================================================================
004900170524      // mainline
005000170524      //==========================================================================
005100150529
005200170524       exsr init;
005300170524       exsr main;
005400170524       exsr exit;
005500170524
005600180628      //========================================================================
005700180628      // main
005800180628      //========================================================================
005900180628
006000180628       begsr main;
006100180628
006200180628        intype = 'PBG';
006300180628        exsr main2;
006400180628
006500180628        intype = 'PBN';
006600180628        exsr main2;
006700180628
006800180628        intype = 'PAD';
006900180628        exsr main2;
007000180628
007100180628        intype = 'PHR';
007200180628        exsr main2;
007300180628
007400180628        intype = 'P1P';
007500180628        exsr main2;
007600180628
007700190108        intype = 'PMM';
007800190108        exsr main2;
007900190108
008000180628        endsr;
008100180628
008200180625      //========================================================================
008300180625      // main
008400180625      //========================================================================
008500180625
008600180628       begsr main2;
008700180625
008800180625       setll *loval rateFile;
008900180625       read rateFile;
009000180625
009100180625       dow not %eof;
009200180625
009300180625       if todat >= #bgn;
009400180625
009500180625        if frmdat < #bgn;
009600180625         #bgnpln = #bgn;
009700180625        endif;
009800180625
009900180625        if todat > #end;
010000180625         #endpln = #end;
010100180625        else;
010200180625         #endpln = todat;
010300180625        endif;
010400180625
010500180625        exsr checkPlan;
010600180625
010700180625       endif;
010800150610
010900180625       read rateFile;
011000180625       enddo;
011100180625
011200180625       endsr;
011300180625
011400180625      //=======================================================================
011500180625      // check plan
011600180625      //=======================================================================
011700180625
011800180625       begsr checkPlan;
011900180625
012000180625        holdDate# = 0;
012100180625
012200180625        chain (grtrst : grsub# : grplan) planFile;
012300180625        if %found;
012400180626         if plncat <> intype;
012500180625          leavesr;
012600180625         endif;
012700180625        endif;
012800180625
012900180625        exsr writeMembers;
013000180625
013100180625       endsr;
013200180625
013300180625      //=======================================================================
013400180625      // write members
013500180625      //=======================================================================
013600180625
013700180625       begsr writemembers;
013800180625
013900180625        setll (grtrst : grsub# : grplan) covFile;
014000180625        reade (grtrst : grsub# : grplan) covFile;
014100180625        dow not %eof;
014200180625
014300180627         candtHold = candt;
014400180627         if candtHold = 0;
014500180627          candtHold = 99999999;
014600180627         endif;
014700180627
014800180627         if candtHold > #bgn and candtHold > 0;
014900180627          if enrldt <> candt;
015000180627
015100180627           if enrldt >= #bgnpln;
015200180627            exsr writeFile;
015300180627           endif;
015400180627
015500190108           if candt = 0;
015600180627            if enrldt <= #endpln;
015700180627             exsr writeFile;
015800180627            endif;
015900180627           endif;
016000180627
016100180627           if candt > 0;
016200180627            if candt > #endpln;
016300180627             exsr writeFile;
016400180627            endif;
016500180627           endif;
016600180625
016700180627          endif;
016800180627         endif;
016900180627
017000180625        reade (grtrst : grsub# : grplan) covFile;
017100180625        enddo;
017200180625
017300180625       endsr;
017400180625
017500180625      //=======================================================================
017600180625      // write file
017700180625      //=======================================================================
017800180625
017900180625       begsr writeFile;
018000180627
018100180625        chain (grtrst : grsub# : acc# : grplan : %editc(mcssno:'X')) pcoriFile;
018200180625        if not %found;
018300180625         ptrst = grtrst;
018400180625          psub# = grsub#;
018500180625           pacct = acc#;
018600180626
018700180627           if grplan <> holdPlan;
018800180627            paccum = 0;
018900180627           endif;
019000180626
019100180626           pplan = grplan;
019200180626
019300180625          pssn = %editc(mcssno:'X');
019400180625
019500180625         chain (grtrst : grsub# : acc#) actmFile;
019600180625         if %found;
019700180627          pname = acnam1;
019800180627           padd1 = aaddr1;
019900180627            padd2 = addr2;
020000180627             pcity = acity;
020100180626             pst = astate;
020200180626            pzip = %editc(azip:'X');
020300180626           pcontact = contac;
020400180626          pecontact = ecntac;
020500180625         endif;
020600180625
020700190717         If inTerms = ' ';
020701190717          if atrmdt > 0;
020800190717           leavesr;
020900190717          endif;
020901190717         endif;
021000180626
021001190717         If inTerms = 'Y';
021002190717          if atrmdt = 0;
021003190717           leavesr;
021004190717          endif;
021005190717         endif;
021006190717
021007190717         //if atrmdt > 0;
021008190717         // leavesr;
021009190717         //endif;
021010190717
021100180625         chain (grtrst : grsub# : acc#) actm2File;
021200180625         if %found;
021300180625          pemail = a2email1;
021400180625         endif;
021500180625
021600180625         chain smancd smanFile;
021700180625         if %found;
021800180625          if smi > ' ';
021900180625           psman = %trim(sfname) + ' ' + %trim(smi) + ' ' + %trim(slname);
022000180625          else;
022100180625           psman = %trim(sfname) + ' ' + %trim(slname);
022200180625          endif;
022300180625         endif;
022400180625
022500180625         chain mcssno memberFile;
022600180625         if %found;
022700180625          plname = mlname;
022800180625           pfname = mfname;
022900180625          pdob = %char(birth);
023000180625         endif;
023100180625
023200180625         penrldt = %char(enrldt);
023300180625         pstdate = %char(#bgn);
023400180625         pcandt = %char(candt);
023500180626         penddt = %char(#end);
023600180625
023700180628         pnumdays = ' ';
023800180628
023900180628         if enrldt >= #bgn and candt <= #end;
024000180628          if candt > 0;
024100180628           pnumdays = %char(%diff(%date(candt):%date(enrldt):*days));
024200180628          endif;
024300180628         endif;
024400180627
024500180628         if pnumdays = ' ';
024600180628          if enrldt > #bgn and candt < #end and candt > 0;
024700180628           pnumdays = %char(%diff(%date(candt):%date(enrldt):*days));
024800180628          endif;
024900180628         endif;
025000180625
025100180627         if pnumdays = ' ';
025200180628          if candt > #end;
025300180628           if enrldt < #bgn;
025400180628            pnumdays = '365';
025500180628           endif;
025600180627          endif;
025700180627         endif;
025800180625
025900180627         if pnumdays = ' ';
026000180628          if candt > 0;
026100180628           if enrldt < #bgn;
026200180628            pnumdays = '365';
026300180628           endif;
026400180628          endif;
026500180627         endif;
026600180625
026700180627         if pnumdays = ' ';
026800180628          if enrldt < #bgn;
026900180628           if candt = 0;
027000180628            pnumdays = '365';
027100180628           endif;
027200180628          endif;
027300180627         endif;
027400180625
027500180627         if pnumdays = ' ';
027600180627          if enrldt > #bgn;
027700180625           pnumdays = %char(%diff(%date(#end):%date(enrldt):*days));
027800180627          endif;
027900180627         endif;
028000180625
028100180626         pavg = 0;
028200180626         if pnumdays > ' ';
028300180626          pavg = %dec(pnumdays:3:0) / 365;
028400180626         endif;
028500180626
028600180626         paccum = paccum + pavg;
028700180626
028800180626         if enrldt <= #end;
028900180627          holdPlan = pplan;
029000180628          exsr writeCategory;
029100180626         endif;
029200180626
029300180625        endif;
029400180625
029500180625       endsr;
029600180625
029700180628      //==========================================================================
029800180628      // write category
029900180628      //==========================================================================
030000180628
030100180628       begsr writeCategory;
030200180628
030300180628        chain (grtrst : grsub# : acc# : grplan) pcoricFile;
030400180628        if not %found;
030500180628         pcat = intype;
030600180628         write pcoricFile;
030700180628        endif;
030800180628
030900180628       endsr;
031000180628
031100170524      //==========================================================================
031200170524      // exit
031300170524      //==========================================================================
031400170524
031500170629       begsr exit;
031600170524
031700170524        *inlr = '1';
031800170524        return;
031900170524
032000170524       endsr;
032100170524
032200170524      //==========================================================================
032300170524      // init
032400170524      //==========================================================================
032500170524
032600170524       begsr init;
032700170524
032800180627        // Beginning day of last year...
032900180626        #bgn = %dec(%char(%dec(*year - 1)) + %editc(%dec('0101':4:0):'X'):8:0);
033000180626
033100180626        // End day of last year...
033200180626        #end = %dec(%char(%dec(*year - 1)) + %editc(%dec('1231':4:0):'X'):8:0);
033201190717
033202190717        if inFromDate > 0;
033203190717         #bgn = inFromDate;
033205190717        endif;
033300170524
033301190717        if inToDate > 0;
033302190717         #end = inToDate;
033303190717        endif;
033304190717
033400170524       endsr;
033500170524
033600170524      //==========================================================================
