000101211216      *================================================================================
000102211216     H option(*noDebugIo)
000103211216      *================================================================================
000104220520      * PLANSHARED - Plans that are shared with missing aux
000105211216      *================================================================================
000106211216      * Date        Int   Description
000107211216      * ----------  ---   -------------------------------------------------------------
000108220520      * 05/20/2022  jt    Original creation
000109211216      *================================================================================
000111211216
001400220520     fcomcontrl1if   e           k disk    rename(comcontrol:commision)
001402211216
001403220520     fplanaux1  if   e           k disk    rename(planaux:auxiliary)
001405211221
001406220520     fplanunsharuf a e             disk    rename(planunr:shared)
001407220520
001408220520     fplnmst    if   e           k disk    rename(plnmsr:planFile)
001409220520     f                                     extfile('F.PLNMST')
001410220520
001411211221      //=======================================================================
001412211221
001500211221     d john            s              3  0
001501211221
002104211216      //=======================================================================
002105211216      // mainline
002106211216      //=======================================================================
002107211216
002108211216       exsr init;
002109211216       exsr main;
002110211216       exsr exit;
002111211216
002126211216       //=======================================================================
002127211216       // main2subr
002128211216       //=======================================================================
002129211216
002130211216       begsr main;
002131211216
002132220520        setll *loval commision;
002133220520        read commision;
002137211221        dow not %eof;
002138211221
002139220520         chain (cmtrst : csubdv : cmplan) planFile;
002140220520         if plncat <> 'PCA' and plncat <> 'PBG'
002141220520          and plncat <> 'P1P' and plncat <> 'PAD'
002142220520           and plncat <> 'PHR' and plncat <> 'PBN';
002144220520
004333220520         chain (cmtrst : csubdv : cmacct : cmplan) auxiliary;
004334220520         if not %found;
004335220520          trst = %editc(cmtrst:'X');
004336220520           sub# = %editc(csubdv:'X');
004337220520            acct =%editc(cmacct:'X');
004338220520            plan = cmplan;
004339220526           plancat = plncat;
004340220520
004341220520           if cmcan > 0;
004342220520            date = %date(cmcan);
004343220520           endif;
004344220520
004345220520          write shared;
004346220520         endif;
004347220520         endif;
004348220520        read commision;
004601211216        enddo;
005700211216
005800211216       endsr;
005801211216
005904211216       //=======================================================================
005905211216       // exit
005906211216       //=======================================================================
005907211216
005908211216       begsr exit;
005909211216
005910211216        *inlr = '1';
005911211216        return;
005912211216
005913211216       endsr;
005914211216
005915211216       //=======================================================================
005916211216       // init subr
005917211216       //=======================================================================
005918211216
005919211216       begsr init;
005920211216
005921211216       endsr;
005922211216
005923211216       //=======================================================================
