000100020621     H*Indent ('| ')
000200990630      *? ***************************************************************
000600020523      *
000700060829      *             GROUP BENIFIT SERVICES SOFTWARE           2006     *
000800060829      *                                                                *
000900000118      *  Written by:    S. Zien                                        *
001000100414      *  Date Written:   4/14/10                                       *
001100100414      *  Description:   Generate CSV File for Active COBRA Members     *
001200000118      *                                                                *
001300000118      *                                                                *
001400000118      *                R E V I S I O N    H I S T O R Y                *
001500000118      *  Date                                                          *
001600000118      *  Revised   Initials    Revision                                *
001700000118      *  --------  --------    --------------------------------------  *
001800060815      *                                                                *
002900120220      *  02/20/12 dlk - add acct fields                                *
002901140522      *  05/22/14 dlk - add member address                             *
003000990630      *? ***************************************************************
003001100414     FQCOB1F    IF   E           K Disk    Rename(QCOB1F:QCOB1R)
003008100414     FQCOB1CSV  O  A E             Disk
024700010326
071405060816      *
071406100414     C                   Read      QCOB1F
071412100414     C                   Dow       Not %Eof(QCOB1F)
071420061010     C                   Exsr      Process
071423100414     C                   Read      QCOB1F
071424061010     C                   EndDo
071501060817     C                   Eval      *InLR     =   *On
080000010403
080001060817      *---------------------------------------------------------------*
080002061010     C     Process       Begsr
080003060817      *---------------------------------------------------------------*
080013080409
080014100414     C     QEDT          Mult      10000.0001    QEDT
080015100414     C     CEXPDT        Mult      10000.0001    CEXPDT
080016100414     C     GBSCDT        Mult      10000.0001    GBSCDT
080017100414     C     SMFRDT        Mult      10000.0001    SMFRDT
080018100414     C     SMTODT        Mult      10000.0001    SMTODT
080019140522     c                   clear                   zipout           10
080020140522     c                   move      zip           zip4              4
080021140522     c                   movel     zip           zip5              5
080022140522     c                   movel     zip5          zipout
080023140522     c                   if        zip4 <> '0000'
080024140522     c                   cat       '-':0         zipout
080025140522     c                   cat       zip4:0        zipout
080026140522     c                   end
080027140522
080028080409     C                   Eval      WKRECORD  =   '"' +
080029100414     C                                           MLNAME         + '","' +
080030100414     C                                           MFNAME         + '","' +
080031100414     C                              %Trim(%Editc(MBSSNO:'P'))   + '","' +
080032140522     C                              %Trim(addr1)                + '","' +
080033140522     C                              %Trim(addr2)                + '","' +
080034140522     C                              %Trim(city)                 + '","' +
080035140522     C                              %Trim(state)                + '","' +
080036140522     C                              zipout                      + '","' +
080037100414     C                              %Trim(%Editc(QEDT:'Y'))     + '","' +
080038100414     C                              %Trim(%Editc(CEXPDT:'Y'))   + '","' +
080039100414     C                              %Trim(%Editc(GBSCDT:'Y'))   + '","' +
080040100414     C                              %Trim(%Editc(SMFRDT:'Y'))   + '","' +
080041100414     C                              %Trim(%Editc(SMTODT:'Y'))   + '","' +
080042100414     C                              %Trim(%Editc(MBTRST:'P'))   + '","' +
080043100414     C                              %Trim(%Editc(MBSUB#:'P'))   + '","' +
080044120220     C                              %Trim(%Editc(MBACCT:'P'))   + '","' +
080045120220     C                              %Trim(acnam1)               + '","' +
080046120220     C                              %Trim(acobsrv)              + '","' +
080047120220     C                              %Trim(fcstfl)               + '",'
080048100414     C                   Write     QCOB1CSR
080049080409     C*
080094060817     C                   ENDSR
080095060817
080432080409      * ? _____________________________________________________________
080433080409      *? *                                                             *
080434080409      *? *        Write Excel Spreadsheet Title to CSV File            *
080435080409      *? *_____________________________________________________________*
080436080409     C     WriteSpTitle  BEGSR
080437080409     C*
080438100414     C                   Eval      WKRECORD  = '"' + 'Last Name'   + '","' +
080439100414     C                                              'First Name'   + '","' +
080440100414     C                                                    'SSNO'   + '","' +
080441140522     C                                         'ADDRESS 1'         + '","' +
080442140522     C                                         'ADDRESS 2'         + '","' +
080443140522     C                                         'CITY'              + '","' +
080444140522     C                                         'STATE'             + '","' +
080445140522     C                                         'ZIP'               + '","' +
080446100414     C                                             'COBRA Begin'   + '","' +
080447100414     C                                           'COBRA Expires'   + '","' +
080448100414     C                                       'COBRA Begin Admin'   + '","' +
080449100414     C                                           'Subsidy Begin'   + '","' +
080451100414     C                                             'Subsidy End'   + '","' +
080452100414     C                                                   'Trust'   + '","' +
080453100414     C                                                     'Sub'   + '","' +
080454120220     C                                                    'Acct'   + '","' +
080455120220     C                                               'Acct Name'   + '","' +
080456120220     C                                           'COBRA Service'   + '","' +
080457120220     C                                                'F/S Flag'   + '",'
080458100414     C                   Write     QCOB1CSR
080459080409     C*
0804600804090320 C                   ENDSR
080461060817
080462060817      *---------------------------------------------------------------*
080463060817     C     *INZSR        BEGSR
080464060817      *---------------------------------------------------------------*
080465060817     C     *DATE         Mult      10000.0001    Today             8 0
080495080409     C                   Exsr      WriteSpTitle
080496100414     C                   EndSr
080500010412
081900010403     C/EJECT
