000100160513      *===========================================================================
000200160512     H option(*noDebugIo)
000300160513      *===========================================================================
000400020523      *
000500160513      *             GROUP BENIFIT SERVICES SOFTWARE
000600160513      *
000700160513      *  Written by:   J. Torres
000800160513      *  Date Written: 05/12/16
000900160524      *  Description:  Generate XLS files for EyeMed
001000160524      *                (Old groups are hardcoded because they will not change,
001100160524      *                 all other groups moving forward go under new groups).
001200160513      *
001300160513      *===========================================================================
001400160520
001500161222     Freconev   if   e           k disk    rename(reconevr:everFile)
001600161222
001700161222     Frecon     uf a e           k disk    rename(reconr:reconFile)
001800160523
001900161222     Fmcov14    if   e           k disk    rename(mcovr:memcovFile)
002000150820
002100161222     Fmember    if   e           k disk    rename(membr:memberFile)
002200161222
002300161222     Fmemalt    if   e           k disk    rename(memaltr:altFile)
002400170417
002500170417     Fgrate     if   e           k disk    rename(grater:groupFile)
002600161222
002700170418     Faccmst    if   e           k disk    rename(accmsr:acctFile)
002800170418
002900161228      //==================================================================
003000161228
003100170418     D fmtDate         s               d   datfmt(*usa)
003200170417     D group           s             15
003300170418     D $pos            S              2  0
003400170418     D maaltid9        s              9
003500170418     D s               s              3
003600161228
003700160511      //==================================================================
003800160511      // mainline
003900160511      //===================================================================
004000150820
004100160511       exsr init;
004200160511       exsr main;
004300160511       exsr exit;
004400160511
004500160511      //===================================================================
004600160511      // main
004700160511      //===================================================================
004800160511
004900160511       begsr main;
005000160511
005100161222        setll *loval memcovFile;
005200161222        read memcovFile;
005300161222
005400161222        dow not %eof;
005500161228
005600170418        s = %subst(%editc(mcssno:'X'):1:3);
005700170418        if s <> '888';
005800170418
005900161228        if enrldt <> candt;
006000161222
006100160524        // Create file with new groups...
006200161227        chain (mctrst : mcsub# : acc# : mcplan) everFile;
006300161222        if %found;
006400161222         exsr moveFields;
006500161222         exsr writeFile;
006600161222        endif;
006700160524
006800161228        endif;
006900161228
007000170418        endif;
007100170418
007200161222        read memcovFile;
007300161222        enddo;
007400161222
007500160511       endsr;
007600160520
007700161222      //===================================================================
007800161222      // move fileds
007900161222      //===================================================================
008000161222
008100161222       begsr moveFields;
008200161222
008300170418       fmtDate = %date(enrldt:*iso);
008400170418       orgdate = %char(FmtDate);
008500161222
008600161222       chain (mcssno) memberFile;
008700161222       if %found;
008800161222        ssn# = %editc(mcssno:'X');
008900161222         lname = mlname;
009000161222        fname = mfname;
009100161222       endif;
009200161222
009300161222       chain (mcssno : 'EV') altFile;
009400161222       if %found;
009500170418
009600170418         $pos = %scan('EV':maaltid:1);
009700170418          if $pos = 1;
009800170418           maaltid9 = maaltid;
009900170418           altid = maaltid9;
010000170418          else;
010100170418           altid = maaltid;
010200170418          endif;
010300170418
010400161222       endif;
010500161222
010600170418       chain (mctrst : mcsub# : acc#) acctFile;
010700170418       if %found;
010800170418        cname = acnam1;
010900170418       endif;
011000170418
011100161222       endsr;
011200161222
011300161222      //===================================================================
011400161222      // write file;
011500161222      //===================================================================
011600161222
011700161222       begsr writeFile;
011800161222
011900161227       chain (%editc(mcssno:'X')) reconFile;
012000161222       if not %found;
012100170417        exsr getGroup;
012200161222        write reconFile;
012300161227       endif;
012400161227
012500161227       if %found;
012600161227        if orgdate > %char(enrldt);
012700170418         fmtDate = %date(enrldt:*iso);
012800170418          orgdate = %char(fmtDate);
012900170417          exsr getGroup;
013000161227         update reconFile;
013100161227        endif;
013200161222       endif;
013300161222
013400161222       endsr;
013500170417
013600170417      //===================================================================
013700170417      // Get group #
013800170417      //===================================================================
013900161222
014000170417       begsr getGroup;
014100170417
014200170417       group = ' ';
014300170417
014400170417       setll (mctrst : mcsub# : mcplan : mcageb : mcovtp) groupFile;
014500170417       reade (mctrst : mcsub# : mcplan : mcageb : mcovtp) groupFile;
014600170417
014700170417       dow not %eof;
014800170417       if (enrldt >= frmdat) and (enrldt <= todat);
014900170417        group = group#;
015000170417        leavesr;
015100170417       endif;
015200170417
015300170417       reade (mctrst : mcsub# : mcplan : mcageb : mcovtp) groupFile;
015400170417       enddo;
015500170417
015600170417       endsr;
015700170417
015800160511      //===================================================================
015900160511      // exit
016000160511      //===================================================================
016100160511
016200160511       begsr exit;
016300160511
016400160511        *inlr = '1';
016500160511        return;
016600160511
016700160511       endsr;
016800160511
016900160511      //===================================================================
017000160511      // init
017100160511      //===================================================================
017200160511
017300160511       begsr init;
017400160520
017500160511       endsr;
017600010412
017700160511       //==============================================================
