000100160513      *===========================================================================
000200160512     H option(*noDebugIo)
000300160513      *===========================================================================
000400020523      *
000500160513      *             GROUP BENIFIT SERVICES SOFTWARE
000600160513      *
000700160513      *  Written by:   J. Torres
000800160513      *  Date Written: 05/12/16
000900160524      *  Description:  Generate XLS files for EyeMed
001000160524      *                (Old groups are hardcoded because they will not change,
001100160524      *                 all other groups moving forward go under new groups).
001200160513      *
001300160513      *===========================================================================
001400160520
001500170103     Freconevl1 if   e           k disk    rename(reconevr:everFile)
001600161222
001700170103     Frecon2    uf a e           k disk    rename(reconr:reconFile)
001800160523
001900170103     Fdcov22    if   e           k disk    rename(dcovr:depcovFile)
002000150820
002100170103     Fdepndc    if   e           k disk    rename(depenr:depmemFile)
002200161222
002300161222     Fmemalt    if   e           k disk    rename(memaltr:altFile)
002400161222
002500170418     Fgrate     if   e           k disk    rename(grater:groupFile)
002600170418
002700170418     Faccmst    if   e           k disk    rename(accmsr:acctFile)
002800170418
002900170418     Fmember    if   e           k disk    rename(membr:memberFile)
003000170418
003100161228      //==================================================================
003200161228
003300170418     D fmtDate         s               d   datfmt(*usa)
003400170418     D group           s             15
003500170418     D $pos            S              2  0
003600170418     D maaltid9        s              9
003700170418     D s               s              3
003800161228
003900160511      //==================================================================
004000160511      // mainline
004100160511      //===================================================================
004200150820
004300160511       exsr init;
004400160511       exsr main;
004500160511       exsr exit;
004600160511
004700160511      //===================================================================
004800160511      // main
004900160511      //===================================================================
005000160511
005100160511       begsr main;
005200160511
005300170103        setll *loval depcovFile;
005400170103        read depcovFile;
005500161222
005600161222        dow not %eof;
005700170103
005800170418        s = %subst(%editc(ssno:'X'):1:3);
005900170418        if s <> '888';
006000170418
006100170103        if denrdt <> ccandt;
006200161222
006300160524        // Create file with new groups...
006400170103        chain (dvtrst : dvsub# : dvplan) everFile;
006500161222        if %found;
006600161222         exsr moveFields;
006700161222         exsr writeFile;
006800161222        endif;
006900160524
007000161228        endif;
007100161228
007200170418        endif;
007300170418
007400170103        read depcovFile;
007500161222        enddo;
007600161222
007700160511       endsr;
007800160520
007900161222      //===================================================================
008000161222      // move fileds
008100161222      //===================================================================
008200161222
008300170103       begsr moveFields;
008400170103
008500170418       fmtDate = %date(denrdt:*iso);
008600170418       orgdate = %char(fmtDate);
008700161222
008800170103       chain (ssno : dseq#) depmemFile;
008900161222       if %found;
009000170418        ssn# = %editc(ssno:'X');
009100170103         lname = dlname;
009200170103        fname = dfname;
009300161222       endif;
009400161222
009500170103       chain (dssno : 'EV') altFile;
009600161222       if %found;
009700170418
009800170418         $pos = %scan('EV':maaltid:1);
009900170418          if $pos = 1;
010000170418           maaltid9 = maaltid;
010100170418           altid = maaltid9;
010200170418          else;
010300170418           altid = maaltid;
010400170418          endif;
010500170418
010600161222       endif;
010700161222
010800170418       chain ssno memberFile;
010900170418       if %found;
011000170418
011100170418        chain (mbtrst : mbsub# : mbacct) acctFile;
011200170418        if %found;
011300170418         cname = acnam1;
011400170418        endif;
011500170418
011600170418       endif;
011700170418
011800161222       endsr;
011900161222
012000161222      //===================================================================
012100161222      // write file;
012200161222      //===================================================================
012300161222
012400161222       begsr writeFile;
012500161222
012600170418       chain (%editc(ssno:'X') : dseq#) reconFile;
012700170103       if not %found;
012800170103        seq# = dseq#;
012900170418        exsr getGroup;
013000170103        write reconFile;
013100170103       endif;
013200161227
013300161227       if %found;
013400170103        if orgdate > %char(denrdt);
013500170418         fmtDate = %date(denrdt:*iso);
013600170418          orgdate = %char(fmtDate);
013700170418          exsr getGroup;
013800170103         update reconFile;
013900161227        endif;
014000161222       endif;
014100161222
014200161222       endsr;
014300161222
014400170418      //===================================================================
014500170418      // Get group #
014600170418      //===================================================================
014700170418
014800170418       begsr getGroup;
014900170418
015000170418       group = ' ';
015100170418
015200170418       setll (dvtrst : dvsub# : dvplan : 00) groupFile;
015300170418       reade (dvtrst : dvsub# : dvplan : 00) groupFile;
015400170418
015500170418       dow not %eof;
015600170418       if (denrdt >= frmdat) and (denrdt <= todat);
015700170418        group = group#;
015800170418        leavesr;
015900170418       endif;
016000170418
016100170418       reade (dvtrst : dvsub# : dvplan : 00) groupFile;
016200170418       enddo;
016300170418
016400170418       endsr;
016500170418
016600160511      //===================================================================
016700160511      // exit
016800160511      //===================================================================
016900160511
017000160511       begsr exit;
017100160511
017200160511        *inlr = '1';
017300160511        return;
017400160511
017500160511       endsr;
017600160511
017700160511      //===================================================================
017800160511      // init
017900160511      //===================================================================
018000160511
018100160511       begsr init;
018200160520
018300160511       endsr;
018400010412
018500160511       //==============================================================
