000100160513      *===========================================================================
000200160512     H option(*noDebugIo)
000300160513      *===========================================================================
000400020523      *
000500160513      *             GROUP BENIFIT SERVICES SOFTWARE
000600160513      *
000700160513      *  Written by:   J. Torres
000800160513      *  Date Written: 05/12/16
000900160524      *  Description:  Generate XLS files for EyeMed
001000160524      *                (Old groups are hardcoded because they will not change,
001100160524      *                 all other groups moving forward go under new groups).
001200160513      *
001300160513      *===========================================================================
001400160520
001500170103     Freconevl1 if   e           k disk    rename(reconevr:everFile)
001600161222
001700170103     Frecon2    uf a e           k disk    rename(reconr:reconFile)
001800170103     F*recon     uf a e           k disk    rename(reconr:reconFile)
001900160523
002000170103     Fdcov22    if   e           k disk    rename(dcovr:depcovFile)
002100150820
002200170103     Fdepndc    if   e           k disk    rename(depenr:depmemFile)
002300161222
002400161222     Fmemalt    if   e           k disk    rename(memaltr:altFile)
002500161222
002600161228      //==================================================================
002700161228
002800161228     D effdate         s               d   datfmt(*usa)
002900161228
003000160511      //==================================================================
003100160511      // mainline
003200160511      //===================================================================
003300150820
003400160511       exsr init;
003500160511       exsr main;
003600160511       exsr exit;
003700160511
003800160511      //===================================================================
003900160511      // main
004000160511      //===================================================================
004100160511
004200160511       begsr main;
004300160511
004400170103        setll *loval depcovFile;
004500170103        read depcovFile;
004600161222
004700161222        dow not %eof;
004800170103
004900170103        if denrdt <> ccandt;
005000161222
005100160524        // Create file with new groups...
005200170103        chain (dvtrst : dvsub# : dvplan) everFile;
005300161222        if %found;
005400161222         exsr moveFields;
005500161222         exsr writeFile;
005600161222        endif;
005700160524
005800161228        endif;
005900161228
006000170103        read depcovFile;
006100161222        enddo;
006200161222
006300160511       endsr;
006400160520
006500161222      //===================================================================
006600161222      // move fileds
006700161222      //===================================================================
006800161222
006900170103       begsr moveFields;
007000170103
007100170103       effdate = %date(denrdt:*iso);
007200161228       orgdate = %char(effdate);
007300161222
007400170103       chain (ssno : dseq#) depmemFile;
007500161222       if %found;
007600170103        ssn# = %editc(dssno:'X');
007700170103         lname = dlname;
007800170103        fname = dfname;
007900161222       endif;
008000161222
008100170103       chain (dssno : 'EV') altFile;
008200161222       if %found;
008300161222        altid = maaltid;
008400161222       endif;
008500161222
008600161222       endsr;
008700161222
008800161222      //===================================================================
008900161222      // write file;
009000161222      //===================================================================
009100161222
009200161222       begsr writeFile;
009300161222
009400170103       chain (%editc(ssno:'X') : dseq#) reconFile;
009500170103       if not %found;
009600170103        seq# = dseq#;
009700170103        write reconFile;
009800170103       endif;
009900161227
010000161227       if %found;
010100170103        if orgdate > %char(denrdt);
010200170103         effdate = %date(denrdt:*iso);
010300161228          orgdate = %char(effdate);
010400170103         update reconFile;
010500161227        endif;
010600161222       endif;
010700161222
010800161222       endsr;
010900161222
011000160511      //===================================================================
011100160511      // exit
011200160511      //===================================================================
011300160511
011400160511       begsr exit;
011500160511
011600160511        *inlr = '1';
011700160511        return;
011800160511
011900160511       endsr;
012000160511
012100160511      //===================================================================
012200160511      // init
012300160511      //===================================================================
012400160511
012500160511       begsr init;
012600160520
012700160511       endsr;
012800010412
012900160511       //==============================================================
