000100000000      ******************************************************************
000200000000      *                                                                *
000300000414      *  RP070      GROUP BENEFIT SERVICES SOFTWARE           1989     *
000400000000      *                                                                *
000500000000      *            WRITTEN  BY - DAVID V. GOBEL                        *
000600000000      *            DATE - 03/89                                        *
000700000000      *                                                                *
000800000000      *  DESCRIPTION - THIS PROGRAM WILL PRODUCE A MEMBERSHIP LISTING  *
000900000000      *                BY ACCOUNT# & NAME.                             *
001000000000      *                                                                *
001001050927      * 09/27/05 DLK - convert to rpgle                                *
001002050927      *                                                                *
001600000000      ******************************************************************
001700000000     F***                                                              *
001800050927JGE01FMEMBER    IP   F  648        DISK
001900050927JGE01FACCMST    IF   F  560    10AIDISK    KEYLOC(1)
002000050927JGE01FTRSMST    IF   F  264     3AIDISK    KEYLOC(1)
002100050927     FREPORT    O    F  132        PRINTER OFLIND(*INOF)
002200000000     F                                     FORMLEN(88)
002300000000     F                                     FORMOFL(78)
002500000000     D TAB1            S              2  0 DIM(12) CTDATA PERRCD(1)             MONTH NAME TABLE
002600000000     D TAB2            S             10    DIM(12) ALT(TAB1)
002700000000     D***
002800000000     D/SPACE
002900000000     D***
003000000000     D                UDS
003100000000     D  TIME                 242    247  0                                      COMPNY
003200000000     D  CONAME               201    240
003300000000JGE01D  LD8YMD               248    255  0
003400000000JGE01D  LD8YY                248    251  0
003500000000     IMEMBER    NS  01
003600000000     I*  MEMBER MASTER FILE
003700000000     I                                  1    9 0SSNO
003800000000     I                                 10   27  LNAME
003900000000     I                                 28   39  FNAME
004000000000     I                                 40   40  MI
004100000000     I                                101  115  CITY
004200000000     I                                116  117  STATE
004300000000     I                                129  129  SEX
004400050927     I                                136  145 0ACKEY
004500000000     I                                136  138 0TRUST         L2
004600050927     I                                139  141 0SUBNO         L1
004700050927     I                                142  145 0ACCNO         L1
004800981120JGE01I                                512  520 0BIRTH
004900981120JGE01I                                517  518 0BMO
005000981120JGE01I                                513  516 0BYR
005200000000     IACCMST    NS
005500000000     I                                 11   30  ACNAME
005700000000     ITRSMST    NS
005900000000     I                                  4   23  TNAME
007900050927
007901050927     c                   if        *inl2
008200050927     C     TRUST         CHAIN     TRSMST                             H1
008202050927     c                   end
008300050927
008501050927     c                   if        *inl1
008600050927     C     ACKEY         CHAIN     ACCMST                             H2
008601050927     c                   except    head
008602050927     c                   end
008700050927
008800000000     C*  COUNT MEMBERS
009000000000     C                   ADD       1             COUNT
009001050927
009400000000     C                   EXSR      #NAME
009801050927JGE01C                   Z-ADD     BIRTH         @DATIN            8 0
009802050927JGE01C                   EXSR      #DATYM
009803050927JGE01C                   Z-ADD     @DATOU        PBIRTH            8 0
009804050927
009805050927     c                   except    prt
010002050927
010600050927     C******************************
010700000000     C*   FIELD= LAST, FIRST MI.
010800000000     C*----------------- COMPRESS NAME FIELDS ---------------------*
010900000000     C***
011000000000     C     #NAME         BEGSR
011001050927
011002050927     C                   clear                   N                34
011003050927     C                   MOVEL     lname         N
011004050927     C                   CAT       ',':0         N
011005050927     C                   CAT       fname:1       N
011006050927     C                   if        mi <> ' '
011007050927     C                   CAT       mi:1          N
011008050927     C                   CAT       '.':0         N
011009050927     C                   END
011010050927
015200000000     C                   ENDSR
016400000000JGE01C***
016500000000JGE01C*****************************************************
016600000000JGE01C*   CONVERT FIELD FROM YYYYMMDD TO MMDDYYYY         *
016700000000JGE01C*****************************************************
016800000000JGE01C***
016900000000JGE01C* DATE IN  = @DATIN (8.0) YYYYMMDD
017000000000JGE01C* DATE OUT = @DATOU (8.0) MMDDYYYY
017100000000JGE01C***
017200000000JGE01C     #DATYM        BEGSR
017300000000JGE01C                   MOVE      @DATIN        @MD               4 0
017400000000JGE01C                   MOVEL     @DATIN        @Y                4 0
017500000000JGE01C                   MOVEL     @MD           @DATOU            8 0
017600000000JGE01C                   MOVE      @Y            @DATOU
017700000000JGE01C                   MOVE      *ZEROS        @DATIN            8 0
017800000000JGE01C                   ENDSR
017900000000     C***
017902050927JGE01C     *inzsr        BEGSR
017903050927     C***
017906050927     C     UMONTH        LOOKUP    TAB1          TAB2                     10
017908050927     C                   Z-ADD     0             COUNT             7 0
017910050927JGE01C                   ENDSR
017911050927     O***
018100000000     O/EJECT
018200000000     O******************************************************
018300000000     O*  OUTPUT SPECIFICATIONS                             *
018400000000     O******************************************************
018500000000     O***
018501050927     OREPORT    e            head           2 03
018800000000     O                                           45 '*****'
018900000000     O                       CONAME              85
019000000000     O                                           91 '*****'
019100000000     O***
019101050927     O          e            head           1
019400000000     O                                           63 'For :'
019500000000     O                       TAB2                75
019800000000     O                       LD8YY               81
019900000000     O***
019901050927     O          e            head           1
020200000000     O                                           66 '   M E M B E R S H I P  '
020300000000     O                                           87 '  L I S T I N G      '
020400000000     O***
020401050927     O          e            head           1
020700000000     O                                           24 'PROGRAM NAME: RP070'
020800000000     O                                          125 'PAGE:'
020900000000     O                       PAGE          Z    131
021000000000     O***
021001050927     O          e            head           1
021300000000     O                                           14 'RUN DATE:'
021400000000     O                       UDATE         Y     25
021500000000     O                                          122 'TIME:'
021600000000     O                       TIME               132 '  :  :  '
021700000000     O***
021701050927     O          e            head           1
022000000000     O                                           24 '""""""""""""""""""""""""'
022100000000     O                                           48 '""""""""""""""""""""""""'
022200000000     O                                           72 '""""""""""""""""""""""""'
022300000000     O                                           96 '""""""""""""""""""""""""'
022400000000     O                                          120 '""""""""""""""""""""""""'
022500000000     O                                          132 '""""""""""""'
022600000000     O***
022601050927     O          e            head           1
022900000000     O                                           10 'MEMBER'
023000000000     O                                           30 'MEMBER'
023100000000     O                                           60 'BIRTH'
023200000000     O***
023201050927     O          e            head           1
023500000000     O                                           12 'SOC.SEC.#'
023600000000     O                                           29 'NAME'
023700000000     O                                           60 'DATE'
023800000000     O                                           66 'SEX'
023900000000     O                                           74 'CITY'
024000000000     O                                           90 'ST'
024100000000     O                                          104 'ACCT #'
024200000000     O                                          121 'ACCT NAME'
024300000000     O***
024301050927     O          e            head           1
024600000000     O                                           24 '""""""""""""""""""""""""'
024700000000     O                                           48 '""""""""""""""""""""""""'
024800000000     O                                           72 '""""""""""""""""""""""""'
024900000000     O                                           96 '""""""""""""""""""""""""'
025000000000     O                                          120 '""""""""""""""""""""""""'
025100000000     O                                          132 '""""""""""""'
025200000000     O***
025201050927     O          e            head        1  2
025500000000     O                                            7 'TRUST -'
025600000000     O                       TNAME               28
025700000000     O***
025701050927     O          e            prt            1
025900050927     O                       SSNO                12 '0   -  -    '
026000000000     O                       N                   52
026200981120JGE01O                       PBIRTH              62 '0 /  /    '
026300000000     O                       SEX                 65
026400000000     O                       CITY                85
026500000000     O                       STATE               90
026600000000     O                       ACKEY              110 '   -   -    -'
026700000000     O                       ACNAME             132
026800000000     O***
026900000000     O          T    L2                  2  1
027000000000     O                                           50 'TOTAL MEMBERS IN TRUST:'
027100000000     O                       COUNT         ZB    58
027200000000** MONTH NAME TABLE
02730000000001January
02740000000002February
02750000000003March
02760000000004April
02770000000005May
02780000000006June
02790000000007July
02800000000008August
02810000000009September
02820000000010October
02830000000011November
02840000000012December
