000100190729      *====================================================================
000200190729     h dftactgrp(*no) option(*noDebugIo) bnddir('GBSBIND')
000300190729      *====================================================================
000400200909      * RP182BR - Cancelled accounts by trans date range
000500190729      *====================================================================
000600190729      * Date         Int  Description
000700200909      * ----------   ---  -------------------------------------------------
000800200909      * 09/09/2020   jt   Original Creation
000801220427      * 04/17/2022   jt   Recompiled for DSPF change
000900190729      *====================================================================
001000190729
001100200909     frp182bd   cf   e             WorkStn Handler('PROFOUNDUI(HANDLER)')
001200200814
001300190729      //========================================================================
001400190729
001500190729     d psds           sds
001600190729     d proc_name         *proc
001601220427     d  jobName              244    253
001602220427     d  userName             254    263
001603220427     d  jobNumber            264    269
001700190729
001702190730     d valid           s              1
001703220427
001707220427     d userInSc        s             20    dtaara('USERIN')
001708220427
001713200909     d createRpt       pr                  ExtPgm('RP182CCL')
001714200814     d  fromDate                       d   const
001715200814     d  toDate                         d   const
001716200814     d  strust                        3    const
001717200909     d  termCode                      2    const
001735200814
002000190729      //========================================================================
002100200820       // mainline
002200190729      //========================================================================
002300190729
002400190729       exsr init;
002500190729       exsr main;
002600190729       exsr exit;
002700190729
002800190729      //========================================================================
002900200820       // main
003000190729      //========================================================================
003100190729
003200190729       begsr main;
003300190729
003400200821        dow btnExit = '0';
003500190729
003600200821         exfmt screen1;
003601190730
003602200821         exsr checkButton;
003700190729
003800200821        enddo;
003900190729
004000190729       endsr;
004100190729
004101200820       //===================================================================
004102200820       // check button pressed
004103200820       //===================================================================
004104190730
004105190730       begsr checkButton;
004106190730
004107200821        if btnEnter = '1';
004108200821         exsr validate;
004109190730
004110200821         if valid = 'Y';
004111200909          createRpt(fromDate : toDate : strust : termCode);
004116200821          exfmt msgWindow;
004118200821          btnExit = '1';
004119200821         endif;
004120190730
004124200821        endif;
004125190730
004126220427        in *lock UserInSc;
004127220427        UserInSc = ' ';
004128220427        out UserInSc;
004129220427
004130190730       endsr;
004131190730
004132200820       //===================================================================
004133200820       // validate
004134200820       //===================================================================
004135190730
004136190730       begsr validate;
004137200820
004138200821        valid = 'N';
004139200821        errDate = '0';
004140200821        errDate2 = '0';
004141200821        errDate3 = '0';
004142190730
004143200821        if fromDate = d'0001-01-01';
004144200821         errDate = '1';
004145200821         leavesr;
004146200821        endif;
004147190730
004148200821        if fromDate > toDate;
004149200821         errDate3 = '1';
004150200821         leavesr;
004151200821        endif;
004152190730
004153200821        if toDate = d'0001-01-01';
004154200821         errDate2 = '1';
004155200821         leavesr;
004156200821        endif;
004157200814
004172200821        valid = 'Y';
004174190730
004175190730       endsr;
004176190730
004205190729      //========================================================================
004300200820       // exit
004400190729      //========================================================================
004500190729
004600190729       begsr exit;
004700190729
004800200821        *inlr = '1';
004900200821        return;
005000190729
005100190729       endsr;
005200190729
005300190729      //========================================================================
005400200820       // init
005500190729      //========================================================================
005600190729
005700190729       begsr init;
005800190729
006100200821        pgmname = proc_name;
006200190729
006201200821        btnExit = '0';
006206200821        fromDate = d'0001-01-01';
006207200909        toDate = %date();
006215200821        strust = 'ALL';
006216220427
006217220427         in *lock UserInSc;
006218220427
006222220427         if UserInSc > ' ';
006223220427          exfmt msgWindow2;
006224220427          exsr exit;
006225220427         endif;
006226220427
006228220427         UserInSc = userName;
006229220427         out UserInSc;
006231190730
006300190729       endsr;
006400190729
006540200814      //========================================================================
