000100910801     H DFTNAME(RP400)
0002009102150002 F******************************************************************
0003000004140003 F* RP360      GROUP BENEFIT SERVICES SOFTWARE           1990      *
0004009102150004 F*                                                                *
0005009102150005 F*            WRITTEN  BY - WALTER J. PICCININI                   *
0006009108010006 F*            DATE - 08/91                                        *
0007009102150007 F*                                                                *
0008009108010008 F*  DESCRIPTION - THIS PROGRAM WILL PRODUCE A  ACCOUNT MASTER     *
0009009108010009 F*                REPORT . SORTED BY COUNTY/ZIP CODE/ACCT #       *
0010009102150010 F*                                                                *
0011009102150011 F******************************************************************
0012009102150012 F*                                                                *
001300010312  13 FRP401WF   IP   F   77        DISK
0014000103060015 FREPORT    O    F  132        PRINTER OFLIND(*INOF)
0015009102150016 I*
0016000103120021 IRP401WF   NS  01
0017009108010022 I                                  1   10 0TRSBAC
0018009108010023 I                                 11   50  ACNAM1
0019000103060024 I                             P   51   55 0ZIP           L1
0020000103060025 I                                 56   62 0NOEMPL
0021000103060026 I                                 63   64  COUNTY        L2
0022000103060026 I                                 65   65  GBSBRK        L3
0023000103060026 I                                 66   74 2APREMI
0024000103060026 I                                 75   77  SMANCD
0025009102150511  ****************************************************************
0026009108010055 C     FCYCLE        IFEQ      *BLANKS
0027009108010056 C                   TIME                    HTIME             6 0
0028009108010057 C                   EXCEPT    HEAD
0029009108010058 C                   MOVE      'Y'           FCYCLE            1
0030009108010059 C                   END
003100910802     C*
003200910805     C   L3GBSBRK        IFEQ      'G'
003300910805     C                   MOVE      'GBS   '      DDESC             6
003400910802     C                   ELSE
003500910805     C                   MOVE      'BROKER'      DDESC
003600910802     C                   END
003700910802     C*
003800910802     C   OF              SETON                                        88
003900910801     C   OF              EXCEPT    HEAD
0040009108020060 C   88
004100910801     COR L2              EXCEPT    L2HEAD
004200910802     C   88              SETOFF                                       88
004300010306     C                   ADD       NOEMPL        L1TEMP            9 0
004400010306     C                   ADD       NOEMPL        L2TEMP            9 0
004500010306     C                   ADD       NOEMPL        L3TEMP            9 0
0046009108010060 C*
004700950714     C                   ADD       1             L1CNT             9 0
004800950714     C                   ADD       1             L2CNT             9 0
004900950714     C                   ADD       1             L3CNT             9 0
005000910801     C*
0051009507130060 C*
005200950714     C                   ADD       APREMI        L1PREM            9 2
005300950714     C                   ADD       APREMI        L2PREM            9 2
005400950714     C                   ADD       APREMI        L3PREM            9 2
005500950713     C*
005600910801     C                   EXCEPT    PRINT
005700910801     C*
005800910801     CL1                 EXCEPT    L1TOT
005900910801     C*
006000910801     CL2                 EXCEPT    L2TOT
006100910801     C*
006200910802     CL3                 EXCEPT    L3TOT
0063009108050171 OREPORT    E            HEAD           1 03
0064009102150172 O                                            8 'PROGRAM:'
0065009108010173 O                                           14 'RP400'
0066009108050174 O                                           69 'ZIP CODE REPORT  (BROKER'
0067009108050175 O                                           86 '/GBS    BUSINESS)'
0068009102150176 O                                          115 'PAGE:'
0069009102150177 O                       PAGE          Z    123
0070009108020178 O          E            HEAD           3
0071009102150179 O                                            8 'DATE   :'
0072009102150180 O                       UDATE         Y     16
0073009102150181 O                                          115 'TIME:'
0074009102150182 O                       HTIME              123 '  :  : 0'
0075009102150190 O          E            HEAD           1
0076009108020191 O                                           14 'ZIP CODE'
0077009108010192 O                                           30 'ACCOUNT #'
0078009507140192 O                                           38 'BROKER'
0079009108020193 O                                           62 'ACCOUNT NAME'
0080009108020195 O                                          110 '# OF EMPLOYEES'
0081009507140195 O                                          130 'LAST PREMIUM'
0082009102150198 O          E            HEAD           2
0083009102150199 O                                           24 '------------------------'
0084009102150200 O                                           48 '------------------------'
0085009102150201 O                                           72 '------------------------'
0086009102150202 O                                           96 '------------------------'
0087009102150202 O                                          120 '------------------------'
008800950714     O                                          132 '------------'
0089009108020203 O          E            L2HEAD         0
009000910801     O                                           12 'COUNTY CODE-'
009100910801     O                       COUNTY              16
009200910802     O                                           21 '('
009300910802     O                       DDESC               28
009400910802     O                                           30 ')'
0095009108010203 O          E            L2HEAD      0  0
009600910801     O                                           12 'COUNTY CODE-'
009700910801     O                       COUNTY              16
009800910802     O                                           21 '('
009900910802     O                       DDESC               28
010000910802     O                                           30 ')'
0101009108020203 O          E            L2HEAD      0  3
010200910801     O                                           12 'COUNTY CODE-'
010300910801     O                       COUNTY              16
010400910802     O                                           21 '('
010500910802     O                       DDESC               28
010600910802     O                                           30 ')'
0107009108010203 O          E            PRINT          1
0108009108010204 O               L1      ZIP                 12
0109009108010205 O                       TRSBAC              30 '   -   -   0'
011000010306     O                       SMANCD              35
011100910801     O                       ACNAM1              90
0112000103060206 O                       NOEMPL        K    110
0113009507130206 O                       APREMI        J    130
0114009108010203 O          E            L1TOT          2
011500910801     O                                           77 '*TOTALS FOR ZIP CODE--->'
0116009108010204 O                       L1TEMP        KB   110
0117009108010205 O                       L1CNT         KB    90
0118009507130205 O                       L1PREM        JB   130
0119009108050203 O          E            L2TOT          2
012000910805     O                                           77 '**TOTALS FOR COUNTY---->'
0121009108020204 O                       L2TEMP        KB   110
0122009108020205 O                       L2CNT         KB    90
0123009507130205 O                       L2PREM        JB   130
0124009108050203 O          E            L3TOT          2
012500910802     O                                           77 '***FINAL        TOTALS->'
012600910802     O                       DDESC               68
0127009108020204 O                       L3TEMP        KB   110
0128009108020205 O                       L3CNT         KB    90
0129009507130205 O                       L3PREM        JB   130
