000100911112     H DFTNAME(RP420)
0002009102150002 F******************************************************************
0003000004140003 F* RP420      GROUP BENEFIT SERVICES SOFTWARE           1991      *
0004009102150004 F*                                                                *
0005009102150005 F*            WRITTEN BY - DAVID KETTERMAN                        *
0006009111120006 F*            DATE - 11/12/91                                     *
0007009102150007 F*                                                                *
0008009111120008 F*  DESCRIPTION - THIS PROGRAM PRODUCES A PLAN CHANGE REPORT.     *
0009009102150011 F*                                                                *
0010009811190010 F*  Y2K CONVERT - 1998                                            *
0011000201210012 F* 01/18/02 dlk - add mass plan term report, email option and     *
0011030201210012 F*                convert to external files                       *
0011040201210012 F*                                                                *
0012009102150013 F******************************************************************
0013000201210016 FHIST      Ip   e             DISK
0014000201210017 FACCMST    IF   e           k DISK
0015000201210018 FSMAN      IF   e           k DISK
0016000201210014 FPLNMST    IF   e           k DISK
0017000103050019 FREPORT    O    F  198        PRINTER OFLIND(*INOF)
0018000103050019 FREPORT2   O    F  132        PRINTER OFLIND(*INOE)
0018030201210055 D                 DS
0018040201210056 D  BAL                    1    108  2
001805020121     D                                     DIM(12)
0018060201210056 D  BAL1                   1      9  2
0018070201210056 D  BAL2                  10     18  2
0018080201210056 D  BAL3                  19     27  2
0018090201210056 D  BAL4                  28     36  2
0018100201210056 D  BAL5                  37     45  2
0018110201210056 D  BAL6                  46     54  2
0018120201210056 D  BAL7                  55     63  2
0018130201210056 D  BAL8                  64     72  2
0018140201210056 D  BAL9                  73     81  2
0018150201210056 D  BAL10                 82     90  2
0018160201210056 D  BAL11                 91     99  2
0018170201210056 D  BAL12                100    108  2
0018180201210055 D                 DS
0018190201210056 D  ck#not                26     55
0018200201210056 D  frpln                 43     46
0018210201210056 D  topln                 51     54
0018220201210056 D  termcode              54     55
001823020121
0018240201210056 D  note2                 56     85
0018250201210056 D  nomem                 60     65  0
0018260201210056 D  memtrm                79     85
0018270201210055 D                 DS
0018280201210056 D  hkey                   1     10
0018290201210056 D  h1                     1      3
0018300201210056 D  h2                     4      6
0018310201210056 D  h3                     7     10
0025009111210053 D                UDS
002600911108     D  LTRST                 13     15
002700911108     D  LSUB                  16     18
002800911108     D  LACC                  19     22
002900981119     D  FRMDT                 23     30  0
003000981119     D  TODT                  31     38  0
003001020118     D  Lterm                 39     40
0031009102150054 D  CONAME               201    240
0032009102150055 D  TIME                 242    247  0
003201020121     Ihistr
0036000201210080 I                                          TRCODE        l1
005601020121     c     plnkey        klist
005602020121     c                   kfld                    hstrst
005603020121     c                   kfld                    hssub#
005604020121     c                   kfld                    pln
005605020121     c     acckey        klist
005606020121     c                   kfld                    hstrst
005607020121     c                   kfld                    hssub#
005608020121     c                   kfld                    hsacct
005609020121
006201020118     c                   if        *inl1
006205020118     c                   if        trcode = 'UPC'
006206020118     c                   except    headpc
006207020118     c                   else
006208020118     c                   except    headpt
006209020118     c                   end
006211020118     c                   end
006300911112     C*
006400911113     C* GET ACCOUNT INFO AND HANDEL ERRORS
006500911112     C*
0066000201220065 C     acckey        CHAIN     ACCMST
006601020122     c                   if        not %found(accmst)
006700020122     C     FIRSTE        IFNE      'Y'
006800911111     C                   EXCEPT    ERRHED
006900911111     C                   MOVE      'Y'           FIRSTE            1
007000911111     C                   END
007100020122     C                   EXCEPT    ERR1
007200020122     C                   GOTO      #end
007201020122     c                   end
007202020122
007400911112     C                   XFOOT     BAL           TOTBAL           11 2
007500911111     C*
007600020122     C     SMANCD        CHAIN     SMAN
007601020122     c                   if        not %found(sman)
007700020122     C     FIRSTE        IFNE      'Y'
007800911111     C                   EXCEPT    ERRHED
007900911111     C                   MOVE      'Y'           FIRSTE
008000911111     C                   END
008100020122     C                   EXCEPT    ERR2
008101020122     c                   end
008200020122
008500981119     C                   MOVE      TRDATE        @DATIN
008600981119     C                   EXSR      #DATYM
008700981119     C                   MOVE      @DATOU        TRDMDY            8 0
008800981119     C*
008900981119     C                   MOVE      COVTDT        @DATIN
009000981119     C                   EXSR      #DATYM
009100981119     C                   MOVE      @DATOU        COVMDY            8 0
009200981119     C*
0093009111120235 C*                                                                   SR#NAM
0094009111210235 C* GET PLAN DESCRPITION FOR OLD AND NEW PLAN                         SR#NAM
0095009111210235 C*                                                                   SR#NAM
009502020118
009600020121     C                   MOVE      FRPLN         PLN               4
009700911121     C     PLNKEY        CHAIN     PLNMST                             97
009800020121     C  N97              MOVEl     PDESCR        FRDSC            25
0099009111210235 C*                                                                   SR#NAM
009901020118     c                   clear                   todsc
009902020118     c                   clear                   toplno            4
009903020121
009904020118     c                   if        trcode = 'UPC'
010000911121     C                   MOVE      TOPLN         PLN
010001020118     C                   MOVE      TOPLN         toplno
010100911121     C     PLNKEY        CHAIN     PLNMST                             97
010200020121     C  N97              MOVEl     PDESCR        TODSC            25
010201020118     c                   end
0103009111210235 C*                                                                   SR#NAM
010301020118     c                   if        *inof
010303020118     c                   if        trcode = 'UPC'
010304020118     c                   except    headpc
010305020118     c                   else
010306020118     c                   except    headpt
010307020118     c                   end
010308020118     c                   end
0104000201180233
010401020118     c                   add       nomem         totmem            6 0
010402020118
010403020118     c                   if        trcode = 'UPC'
010404020118     c                   except    linepc
010405020118     c                   else
010406020118     c                   except    linept
010407020118     c                   end
010408020118
0106009111110234 C     #END          TAG
0107009811190107 C*
010702020118     cl1                 except    l1tot
010703020118     cl1                 clear                   totmem
0108009811190103 C***************************************************
0109009811190104 C* CONVERT FIELD FROM YYYYMMDD TO MMDDYYYY         *
0110009811190105 C***************************************************
0111009811190107 C*
0112009811190107 C* DATE IN  = @DATIN (8.0) YYYYMMDD
0113009811190107 C* DATE OUT = @DATOU (8.0) MMDDYYYY
0114009811190107 C*
0115009811190106 C     #DATYM        BEGSR
011600981119     C                   MOVE      @DATIN        @MD               4 0
011700981119     C                   MOVEL     @DATIN        @Y                4 0
011800981119     C                   MOVEL     @MD           @DATOU            8 0
011900981119     C                   MOVE      @Y            @DATOU
012000981119     C                   MOVE      *ZEROS        @DATIN            8 0
0121009811190120 C                   ENDSR
012102020121
012103020121     o* plan change report headings
012104020121
0122000201210237 OREPORT    e            headpc         2 03
0124009111110125 O                                           77 '***'
0125009111110126 O                       CONAME             117
0126009111110127 O                                          120 '***'
0127000201210242 O          e            headpc         1
0129000201210244 O                                          105 'PLAN CHANGE REPORT'
0129010201210242 O          e            headpc         1
013200981119     O                       FRMDT               94 '  /  /    '
013300911111     O                                           96 '-'
013400981119     O                       TODT               107 '  /  /    '
0134010201210242 O          e            headpc         1
0137009111120248 O                                           19 'PROGRAM NAME: RP420'
013800020118     O                                           89 'ACCOUNT'
013900020118     O                       LTRST               93
014000020118     O                                           94 '/'
014100020118     O                       LSUB                97
014200020118     O                                           98 '/'
014300020118     O                       LACC               102
0144009111110138 O                                          189 'PAGE:'
0145009111110139 O                       PAGE          Z    198
0145010201210242 O          e            headpc         1
0148009111110253 O                                            9 'RUN DATE:'
0149009111110254 O                       UDATE         Y     18
0150009111110144 O                                          189 'TIME:'
0151009111110145 O                       TIME               198 '  :  :  '
0151010201210242 O          e            headpc         1
0154009102150259 O                                           24 '""""""""""""""""""""""""'
0155009102150260 O                                           48 '""""""""""""""""""""""""'
0156009102150261 O                                           72 '""""""""""""""""""""""""'
0157009102150262 O                                           96 '""""""""""""""""""""""""'
0158009102150263 O                                          120 '""""""""""""""""""""""""'
0159009111110153 O                                          144 '""""""""""""""""""""""""'
0160009111110154 O                                          168 '""""""""""""""""""""""""'
0161009111110155 O                                          192 '""""""""""""""""""""""""'
0162009111110156 O                                          198 '""""""'
0162010201180242 O          e            headpc         1
0165009111110267 O                                            7 'ACCOUNT'
0166000201180268 O                                           22 'NAME'
0167000201180269 O                                           66 '# OF'
0168000201180269 O                                           77 'FROM'
0169009111210269 O                                           90 'DESCRIPTION'
0170009111210269 O                                          110 'TO'
0171009111210269 O                                          127 'DESCRIPTION'
0172009111210269 O                                          152 'SMAN'
0173009111210269 O                                          159 'SMAN'
0174000201210269 O                                          172 'CURRENT'
0175000201180269 O                                          186 'TRANSACTION'
017600981119     O                                          198 'EFFECTIVE'
0177010201180242 O          e            headpc         1
0179000201180272 O                                           69 'MEMBERS'
0180000201180273 O                                           77 'PLAN'
0181009111210273 O                                          112 'PLAN'
0182009111210274 O                                          159 'TYPE'
0182010201210269 O                                          172 'BALANCE'
0183000201180275 O                                          186 'DATE'
0184000201180275 O                                          198 'DATE'
0184010201180242 O          e            headpc         2
0187009102150281 O                                           24 '""""""""""""""""""""""""'
0188009102150282 O                                           48 '""""""""""""""""""""""""'
0189009102150283 O                                           72 '""""""""""""""""""""""""'
0190009102150284 O                                           96 '""""""""""""""""""""""""'
0191009102150285 O                                          120 '""""""""""""""""""""""""'
0192009111110153 O                                          144 '""""""""""""""""""""""""'
0193009111110154 O                                          168 '""""""""""""""""""""""""'
0194009111110155 O                                          192 '""""""""""""""""""""""""'
0195009111110156 O                                          198 '""""""'
019501020121
019502020121     o* plan term report headings
019503020121
0195040201210237 O          e            headpt         2 03
0195050201210125 O                                           77 '***'
0195060201210126 O                       CONAME             117
0195070201210127 O                                          120 '***'
0195080201210242 O          e            headpt         1
0195090201210244 O                                          107 'MASS PLAN TERM REPORT'
0195100201210242 O          e            headpt         1
019511020121     O                       FRMDT               94 '  /  /    '
019512020121     O                                           96 '-'
019513020121     O                       TODT               107 '  /  /    '
0195140201210242 O          e            headpt         1
0195150201210248 O                                           19 'PROGRAM NAME: RP420'
019516020121     O                                           89 'ACCOUNT'
019517020121     O                       LTRST               93
019518020121     O                                           94 '/'
019519020121     O                       LSUB                97
019520020121     O                                           98 '/'
019521020121     O                       LACC               102
019522020121     O                                           +3 'TERM CODE:'
019523020121     O                       lterm               +1
0195240201210138 O                                          189 'PAGE:'
0195250201210139 O                       PAGE          Z    198
0195260201210242 O          e            headpt         1
0195270201210253 O                                            9 'RUN DATE:'
0195280201210254 O                       UDATE         Y     18
0195290201210144 O                                          189 'TIME:'
0195300201210145 O                       TIME               198 '  :  :  '
0195310201210242 O          e            headpt         1
0195320201210259 O                                           24 '""""""""""""""""""""""""'
0195330201210260 O                                           48 '""""""""""""""""""""""""'
0195340201210261 O                                           72 '""""""""""""""""""""""""'
0195350201210262 O                                           96 '""""""""""""""""""""""""'
0195360201210263 O                                          120 '""""""""""""""""""""""""'
0195370201210153 O                                          144 '""""""""""""""""""""""""'
0195380201210154 O                                          168 '""""""""""""""""""""""""'
0195390201210155 O                                          192 '""""""""""""""""""""""""'
0195400201210156 O                                          198 '""""""'
0195410201180242 O          e            headpt         1
0195420201180267 O                                            7 'ACCOUNT'
0195430201180268 O                                           22 'NAME'
0195440201180269 O                                           66 '# OF'
0195450201180269 O                                           77 'FROM'
0195460201180269 O                                           90 'DESCRIPTION'
0195470201180269 O                                          112 'TERM'
0195480201210269 O                                          172 'CURRENT'
0195500201180269 O                                          186 'TRANSACTION'
019551020118     O                                          198 'EFFECTIVE'
0195520201180242 O          e            headpt         1
0195530201180272 O                                           69 'MEMBERS'
0195540201180273 O                                           77 'PLAN'
0195550201180269 O                                          112 'CODE'
0195560201210269 O                                          172 'BALANCE'
0195570201180275 O                                          186 'DATE'
0195580201180275 O                                          198 'DATE'
0195590201180242 O          e            headpt         2
0195600201180281 O                                           24 '""""""""""""""""""""""""'
0195610201180282 O                                           48 '""""""""""""""""""""""""'
0195620201180283 O                                           72 '""""""""""""""""""""""""'
0195630201180284 O                                           96 '""""""""""""""""""""""""'
0195640201180285 O                                          120 '""""""""""""""""""""""""'
0195650201180153 O                                          144 '""""""""""""""""""""""""'
0195660201180154 O                                          168 '""""""""""""""""""""""""'
0195670201180155 O                                          192 '""""""""""""""""""""""""'
0195680201180156 O                                          198 '""""""'
019569020121
019570020121     o* plan change line
019571020121
0196000201180287 O          E            LINEpc         1
0197000201210288 O                       H1                   3
0197010201210288 O                                            4 '-'
0197020201210288 O                       H2                   7
0197030201210288 O                                            8 '-'
0197040201210288 O                       H3                  12
0198000201180289 O                       ACNAM1         B    58
0199000201180290 O                       NOMEM         3B    69
0200000201180291 O                       FRPLN          B    77
020100911121     O                       FRDSC          B   104
0201010201180291 O                       TOPLN          B   112
020102020118     O                       TODSC          B   141
020400911121     O                       SMANCD         B   151
020500911121     O                       STYPE          B   158
020600911121     O                       TOTBAL        CB   174
0207009811190293 O                       TRDMDY             186 '  /  /    '
020800981119     O                       COVMDY             198 '  /  /    '
020801020121
020802020121     o* plan term line
020803020121
0208040201180287 O          E            LINEpt         1
0208060201210288 O                       H1                   3
0208070201210288 O                                            4 '-'
0208080201210288 O                       H2                   7
0208090201210288 O                                            8 '-'
0208100201210288 O                       H3                  12
0208110201180289 O                       ACNAM1         B    58
0208120201180290 O                       NOMEM         3B    69
0208130201180291 O                       FRPLN          B    77
020814020118     O                       FRDSC          B   104
0208150201180291 O                       termcode           112
020816020118     O                       TOTBAL        CB   174
0208170201180293 O                       TRDMDY             186 '  /  /    '
020818020118     O                       COVMDY             198 '  /  /    '
020819020121
0208200201180287 O          E            l1tot       1  1
0208210201180288 O                                           69 '---------'
0208220201180287 O          E            l1tot
0208230201180290 O                       totmem        3     69
0209009111110237 OREPORT2   E            ERRHED         1 05
021000911112     O                                           19 'PROGRAM NAME: RP420'
021100020121     O                                           74 'PLAN CHANGE/TERM ERROR'
021101020121     O                                           81 'REPORT'
0212009111110237 O          E            ERR1           1
021300911111     O                                           17 'INVALID ACCOUNT -'
021400911112     O                       HKEY                28
021500911111     O          E            ERR2           1
021600911111     O                                           23 'INVALID SALESMAN CODE -'
021700911111     O                       SMANCD              27
021800911111     O                                           39 'ACCOUNT -'
021900911112     O                       HKEY                51
