0001009102150002 F****************************************************************
0002009102150003 F*                                                              *
0003009503270004 F*  DESCRIPTION - SPIN THRU ACCMST &                            *
0004009503270005 F*                               CREATE "OUTPUT" RECORD.        *
0005009102150006 F*                                                              *
0006009712010007 F*            FILE "OUTPUT" IS USED AS PRIMARY FILE IN "RP480". *
0007009102150008 F*                                                              *
0008009811190014 F*                                                                *
0009009811190010 F*  Y2K CONVERT - 1998                                            *
001000000410      *                                                                *
001100000410      *            Revised by - szien                                  *
001200000410      *            Date - 4/10/00                                      *
001300000410      *            Revision:  Converted from RP481 in QS36SRC. Changed *
001400000410      *                       the name of the output file.             *
0015009811190015 F*                                                                *
0016009102150010 F****************************************************************
0017000004100011 FACCMST    IP   F  560        DISK
0018000004100012 FRP481WK   O  A F  560        DISK
0019009711140036 D                 DS
0020009711140047 D  ANVYM                  1      6  0
002100971114     D  ANVYR                  1      4  0
0022009711140046 D  ANVMM                  5      6  0
0023009102150040 D                UDS
0024009711140041 D  LMMYY                  1      6  0
0025009102150042 D  LMM                    1      2  0
0026009711140043 D  LYY                    3      6  0
0027009711140044 D  LTRUST                 7      9
0028009102150015 I*
0029009102150018 IACCMST    NS  01
0030009102150019 I                                  1    3  TRUST#
0031009102150020 I                                  1  256  ALL1
0032009102150021 I                                257  512  ALL2
0033009811190021 I                                513  560  ALL3
0034009811190028 I                                486  487 0RNEWPD
0035009811190029 I                                537  544 0ATERM
0036009811190023 I                                545  552 0ENROLL
0037009811190024 I                                549  550 0ENRLMM
0038009811190025 I                                545  548 0ENRLYY
0039009102150046 C*-------------------------------------------------------------------
0040009102150047 C*
0041009102150048 C*  IGNORE NON-ACTIVE RECORDS.........
0042009102150049 C*
0043009811190050 C     ATERM         IFNE      0
0044009102150051 C                   GOTO      END
0045009102150052 C                   END
0046009102150053 C*
0047009102150054 C*  ONLY PROCESS MATCHING TRUST #'S, IF TRUST # SPECIFIED ON PROMPT....
0048009102150055 C*
0049009102150056 C     LTRUST        IFNE      'ALL'
0050009102150057 C     LTRUST        IFNE      TRUST#
0051009102150058 C                   GOTO      END
0052009102150059 C                   END
0053009102150060 C                   END
0054009102150061 C********************************************************************
0055009102150062 C* CALCULATE RENEWAL DATE                                           *
0056009102150063 C********************************************************************
005700910215     C*
0058009811190064 C                   Z-ADD     ENRLMM        ANVMM
0059009811190065 C                   Z-ADD     ENRLYY        ANVYR
0060009711140066 C                   MOVEL     LYY           LDAYM             6 0
0061009102150067 C                   MOVE      LMM           LDAYM
0062009102150068 C*
006300910215     C* DUMP OF ALL ACCOUNTS - MAKE DATE COMPARISON FIELDS EQUAL.
006400910215     C*
006500910215     C     LMMYY         IFEQ      *ZEROS
006600910215     C                   MOVE      LDAYM         ANVYM
006700910215     C                   GOTO      #ALL
006800910215     C                   END
006900910215     C*
007000981119     C     RNEWPD        IFGT      0
0071009102150069 C     ANVYM         DOUGE     LDAYM
0072009811190070 C                   ADD       RNEWPD        ANVMM
0073009102150071 C*
0074009102150072 C     ANVMM         DOWGT     12
0075009102150073 C                   SUB       12            ANVMM
0076009711140074 C                   ADD       1             ANVYR
0077009102150075 C                   END
0078009102150076 C*
0079009102150077 C                   END
0080009811190077 C                   END
0081009102150081 C*
008200910215     C*
008300910215     C     #ALL          TAG
008400910215     C*
008500910215     C*
0086009102150078 C**************
0087009102150079 C*
0088009102150080 C*  IF NEXT ENROLL DATE = DATE FROM LDA, THEN CREATE RECORD.......
008900910215     C*
0090009102150082 C     ANVYM         IFEQ      LDAYM
0091009102150118 C                   EXCEPT    ADD1
0092009102150119 C                   END
0093009102150120 C*
0094009102150121 C     END           TAG
0095009102150122 C*
0096000004100123 ORP481WK   EADD         ADD1
0097009102150124 O                       ALL1               256
0098009102150125 O                       ALL2               512
0099009811190125 O                       ALL3               560
