0001009102150002 F******************************************************************
0002000004140003 F* RPA062     GROUP BENEFIT SERVICES SOFTWARE           1990      *
0003009102150004 F*                                                                *
0004009102150005 F*            WRITTEN BY - DEBORAH R. BEYER                       *
0005009102150006 F*            DATE - 03/02/90                                     *
0006009102150007 F*                                                                *
0007009102150008 F*                                                                *
0008009102150009 F*            REVISED: 06/20/90   WALTER J PICCININI              *
0009009102150010 F*            MODIFY GRATE PROCESSING. READ FILE & COMPARE FROM-TO*
0010009102150011 F*            DATES TO GET CORRECT GRATE RECORD.....              *
001100980304     F*                                                                *
001200980304     F*  DMA  03.04.98  Calc and print percentage of commission        *
001300980304     F*                                                                *
0014009102150012 F*                                                                *
0015009102150013 F*  DESCRIPTION - THIS PROGRAM WILL PRODUCE G B S COMMISSION      *
0016009102150014 F*            STATEMENTS.                                         *
001700000622     F*
001800000622     F* 06/22/00 DLK - CHANGE NUMERIC FIELDS TO SIGNED OUTPUT SO CREDIT
001900000622     F*                AMOUNTS WILL SHOW.
002000000628     F* 06/28/00 DLK - STOP RUNNING THIS REPORT - IT IS NOT USEFULL
0021000006280015 F*                AS WRITTEN                                      *
0022000006280015 F*                                                                *
0023009102150016 F******************************************************************
0024009102150017 F*                                                                *
0025000303250018 FRPA068    IP   F  158        DISK
0026000303250020 FPLNMST    IF   E           K DISK    PREFIX(Y)
0027000303250021 FACCMST    IF   E           K DISK    PREFIX(Z)
0028000303250022 FREPORT    O    F  198        PRINTER OFLIND(*INOF)
0029009102150058 D/SPACE
0030009102150063 D                UDS
0031009809290064 D  RUNDAT                 1      8  0
0032009102150065 D  LMM                    1      2  0
0033009102150066 D  LDD                    3      4  0
0034009809290067 D  LYY                    5      8  0
0035009102150068 D  CONAME               201    240
0036009102150024 IRPA068    NS  01
003700030325     I                                  1    3 0TRS#
0038009102150026 I                                  1    6 0TRSUB         L5
0039009102150027 I                                  4    6 0SUB#
0040009102150028 I                                  1   10 0ACC#          L4
0041009809290029 I                                 11   14  PLAN#         L2
0042009102150030 I                                 15   23 0SSN           L1
0043009102150033 I                                 29   31  SMANCD
0044009102150034 I                                 32   36 2COMRTE
0045009102150035 I                                 37   39  COMTYP
0046009102150036 I                             P   40   43 2LPREM
0047009102150037 I                                 44   46  PCARR
0048009102150038 I                                 47   61  GROUP#        L3
0049009102150039 I                                 62  101  CNAME
0050009102150040 I                                102  106 2CRPRTE
0051009102150041 I                                107  109  CRPTYP
0052000007060041 I                                118  118 0MEMCNT
0053009102150045 I                             P  122  126 2SLSCOM
0054009102150046 I                             P  127  131 2CRPCOM
005500030325     I                                151  158  @@RELI
0056009102150070 C/EJECT
0057009102150071 C*
0058009102150072 C* CHAIN TO ACCMST FOR ACC NAME
0059009102150073 C*
0060000303250074 C***L4ACC#**********CHAIN*****ACCMST*****************************H1****
0061009102150075 C*
0062009102150076 C* CHAIN TO PLNMST FOR PLAN DESCRIPTION
0063009102150077 C*
0064000303250078 C***L2PLANKY********CHAIN*****PLNMST*****************************H3****
0065009102150079 C*
0066009102150080 C* COUNT MEMBERS PER PLAN
0067009102150081 C*
0068000007060082 C                   ADD       MEMCNT        MCOUNT            3 0
0069009102150083 C*
0070009102150084 C* ADD INDIVIDUAL TOTALS TO PLAN TOTALS
0071009705190085 C*   * ONLY IF CORP TYPE NOT "ILC" (BECAUSE SPLIT COMM SETUP
0072009705190085 C*     WAS DOUBLING PREM)
0073009705190085 C*
007400970519     C     CRPTYP        IFNE      'ILC'
0075009102150086 C                   ADD       LPREM         PLNPRM            9 2
007600970519     C                   END
007700950410     C*
007800950410     C* IF COMMISSION IS NEGATIVE, USE ZERO INSTEAD
007900950410     C*
008000000706     C*          CRPCOM    IFLT 0
008100000706     C*                    MOVE *ZEROS    CRPCOM
008200000706     C*                    END
008300950410     C*
0084009102150087 C                   ADD       CRPCOM        PLNCOM            9 2
0085009102150088 C****************************************************************
0086009102150089 C*  END OF DETAIL CALCULATIONS                                  *
0087009102150090 C****************************************************************
0088009102150091 C*
0089009102150092 C* ADD PLAN TOTALS TO ACCOUNT TOTALS
0090009102150093 C*
0091009102150094 CL2                 ADD       PLNPRM        ACCPRM            9 2
0092009102150095 CL2                 ADD       PLNCOM        ACCCOM            9 2
009300980304     CL2                 MOVE      *ZEROS        PERCEN            4 2
009400980304     CL2   PLNPRM        IFNE      0
009500980304     CL2   PLNCOM        DIV(H)    PLNPRM        HLDPER            6 6
009600980304     CL2   HLDPER        MULT      100           PERCEN
009700980304     CL2                 END
0098009102150096 C*
0099009102150097 C* ADD ACCOUNT TOTALS TO TRUST TOTALS
0100009102150098 C*
0101000006220099 CL4                 ADD       ACCPRM        TRSPRM           10 2
0102009102150100 CL4                 ADD       ACCCOM        TRSCOM            9 2
0103009102150101 C*
0104009102150102 C* ADD TRUST TOTALS TO COMPANY TOTALS
0105000006220103 CL5                 ADD       TRSPRM        CMPPRM           11 2
0106009102150104 CL5                 ADD       TRSCOM        CMPCOM            9 2
0107009102150105 O/EJECT
0108009102150106 O******************************************************
0109009102150107 O*  OUTPUT SPECIFICATIONS                             *
0110009102150108 O******************************************************
0111009102150109 O*
0112009102150110 OREPORT    H    1P                     2 03
0113009102150111 O         OR    OF
0114009102150112 O                                           86 '*****'
0115009102150113 O                       CONAME             126
0116009102150114 O                                          132 '*****'
0117009102150115 O          H    1P                     2
0118009102150116 O         OR    OF
0119009807290117 O                                          106 'CORPORATE COMMISSION '
0120009807290118 O                                          113 'LISTING'
0121009102150119 O          H    1P                     1
0122009102150120 O         OR    OF
0123009102150121 O                                           25 'PROGRAM NAME: RPA062'
0124009102150122 O                                          174 'PAGE:'
0125009102150123 O                       PAGE          Z    197
0126009102150124 O          H    1P                     1
0127009102150125 O         OR    OF
0128009102150126 O                                           14 'RUN DATE:'
0129009102150127 O                       UDATE         Y     25
0130009102150128 O                                          102 'COMMISSION PERIOD:'
0131009102150129 O                       RUNDAT        Y    113
013200980929     O                       LMM                107
013300980929     O                                          108 '/'
013400980929     O                       LDD                110
013500980929     O                                          111 '/'
013600980929     O                       LYY                115
0137009102150130 O          H    1P
0138009102150131 O         OR    OF
0139009102150132 O                                           73 'CARRIER ASSIGNED'
0140009102150133 O                                          174 'NO. OF '
0141009102150134 O          H    1P                     1
0142009102150135 O         OR    OF
0143009102150136 O                                            9 'ACCOUNT #'
0144009102150137 O                                           26 'ACCOUNT NAME'
0145009102150138 O                                           68 'GROUP#'
0146009102150139 O                                           83 'CARRIER'
0147009102150140 O                                          137 'PLAN DESCRIPTION'
0148000006220141 O                                          172 'MEMBERS'
0149009102150142 O                                          184 'PREMIUM'
0150009102150143 O                                          198 'COMMISSION'
0151009102150144 O          H    1P                     1
0152009102150145 O         OR    OF
0153009102150146 O                                           24 '________________________'
0154009102150147 O                                           48 '________________________'
0155009102150148 O                                           72 '________________________'
0156009102150149 O                                           96 '________________________'
0157009102150150 O                                          120 '________________________'
0158009102150151 O                                          144 '________________________'
0159009102150152 O                                          168 '________________________'
0160009102150153 O                                          192 '________________________'
0161009102150154 O                                          198 '______'
0162009102150155 O          D    L4                  0  0
0163000304270156 O                       ACC#                13 '0   -   -    '
0164000303250157 O                       ZACNAM1             55
0165009102150158 O          T    L2                     1
0166009102150161 O                       GROUP#              75
0167009102150162 O                       PCARR               79
0168009102150163 O                       CNAME              121
0169009102150164 O                       PLAN#              125
0170000303250165 O                       YPDESCR            166
017100000622     O                                          163 '  '
017200000622     O                       PERCEN             168 '0 .  '
0173000007060166 O                       MCOUNT        LB   172
0174000006220167 O                       PLNPRM        JB   185
0175000006220168 O                       PLNCOM        JB   198
0176009102150169 O          T    L4                     1
0177000006220170 O                                          185 '----------'
0178009102150171 O                                          198 '----------'
0179009102150172 O          T    L4                     2
0180000006220173 O                       ACCPRM        JB   185
0181000006220174 O                       ACCCOM        JB   198
0182009102150175 O          T    L5                     1
0183000006220176 O                                          185 '-----------'
0184009102150177 O                                          198 '----------'
0185009102150178 O          T    L5                     1
0186000006220179 O                                          185 '-----------'
0187009102150180 O                                          198 '----------'
0188009102150181 O          T    L5                     2
0189000006220182 O                       TRSPRM        JB   185
0190000006220183 O                       TRSCOM        JB   198
0191009102150184 O          T    LR                     1
0192000006220185 O                                          185 '------------'
0193009102150186 O                                          198 '----------'
0194009102150187 O          T    LR                     1
0195000006220188 O                                          185 '------------'
0196009102150189 O                                          198 '----------'
0197009102150190 O          T    LR                     1
0198000006220191 O                       CMPPRM        JB   185
0199000006220192 O                       CMPCOM        JB   198
