000100190401      *========================================================================
000102190401       Ctl-opt option(*noDebugIo) dftactgrp(*no);
000103190401      *========================================================================
000104191024      * RPA06BR - Commissions File CSV Loader
000105190401      *========================================================================
000106190401      * Date         Int  Description
000107190401      * ---------    ---  -----------------------------------------------------
000108191024      * 10/24/2019   jt   Original Creation
000109200727      * 08/11/2020   jt   Moved msgWindow before sending error report. Changed
000110200727      *                   to new program call (RPA60BR).
000111200910      * 09/10/2020   jt   Recompiled for DB change
000112190401      *========================================================================
000113190401
000116191024       Dcl-f rpa60bd WorkStn Handler('PROFOUNDUI(HANDLER)');
000117190916
000118191024       //Dcl-f rpa60wf rename(r60f:mainFile) usage(*update) usropn;
000123190401
000124190401      *========================================================================
000125190401
000126190401       dcl-ds UploadFile Qualified;
000128190401         NumFiles Zoned(3);
000129190401         Directory Char(256);
000130190401         Files Char(256);
000131190401       End-Ds;
000132190401
000134190820       dcl-s myFileName char(256);
000135190820       dcl-s command char(512);
000136190820       dcl-s count char(5);
000137190820
000140190820       dcl-c q '''';
000141190820
000142190401     d psds           sds
000143190401     d proc_name         *proc
000144190401     d user                  254    263
000145190401
000146200624     d*bypass          pr                  ExtPgm('RPA61R')
000147200624     d bypass          pr                  ExtPgm('RPA61BR')
000148190820     d  count                         5
000149190820
000150200727     d*bypass2         pr                  ExtPgm('RPA60R')
000151200727     d bypass2         pr                  ExtPgm('RPA60BR')
000152190820
000153190820     d cmd             pr                  ExtPgm('QCMDEXC')
000154190820     d  command                     200    const
000155190820     d  length                       15  5 const
000156190820
000157191024     d rpa06br         pi
000158190401     d  type                          1
000159190401
000160190401      //======================================================================
000161190401      // mainline
000162190401      //======================================================================
000163190401
000164190401       exsr init;
000165190401       exsr main;
000166190401       exsr exit;
000167190401
000168190401      //======================================================================
000169190401      // moin
000170190401      //======================================================================
000171190401
000172190401       begsr main;
000173190401
000174190820        dow btnExit = '0';
000175190820         exfmt Screen1;
000176190401
000177190401         if btnExit = '1';
000178190401          leave;
000179190401         endif;
000180190401
000181190401         myFileName = UploadFile.Files;
000182190820         exsr copy_toFile;
000183190820         exsr check_forErrors;
000184190401         leave;
000185190401        enddo;
000186190401
000187190401       endsr;
000188190401
000189190820      //======================================================================
000190190820      // copy to file
000191190820      //======================================================================
000192190820
000193190820       begsr copy_toFile;
000194190820
000195200624        command = 'CpyFrmImpF FromStmF(''/tmp/rpa60wf.csv'')' + ' ' +
000196200624                   'ToFile(*libl/rpa61wfa) MbrOpt(*replace)' + ' ' +
000197200624                   'RcdDlm(*all) StrDlm(*none) RmvBlank(*none)' + ' ' +
000198200624                   'FldDlm('','') FromRcd(1) RplNullVal(*FldDft)';
000199200624        cmd(%trim(command): %len(%trim(command)));
000200200624
000231190820       endsr;
000232190820
000233190820      //======================================================================
000234190820      // check for errors;
000235190820      //======================================================================
000236190820
000237190820       begsr check_forErrors;
000238190820
000246200624        command = 'clrpfm rpa60wf';
000247200624        cmd(%trim(command): %len(%trim(command)));
000248200624
000249200624        command = 'clrpfm rpa60wfb';
000250200624        cmd(%trim(command): %len(%trim(command)));
000251200624
000252190820        bypass(count);
000253200624
000254190820        if count <> '00000';
000258200727
000259200727         exfmt msgWindow;
000260200727
000261200624         command = 'Sql2Eml' + ' ' + q + 'select * from rpa60wfb' + q + ' ' +
000262200624                  q + '/tmp/cmbyp.xls' + q + ' ' +
000263200624                  'Subj(' + q + 'Commision Bypass Error Report' + q + ')';
000264200624
000265190820         cmd(%trim(command): %len(%trim(command)));
000266190820
000267190820         type = 'N';
000268190820        else;
000269190820         bypass2();
000270190820         type = 'Y';
000271190820        endif;
000272190820
000273190820       endsr;
000274190820
000275190401      //======================================================================
000276190401      // exit
000277190401      //======================================================================
000278190401
000279190401       begsr exit;
000280190401
000281190401        *inlr = '1';
000282190401        return;
000283190401
000284190401       endsr;
000285190401
000286190401      //======================================================================
000287190401      // init
000288190401      //======================================================================
000289190401
000290190401       begsr init;
000291190401
000292190401        pgmname = proc_name;
000293190401        btnExit = '0';
000294190401        type = 'N';
000295190401
000296191024        title = 'Commission Bypass Process';
000297190916
000298190401       endsr;
000299190401
000300190401      //======================================================================
