000100910215     H DFTNAME(RPA064)
0002009102150002 F******************************************************************
0003000004140003 F* RPA064     GROUP BENEFIT SERVICES SOFTWARE           1990      *
0004009102150004 F*                                                                *
0005009102150005 F*            WRITTEN BY - DEBORAH R. BEYER                       *
0006009102150006 F*            DATE - 03/06/90                                     *
0007009102150007 F*                                                                *
0008009102150008 F*                                                                *
0009009102150009 F*            REVISED: 06/20/90   WALTER J PICCININI              *
0010009102150010 F*            MODIFY GRATE PROCESSING. READ FILE & COMPARE FROM-TO*
0011009102150011 F*            DATES TO GET CORRECT GRATE RECORD.....              *
0012009102150012 F*                                                                *
0013009102150013 F*  DESCRIPTION - THIS PROGRAM WILL PRODUCE G B S COMMISSION      *
0014009102150014 F*            STATEMENTS.                                         *
001500000622     F* 06/22/00 DLK - CHANGE NUMERIC FIELDS TO SIGNED OUTPUT SO CREDIT
001600000622     F*                AMOUNTS WILL SHOW.
001700030617     F* 06/03/03 DLK - CHANGE RPA068 INPUT FILE LENGTH
001800080911     F* 09/11/08 DLK - CHANGE RPA068 INPUT FILE LENGTH
001900081015     F* 10/15/08 DLK - CHANGE RPA068 INPUT FILE LENGTH
002000110615     F* 06/15/11 DLK - convert to rpgle and change rpa068 input file
0021001106150015 F*                to rpa068wk
0022001106150015 F*                                                                *
0023009102150016 F******************************************************************
0024009102150017 F*                                                                *
0025001106150018 FRPA068wk  IP   F  193        DISK
0026001106150020 FPLNMST    IF   F  200    10AIDISK    KEYLOC(1)
0027001106150021 FTRSMST    IF   F  264     3AIDISK    KEYLOC(1)
0028001106150022 FREPORT    O    F  198        PRINTER OFLIND(*INOF)
0029009102150057 D/SPACE
0030009102150058 D                 DS
0031009809290059 D  PLANKY                 1     10
0032009102150060 D  TRSUB                  1      6  0
0033009809290061 D  PLAN#                  7     10
0034009102150069 D                UDS
0035009809290070 D  RUNDAT                 1      8  0
0036009102150071 D  LMM                    1      2  0
0037009102150072 D  LDD                    3      4  0
0038009809290073 D  LYY                    5      8  0
0039009102150074 D  CONAME               201    240
0040001106150024 IRPa068wk  NS  01
0041009102150026 I                                  1    6 0TRSUB
0042009102150027 I                                  1    3 0TRUST         L4
0043009102150028 I                                  1   10 0ACC#
0044009809290029 I                                 11   14  PLAN#         L2
0045009102150030 I                                 15   23 0SSN           L1
0046001401030030 I                                 24   25 0depseq
004700081009     I                                 28   28  RPPDFL
0048009102150033 I                                 29   31  SMANCD
0049009102150034 I                                 32   36 2COMRTE
0050009102150035 I                                 37   39  COMTYP
0051009102150036 I                             P   40   43 2LPREM
0052001106160037 I                                 44   46  PCARR         L3
0053009102150038 I                                 47   61  GROUP#        L3
0054009102150039 I                                 62  101  CNAME
0055009102150040 I                                102  106 2CRPRTE
0056009102150041 I                                107  109  CRPTYP
0057000007060041 I                                118  118 0MEMCNT
0058009102150045 I                             P  122  126 2SLSCOM
0059009102150046 I                             P  127  131 2CRPCOM
0060009102150047 IPLNMST    NS
0061009102150049 I                                 11   50  PDESCR
0062009102150054 ITRSMST    NS
0063009102150056 I                                  4   23  TNAME
0064009102150077 C***
0065009102150078 C*
0066009102150079 C* CHAIN TO TRSMST FOR TRUST NAME
0067009102150080 C*
0068009102150081 C   L4TRUST         CHAIN     TRSMST                             H1
0069009102150082 C*
0070009102150083 C* CHAIN TO PLNMST FOR PLAN DESCRIPTION
0071009102150084 C*
0072009102150085 C   L2PLANKY        CHAIN     PLNMST                             H3
0073009102150086 C*
0074009102150087 C*
0075000007060088 C* COUNT MEMBERS PER PLAN
0076009102150089 C*
0077000007060090 C                   ADD       MEMCNT        MCOUNT            7 0
0078009102150091 C*
0079009102150092 C* ACCUMULATE PLAN TOTALS
0080009102150093 C*
0081009102150094 C                   ADD       LPREM         PLNPRM            9 2
008200950410     C*
008300950410     C* IF COMMISSION IS NEGATIVE, USE ZERO INSTEAD
008400950410     C*
008500000706     C*          CRPCOM    IFLT 0
008600000706     C*                    MOVE *ZEROS    CRPCOM
008700000706     C*                    END
008800950410     C*
0089009102150095 C                   ADD       CRPCOM        PLNCOM            9 2
0090009102150096 C****************************************************************
0091009102150097 C*  END OF DETAIL CALCULATIONS                                  *
0092009102150098 C****************************************************************
0093009102150099 C*
0094009102150100 C* ADD PLAN TOTALS TO TRUST TOTALS
0095009102150101 C*
0096000006220102 CL2                 ADD       PLNPRM        TRSPRM           10 2
0097009102150103 CL2                 ADD       PLNCOM        TRSCOM            9 2
0098009102150104 C*
0099009102150105 C* ADD TRUST TOTALS TO COMPANY TOTALS
0100009102150106 C*
0101000006220107 CL4                 ADD       TRSPRM        CMPPRM           11 2
0102009102150108 CL4                 ADD       TRSCOM        CMPCOM            9 2
0103009102150109 C*
0104009102150110 O/EJECT
0105009102150111 O******************************************************
0106009102150112 O*  OUTPUT SPECIFICATIONS                             *
0107009102150113 O******************************************************
0108009102150114 O*
0109009102150115 OREPORT    H    1P                     2 03
0110009102150116 O         OR    OF
0111009102150117 O                                           78 '*****'
0112009102150118 O                       CONAME             118
0113009102150119 O                                          124 '*****'
0114009102150120 O          H    1P                     2
0115009102150121 O         OR    OF
0116009807290122 O                                           97 'CORPORATE SUMMARY '
0117009807290123 O                                          115 'COMMISSION LISTING'
0118009102150124 O          H    1P                     1
0119009102150125 O         OR    OF
0120009102150126 O                                           25 'PROGRAM NAME: RPA064'
0121009102150127 O                                          102 'COMMISSION PERIOD:'
012200980929     O                       LMM                107
012300980929     O                                          108 '/'
012400980929     O                       LDD                110
012500980929     O                                          111 '/'
012600980929     O                       LYY                115
0127009102150129 O                                          174 'PAGE:'
0128009102150130 O                       PAGE          Z    197
0129009102150131 O          H    1P                     1
0130009102150132 O         OR    OF
0131009102150133 O                                           14 'RUN DATE:'
0132009102150134 O                       UDATE         Y     25
0133009102150135 O          H    1P
0134009102150136 O         OR    OF
0135009102150137 O                                           73 'CARRIER ASSIGNED'
0136001106160138 O                                          169 'NO. OF'
0137009102150139 O          H    1P                     1
0138009102150140 O         OR    OF
0139009102150141 O                                            7 'TRUST #'
0140000006220142 O                                           19 'TRUST NAME'
0141001106160143 O                                           53 'GROUP#'
0142001106160144 O                                           68 'CARRIER'
0143000006220145 O                                          132 'PLAN DESCRIPTION'
0144000006220146 O                                          169 'MEMBERS'
0145000006220147 O                                          182 'PREMIUM'
0146009102150148 O                                          198 'COMMISSION'
0147009102150149 O          H    1P                     1
0148009102150150 O         OR    OF
0149009102150151 O                                           24 '________________________'
0150009102150152 O                                           48 '________________________'
0151009102150153 O                                           72 '________________________'
0152009102150154 O                                           96 '________________________'
0153009102150155 O                                          120 '________________________'
0154009102150156 O                                          144 '________________________'
0155009102150157 O                                          168 '________________________'
0156009102150158 O                                          192 '________________________'
0157009102150159 O                                          198 '______'
0158009102150160 O          T    L2                     1
0159009102150161 O                       TRUST                5
0160000006220162 O                       TNAME               29
0161001106160163 O                       GROUP#              60
0162001106160164 O                       PCARR               64
0163001106160165 O                       CNAME              106
0164000006220166 O                       PLAN#              120
0165000006220167 O                       PDESCR             161
0166000007060168 O                       MCOUNT        LB   169
0167000006220169 O                       PLNPRM        JB   184
0168000006220170 O                       PLNCOM        JB   198
0169009102150171 O          T    L4                     1
0170000006220172 O                                          184 '-----------'
0171000006220173 O                                          198 '-----------'
0172009102150174 O          T    L4                     2
0173000006220175 O                       TRSPRM        JB   184
0174000006220176 O                       TRSCOM        JB   198
0175009102150177 O          T    LR                     1
0176000006220178 O                                          184 '-------------'
0177000006220179 O                                          198 '-----------'
0178009102150180 O          T    LR                     1
0179000006220181 O                                          184 '-------------'
0180000006220182 O                                          198 '-----------'
0181009102150183 O          T    LR                     1
0182000006220184 O                       CMPPRM        JB   184
0183000006220185 O                       CMPCOM        JB   198
