000100210805      *========================================================================
000200210709     h dftactgrp(*no) option(*noDebugIo) bnddir('GBSBIND')
000300201221      *========================================================================
000400220721      * FM010R2 - Trust Master File Maintenance
000500180326      *========================================================================
000600180326      * Date         Int  Description
000700201208      * ----------   ---  -----------------------------------------------------
000800220721      * 07/21/2022   jt   Original Creation
000900180326      *========================================================================
001000180628
001100220721     ffm010d2   cf   e             WorkStn Handler('PROFOUNDUI(HANDLER)')
001101201208
001104220721     ftrsmst    uf a e           k disk    rename(trsmsr:trustFile)
001105201221     f                                     extfile('F.TRSMST')
001106220721
001107220721     fcobraaa   uf a e           k disk    rename(cobrar:cobrafile)
001108220721     f                                     extfile('F.COBRAAA')
001109220721
001110220721     ftrssup    uf a e           k disk    rename(trssur:suppFile)
001111220721     f                                     extfile('F.TRSSUP')
001113201221
001114220721     fcodes     if   e           k disk    rename(codesr:codesFile)
001115220721     f                                     extfile('F.CODES')
001116220721
001117220721     faacode    if   e           k disk    rename(aacodr:aafile)
001118220721
001119220721     ftrmhist1  if a e           k disk    rename(rtrmhist:histFile)
001120220721     f                                     extfile('F.TRMHIST1')
001121220721
001300201221      //=======================================================================
001400180323
001500180323     d psds           sds
001600201221     d  proc_name        *proc
001601201221     d  jobName              244    253
001602201221     d  userName             254    263
001603201221     d  jobNumber            264    269
001604210709
001610220721     d process         s              1
001618201221     d valid           s              1
001619220721     d strustc         s              3
001621220721     d trstc           s              3
001624210706     d cancel          s              1
001625220721     d changed         s              1
001626220721     d continue        s              1
001627220802     d e1envir         s             15
001628220802     d e1libl          s             10
001629220802     d e1Lib2          s             10
001630220802     d envColor        s             10
001631220802     d e1Acnm          s             40
001632220802
001633220802     d getEnv          pr                  ExtPgm('GETENVR')
001634220802     d  e1envir                      15
001635220802     d  e1libl                       10
001636220802     d  e1Lib2                       10
001637220802     d  envColor                     10
001638220802     d  e1Acnm                       40
001639210709
001714220721     d trustHist       pr                  ExtPgm('FM011R')
001715220802     d  inTrust                       3  0
001718210716
001723210706     d getCode         pr                  ExtPgm('WNCODEMSTR')
001724220721     d  trstc                         3
001725210706     d  pType                         3    const
001726210706     d  cancel                        1
001727210706
001728220721     d ChkPgmAuth      pr                  extpgm('CHKPGMAUTH')
001729220721     d  pgmname                      10
001730220721     d  continue                      1
001731220721
002103220721     d fm010r2         pi
002104220721     d  inTrust                       3  0
002105220721     d  inMode                        1
002108201208
002200201221      //=======================================================================
002300180323      // mainline
002400201221      //=======================================================================
002500180323
002600180323       exsr init;
002700180323       exsr main;
002800180323       exsr exit;
002900180323
003000201221      //=======================================================================
003100180323      // main
003200201221      //=======================================================================
003300180323
003400180323       begsr main;
003500180323
003501210709        exsr loadFields;
003502210709
003600180323        dow btnExit = '0';
003702201221
003703201221         exfmt screen1;
003900180323
004000180323         exsr checkButton;
004100180323
004200180323        enddo;
004300180323
004400180323       endsr;
004500180323
004566201221      //=======================================================================
004567201208      // checkButton
004568201221      //=======================================================================
004569201208
004570201208       begsr checkButton;
004571201208
004572201208        if btnExit = '1';
004573201208         leavesr;
004574201208        endif;
004661210805
004662220721        if buttonCode = '1';
004663220721         getCode(trstc : 'O' : cancel);
004664220721          if trstc > ' ';
004665220721           strstct = trstc;
004666220721          endif;
004667220721          buttonCode = '0';
004668220721         leavesr;
004669220721        endif;
004670220721
004671220721        if btnGreen = '1';
004672220721         exsr validRcd;
004673220721         if valid = '0';
004674220721          exsr moveFields;
004675220721         endif;
004676220721         btnGreen = '0';
004677220721        endif;
004678220721
004679220721        if btnHist = '1';
004680220721         strustc = %editc(strust:'X');
004681220802          trustHist(inTrust);
004682220721         btnHist = '0';
004684220721        endif;
004686220721
004687201208       endsr;
004688201208
004689201221      //=======================================================================
004700210716      // load fields
004800201221      //=======================================================================
004900180323
005000201208       begsr loadFields;
005100180323
005101210716        chain strust trustFile;
005102210716        if %found;
005103220721         strustname = tname;
005104220721         sdescrp = tdescr;
005105220721         saddr1 = ptadl1;
005106220721         saddr2 = ptadl2;
005107220721         saddr3 = ptadl3;
005108220721         saddr4 = ptadl4;
005109220721
005110220721         strstct = %subst(tscode:3:1);
005112220721         chain ('O' : (' ' + %subst(tscode:3:1))) codesFile;
005113220721         if %found;
005114220721          scatname = ldescr;
005115220721         endif;
005116220721
005117220721         sstoploss = stloss;
005118220721
005119220721         monitor;
005120220721          scontdt = %date(contdt:*iso);
005121220721         on-error;
005122220721          scontdt = d'0001-01-01';
005123220721         endmon;
005124220721
005125220721         strnbil = trnbil;
005126220721         strdltd = trdltd;
005127220721
005128220721         chain strust cobraFile;
005129220721         if %found;
005130220721          scacode = cacode;
005131220721         endif;
005132220721
005133220721         chain scacode aaFile;
005134220721         if %found;
005135220721          slnam = alnam;
005136220721         endif;
005137220721
005138220721         chain strust suppFile;
005139220721         if %found;
005140220721
005141220721          monitor;
005142220721           seffdt = %date(effdt:*iso);
005143220721          on-error;
005144220721           seffdt = d'0001-01-01';
005145220721          endmon;
005146220721
005147220721          sfremth = %char(fremth);
005148220721          sbegmth = %char(begmth);
005149220721         endif;
005150220721
005151210716        endif;
005152210716
005602201208       endsr;
005700180323
005701201221      //=======================================================================
005702220721      // add history
005703210805      //=======================================================================
005704201221
005705220721       begsr addHistory;
005706220721
005708220721        huserid = userName;
005709220721        hdate = %dec(%date);
005711220721        htime = %dec(%time);
005712220721        hjob  = jobName;
005713220721        hnumber = jobNumber;
005715220721
005716220721        htrst = strust;
005717220721        hbtname = strustname;
005718220721        hbtdescr = sdescrp;
005719220721        hbptadl1 = saddr1;
005720220721        hbptadl2 = saddr2;
005721220721        hbptadl3 = saddr3;
005722220721        hbptadl4 = saddr4;
005723220721        hbstloss = sstoploss;
005724220721        hbtrnbil = strnbil;
005725220721        hbtscode = 'O' + ' ' + strstct;
005726220721        hbtrdltd = strdltd;
005727220721        hbcontdt =  %dec(scontdt);
005733220721
005734220721        write histFile;
005740201221
006026201221       endsr;
006027201221
006028220721      //=======================================================================
006029220721      // change history
006030220721      //=======================================================================
006031220721
006032220721       begsr changeHistory;
006033220721
006034220721        changed = '0';
006035220721
006036220721        chain strust histFile;
006037220721        if %found;
006038220721
006039220721         if tname <> hbtname;
006040220721          hbtname = tname;
006041220721          changed = '1';
006042220721         endif;
006043220721
006044220721         if tdescr <> hbtdescr;
006045220721          hbtdescr = tdescr;
006046220721          changed = '1';
006047220721         endif;
006048220721
006049220721         if ptadl1 <> hbptadl1;
006050220721          hbptadl1 = ptadl1;
006051220721          changed = '1';
006052220721         endif;
006053220721
006054220721         if ptadl2 <> hbptadl2;
006055220721          hbptadl2 = ptadl2;
006056220721          changed = '1';
006057220721         endif;
006058220721
006059220721         if ptadl3 <> hbptadl3;
006060220721          hbptadl3 = ptadl3;
006061220721          changed = '1';
006062220721         endif;
006063220721
006064220721         if ptadl4 <> hbptadl4;
006065220721          hbptadl4 = ptadl4;
006066220721          changed = '1';
006067220721         endif;
006068220721
006081220721         if stloss <> hbstloss;
006082220721           hbstloss = stloss;
006083220721          changed = '1';
006084220721         endif;
006085220721
006087220721         if trnbil <> hbtrnbil;
006088220721          hbtrnbil = trnbil;
006089220721          changed = '1';
006090220721         endif;
006091220721
006093220721         if tscode <> %subst(hbtscode:3:1);
006094220721          hbtscode = tscode;
006095220721          changed = '1';
006096220721         endif;
006097220721
006100220721         if trdltd <> hbtrdltd;
006101220721          hbtrdltd = trdltd;
006102220721          changed = '1';
006103220721         endif;
006104220721
006107220721         if contdt <> hbcontdt;
006108220721          hbcontdt = contdt;
006109220721          changed = '1';
006110220721         endif;
006111220721
006114220721         huserid = userName;
006115220721         hdate = %dec(%date);
006116220721         htime = %dec(%time);
006117220721         hjob  = jobName;
006118220721         hnumber = jobNumber;
006119220721
006120220721         if changed = '1';
006121220721          write histFile;
006122220721         endif;
006123220721
006124220721        endif;
006125220721
006126220721       endsr;
006127220721
006128201221      //=======================================================================
006129210706      // valid record
006130201221      //=======================================================================
006131201221
006132210716       begsr validRcd;
006133220721
006134220721        valid = '0';
006135220721        errTrst = '0';
006136220721        errTDesc = '0';
006137220721        errPayable = '0';
006138220721        errTCat = '0';
006139221010        //errStLoss = '0';
006140220721        errCDate = '0';
006141220721        errStatus = '0';
006142220721        errAACode = '0';
006143220721        errEffdt = '0';
006144220721        errFM = '0';
006145220721        errBM = '0';
006146220721
006147220721        if btnText = 'Restore';
006148220721         exsr restoreRcd;
006149220721         leavesr;
006150220721        endif;
006374210709
006375220721        if strustname = ' ';
006376220721         errTrst = '1';
006377220721          valid  = '1';
006378220721         leavesr;
006379220721        endif;
006380220721
006381220721        if sdescrp = ' ';
006382220721         errTDesc = '1';
006383220721          valid  = '1';
006384220721         leavesr;
006385220721        endif;
006386220721
006387221010        if saddr1 = ' ' or saddr2 = ' ' or saddr3 = ' ';
006388220721         errPayable = '1';
006389220721          valid  = '1';
006390220721         leavesr;
006391220721        endif;
006392220721
006394220721        chain ('O' + ' ' + strstct) codesFile;
006395220721        if not %found;
006396220721         errTCat = '1';
006397220721          valid = '1';
006398220721         leavesr;
006399220721        endif;
006400220721
006401221010        //if sstoploss = 0;
006402221010        // errStLoss = '1';
006403221010        //  valid = '1';
006404221010        // leavesr;
006405221010        //endif;
006406220721
006413220721        if scontdt = d'0001-01-01';
006414220721         errCDate  = '1';
006415220721          valid = '1';
006416220721         leavesr;
006417220721        endif;
006418220721
006419220721        if strdltd = ' ';
006420220721         errStatus  = '1';
006421220721          valid = '1';
006422220721         leavesr;
006423220721        endif;
006424220721
006425220721        chain scacode aaFile;
006426220721        if not %found;
006427220721         errAACode = '1';
006428220721          valid = '1';
006429220721         leavesr;
006430220721        endif;
006431220721
006432220721        if (sfremth > '0' and seffdt = d'0001-01-01')
006433220721         or (sbegmth > '0' and seffdt = d'0001-01-01');
006434220721          errEffdt = '1';
006435220721          valid = '1';
006436220721         leavesr;
006437220721        endif;
006438220721
006439220721        if seffdt > d'0001-01-01' and sfremth = '0';
006441220721         errFM = '1';
006442220721          valid = '1';
006443220721         leavesr;
006444220721        endif;
006445220721
006446220721        if seffdt > d'0001-01-01' and sbegmth = '0';
006447220721         errBM = '1';
006448220721          valid = '1';
006449220721         leavesr;
006450220721        endif;
006451220721
006452220721       endsr;
006453201221
006454210706      //=======================================================================
006455220721      // restore record
006456210706      //=======================================================================
006457210706
006458220721       begsr restoreRcd;
006459210706
006460220721        trdltd = 'A';
006461220721        tspProtect = '0';
006462220721        update trustFile;
006463220721        msg = 'Record Restored';
006464220721        exfmt msgWindow;
006465220721        btnText = 'Update';
006466220721        valid = '1';
006467220721        exsr loadFields;
006477210706
006478210706       endsr;
006479210706
006480220721      //=======================================================================
006481220721      // move fields
006482220721      //=======================================================================
006483220721
006484220721       begsr moveFields;
006485220721
006486221010         trtrst = strust;
006487220721         tname = strustname;
006488220721         tdescr = sdescrp;
006489220721         ptadl1 = saddr1;
006490220721         ptadl2 = saddr2;
006491220721         ptadl3 = saddr3;
006492220721         ptadl4 = saddr4;
006493220721         tscode = 'O' + ' ' + strstct;
006494220721         stloss = sstoploss;
006495220721
006496220721         monitor;
006497220721          contdt = %dec(scontdt);
006498220721         on-error;
006499220721          contdt = 0;
006500220721         endmon;
006501220721
006502220721         trnbil = strnbil;
006503220721         trdltd = strdltd;
006504220721         cacode = scacode;
006505220721
006513220721
006514220721         if process = 'U';
006515220721          update trustFile;
006516220721           exsr changeHistory;
006517220721            exsr suplemental;
006518220721            exsr cobra;
006519220721           msg = 'Record Updated';
006520220721          exfmt msgWindow;
006521220721         else;
006522220721          write trustFile;
006523220721           exsr addHistory;
006524220721            exsr suplemental;
006525220721            exsr cobra;
006526220721           msg = 'Record Added';
006527220721          exfmt msgWindow;
006528220721         endif;
006529220721
006530220721       endsr;
006531220721
006532220721      //=======================================================================
006533220721      // suplemental file;
006534220721      //=======================================================================
006535220721
006536220721       begsr suplemental;
006537220721
006538220721        chain strust suppFile;
006539220721
006540220721        tstrst = strust;
006541220721        monitor;
006542220721         effdt = %dec(seffdt);
006543220721        on-error;
006544220721         effdt = 0;
006545220721        endmon;
006546220721
006547221010        if sfremth > ' ';
006548221010         fremth = %dec(sfremth:2:0);
006549221010        else;
006550221010         fremth = 0;
006551221010        endif;
006552221010
006553221010        if sbegmth > ' ';
006554221010         begmth = %dec(sbegmth:2:0);
006555221010        else;
006556221010         begmth = 0;
006557221010        endif;
006558220721
006559220721        if %found;
006560220721         update suppFile;
006561220721        else;
006562220721         write suppFile;
006563220721        endif;
006564220721
006565220721       endsr;
006566220721
006567220721      //=======================================================================
006568220721      // cobra file;
006569220721      //=======================================================================
006570220721
006571220721       begsr cobra;
006572220721
006573220721        chain strust cobraFile;
006574220721
006575220721        ctrst = strust;
006576220721        cacode = scacode;
006577220721
006578220721        if %found;
006579220721         update cobraFile;
006580220721        else;
006581220721         write cobraFile;
006582220721        endif;
006583220721
006584220721       endsr;
006585220721
008760210805      //=======================================================================
008800201221      // exit
008900201221      //=======================================================================
009000180323
009100180323       begsr exit;
009200180323
009300180323        *inlr = '1';
009400180323        return;
009500180323
009600180323       endsr;
009700180323
009800201221      //=======================================================================
009900180323      // init
010000201221      //=======================================================================
010100180323
010200180323       begsr init;
010300180323
010301220721        chain inTrust trustFile;
010302211013        if not %found;
010303211013         clear screen1;
010304220721          tspProtect = '0';
010305220721          btnText = 'Add';
010306220721         process = 'W';
010307211013        endif;
010308220721
010309220721        if %found;
010310220721         if trdltd = 'D';
010311220721          tspProtect = '1';
010312220721           btnText = 'Restore';
010313220721          process = 'U';
010314220721         endif;
010315220721        endif;
010316211013
010317220721        if %found;
010318220721         if trdltd <> 'D';
010319220721          tspProtect = '0';
010320220721           btnText = 'Update';
010321220721          process = 'U';
010322220721         endif;
010323220721        endif;
010324220721
010600180323        btnExit = '0';
010602201221        btnHist = '0';
010603220721        btnGreen = '0';
010604201221
010800180323        pgmname = proc_name;
010801201221
010806220721        strust = inTrust;
010816220721
010817220721        chain strust histFile;
010818220721
010819220721        tspInq = '1';
010820220721        if inMode = 'I';
010821220721         tspInq = '0';
010822220721         tspProtect = '1';
010823220721        endif;
010824220721
010825220721        if inMode = 'M';
010826220721         ChkPgmAuth(pgmname : continue);
010827220721         if continue = 'N';
010828220721          exsr exit;
010829220721         endif;
010830220721        endif;
010831220721
010832220802        getenv(e1envir : e1libl : e1Lib2 : envColor : e1Acnm);
010833220802
011200180323       endsr;
011300180323
011400201221      //=======================================================================
