000100000000      ******************************************************************
000200000000      *                                                                *
000300000000      *  RPA210    GROUP BENEFIT SERVICES SOFTWARE           1991      *
000400000000      *                                                                *
000500000000      *            WRITTEN BY -                                        *
000600000000      *            DATE -                                              *
000700000000      *                                                                *
000800000000      *  DESCRIPTION - THIS PROGRAM WILL PRODUCE A REPORT LISTING      *
000900000000      *       ALL ACCTS A COBRA MEMBER  HAS BEEN IN
001000131010      *                                                                *
001100131010      * 10/10/13 sbt - hist file expansion project                     *
001200000000      ******************************************************************
001300131010JGE01FHIST      IP   F  216        DISK
001400010301     FREPORT    O    F  132        PRINTER OFLIND(*INOF)
001500010313     D                UDS
001600010313     D  CONAME               201    240
001700010313     D  TIME                 242    247  0
001800000000     IHIST      NS  01
001900000000     I                                  2   10 0SSN           L2
002000000000     I                             P   20   24 2TRAMT
002100000000     I                                110  119 0TSA           L1
002200000000     C                   ADD       TRAMT         L1AMT            10 2
002300000000     OREPORT    H    1P                     2 03
002400000000     O         OR    OF
002500000000     O                                           44 '**'
002600000000     O                       CONAME              85
002700000000     O                                           91 '**'
002800000000     O          H    1P                     1
002900000000     O         OR    OF
003000000000     O                       UDATE         Y     14
003100000000     O                                           72 'COBRA BALANCES FROM '
003200000000     O                                           79 'HISTORY'
003300000000     O                                          123 'PAGE :'
003400000000     O                       PAGE          Z    132
003500000000     O          H    1P                     1
003600000000     O         OR    OF
003700000000     O                                           18 'PROG: RPA210'
003800000000     O                                          123 'TIME :'
003900000000     O                       TIME               132 '  :  :  '
004000000000     O          H    1P                     1
004100000000     O         OR    OF
004200000000     O                                           24 '------------------------'
004300000000     O                                           48 '------------------------'
004400000000     O                                           72 '------------------------'
004500000000     O                                           96 '------------------------'
004600000000     O                                          120 '------------------------'
004700000000     O                                          132 '------------'
004800000000     O          H    1P                     1
004900000000     O         OR    OF
005000000000     O                                            3 'SSN'
005100000000     O                                           20 'ACC#'
005200000000     O                                           45 'AMOUNT'
005300000000     O          H    1P                     2
005400000000     O         OR    OF
005500000000     O                                           24 '------------------------'
005600000000     O                                           48 '------------------------'
005700000000     O                                           72 '------------------------'
005800000000     O                                           96 '------------------------'
005900000000     O                                          120 '------------------------'
006000000000     O                                          132 '------------'
006100000000     O          T    L1                     1
006200000000     O                       SSN                 11 '   -  -    '
006300000000     O                       TSA                 28 '   -   -    '
006400000000     O                       L1AMT         JB    50
006500000000     O          T    L2                     1
006600000000     O                                            1 ' '
