000101200710      *========================================================================
000102200710     h option(*nodebugio)
000103200710      *========================================================================
000104200710      * RPA60BR - Commissions File CSV Loader
000105200710      *========================================================================
000106200710      * Date         Int  Description
000107200727      * ----------   ---  -----------------------------------------------------
000108200710      * 07/10/2020   jt   Original Creation (re-wote)
000109200910      * 09/10/2020   jt   Recompiled for DB change.
000110200710      *========================================================================
000111200710
001100200710     frpa60wf   if   e             disk    rename(r60f:mainFile)
001200200710
001300200710     frpa060wk  if a e             disk    rename(rpa60r:commFile)
001400200710
001500130109     FACMUNIQUE IF   E           K DISK
001600130109     FCARUNIQUE IF   E           K DISK
001700130109     FPLNUNIQUE IF   E           K DISK
001800130110     FSMANSP    IF   E           K DISK
001900200710     FMKTCARA1  IF   e           k DISK
001901200710
001902200710      *========================================================================
002800200710
003000200710     D parmmethod      s              2
003100200710     D parmrate        s              7  4
003200200710     D parmovramt      s              9  2
003300130110     D parmfound       s              1
003400200710     D mksz            s              5
003500200710
003600200710     d @@@parms        S            142
003700200710
003800130110     D                 DS
003900200710     D PRMS                    1    142
004000200710     D P@SMAN                  1      3
004100200710     D P@SNAME                 4     36
004200200710     D P@AGCY                 37     39
004300200710     D P@ANAME                40     79
004400200710     D P@SUPER                80     82
004500200710     D P@UNAME                83    132
004600200710     D P@RELID               133    140
004700200710     D P@RESULT              141    141
004800200710     D P@REQUEST             142    142
004900200710
004901200710     d gac900          pr                  ExtPgm('GAC900')
004902200710     d  @@@parms                    142
004903200710
004905200710     d getaocl         pr                  ExtPgm('GETAOCL')
004906200710     d  rprelid                       8
004907200710     d  rppcar                        3
004908200710     d  rpmaszcd                      5
004909200710     d  rpefdt                        8  0
004910200710     d  rppcom                        9  2
004911200710     d  rppprm                        9  2
004912200710     d  rpmcnt                        7  2
004913200710     d  parmmethod                    2
004914200710     d  parmrate                      7  4
004916200710     d  parmovramt                    9  2
004917200710     d  parmfound                     1
004918200710
004919200710      //======================================================================
004920200710      // mainline
004921200710      //======================================================================
004922200710
004923200710       exsr init;
004924200710       exsr main;
004925200710       exsr exit;
004926200710
004927200710      //======================================================================
004928200710      // main
004929200710      //======================================================================
004930200710
004931200710       begsr main;
004932200710
004933200710        setll 1 mainFile;
004934200710        read mainfile;
004935200710
004936200710        dow not %eof;
004937200710
004938200710         exsr process;
004939200710
004940200710        read mainfile;
004941200710        enddo;
004942200710
004943200710       endsr;
004944200710
004945200710      //======================================================================
004946200710      // process
004947200710      //======================================================================
004948200710
004949200710       begsr process;
004951200710
005100200710        clear commfile;
005200200710
005300200710        chain (r6trs : r6sub : r6acc) accmsr;
005301200710
005500200710        chain (r6trs : r6sub : r6pln) plnmsr;
005501200710
005502200710        chain pcarr carmsr;
005800200710
005900200710        prms = ' ';
006000200710        @@@parms = ' ';
006001200710
006100200710        p@relid = r6relid;
006200200710        p@request = 'R';
006300200710        @@@parms = prms;
006301200710
006302200710        gac900(@@@parms);
006600200710        prms = @@@parms;
006700200710
006800200710        chain p@sman smanr;
006900200710
007000200710        rpcdat = r6cdat;
007200200710        rpsmcd = p@sman;
007300200710        rpslnm = slname;
007400200710        rpsfnm = sfname;
007500200710        rpsmi = smi;
007600200710        rpccde = p@agcy;
007800200710        rptrst = r6trs;
007900200710        rpsub = r6sub;
008000200710        rpacc = r6acc;
008100200710        rpanm = acnam1;
008300200710        rpgrp = r6grp;
008400200710        rppcar = pcarr;
008500200710        rpcnam = cname;
008600200710        rpplan = r6pln;
008700200710        rppdsc = pdescr;
008900200710        rpcmrt = r6cmrt;
009000200710        rpmcnt = r6mcnt;
009100200710        rppprm = r6pprm;
009200200710        rpmthd = r6mthd;
009300200710
009400200710        if rpmthd = 'G ' or rpmthd = 'C ' or rpmthd = 'F ';
009401200710         rppcom = %dech(rpcmrt * rpmcnt:9:2);
009701200710        else;
009702200710         rppcom = %dech(rpcmrt * rppprm:9:2);
009703200710         rppcom = %dech(rppcom / 100 : 9:2);
010000200710        endif;
010100200710
010200200710        rpnote = r6note;
010300200710        rpchg = 'A';
010400200710        rpdum = 'C';
010401200710        rpedat = %dec(%subst(%char(r6efdt):1:6):6:0);
010900200710        rpefdt = r6efdt;
011100200710        rppspl = r6pspl;
011200200710        rpseq# = r6seq;
011300200710        rprelid = r6relid;
011500200710        rpcpddt = r6cpddt;
011600200710        rppaid = r6paid;
011800200710
012000200710        mksz = ' ';
012001200710
012200200710        setll (r6trs : r6sub : r6acc : pcarr) rmktcara;
012201200710        reade (r6trs : r6sub : r6acc : pcarr) rmktcara;
012300200710        dow not %eof;
012301200710
012500200710         if (mafrdt <> matodt) and (mafrdt <= RPefdt) and
012700200710            ((matodt >= RPefdt) or (matodt = 0));
012800200710          mksz = maszcd;
012900200710          leave;
013001200710         endif;
013002200710
013101200710        reade (r6trs : r6sub : r6acc : pcarr) rmktcara;
013102200710        enddo;
013200200710
013300200710        if mksz = ' ';
013301200710         mksz = '50';
013500200710        endif;
013600200710
013700200710        rpmaszcd = mksz;
015300130110
016200200710        parmmethod = ' ';
016300200710        parmrate = 0;
016400200710        parmovramt = 0;
016500200710        parmfound = ' ';
016600130110
016700200710        getaocl(rprelid:rppcar:rpmaszcd:rpefdt:rppcom:rppprm:rpmcnt:
016701200710                parmmethod:parmrate:parmovramt:parmfound);
016713200710
017100200710        if parmfound = 'Y';
017200200710         rpaomthd = parmmethod;
017300200710          rpaorate = parmrate;
017400200710         rpaoamt = parmovramt;
017500200710        endif;
017600130110
017800200710        if rppaid <> 'Y';
017900200710         rpaomthd = ' ';
018000200710          rpaorate = 0;
018100200710         rpaoamt = 0;
018200200710        endif;
018300200710
018400200710        write commFile;
018401200710
018402200710       endsr;
018500200710
018600200710      //======================================================================
018601200710      // exit
018602200710      //======================================================================
018603200710
018604200710       begsr exit;
018605200710
018606200710        *inlr = '1';
018607200710        return;
018608200710
018609200710       endsr;
018610200710
018611200710      //======================================================================
018612200710      // init
018613200710      //======================================================================
018614200710
018615200710       begsr init;
018625200710
018638200710       endsr;
018639200710
018640200710      //======================================================================
