0001009102150002 F******************************************************************
0002000004140003 F* RPM060      GROUP BENEFIT SERVICES SOFTWARE           1990      *
0003009102150004 F*                                                                *
0004009102150005 F*            WRITTEN BY - DAVID KETTERMAN                        *
0005009102150006 F*            DATE - 05/02/90                                     *
0006009102150007 F*                                                                *
0007009102150008 F*  DESCRIPTION - THIS PROGRAM WILL PRINT A TRANSACTION SUMMARY   *
0008009102150009 F*                BY USER ID.                                     *
0009009102150010 F*                                                                *
0010009811240011 F*                                                                *
0011009811240010 F*  Y2K CONVERT - 1998                                            *
0012000509280012 F* 09/28/05 DLK - CONVERT TO RPGLE                                *
0013001310100012 F* 10/10/13 sbt - Hist file expansion project                     *
0014001310180012 F* 10/18/13 sbt - Hist file expansion project - user to 10 char   *
0015009102150011 F*                                                                *
0016009102150012 F******************************************************************
0017009102150013 F*                                                                *
0018001310100014 FHIST      IP   F  216        DISK
0019000509280016 FCODES     IF   F   64     3AIDISK    KEYLOC(1)
0020000509280017 FREPORT    O    F  132        PRINTER OFLIND(*INOF)
0021009102150036 D/SPACE
0022009102150037 D* LDA
0023009102150038 D                UDS
0024000509280039 D  LFy                    1      4  0
0025000509280039 D  LFmd                   5      8  0
0026000509280040 D  LTy                    9     12  0
0027000509280040 D  LTmd                  13     16  0
0028001310180040 D  Luser                 17     26
0029009102150044 D  CONAME               201    240
0030009102150046 D  HMS                  242    247  0
0031009102150019 IHIST      NS  01
0032009102150020 I*  TRANSACTION HISTORY FILE
0033009102150025 I                                 17   19  TRCODE        L1
0034001310100030 I                                207  216  hoper         L2
0035009102150032 ICODES     NS  01
0036009102150033 I*  CODES
0037009102150034 I                                 14   43  LDESCR
0038009102150047 C*
0039009102150048 C* ACCUMULATE TOTALS
0040009102150049 C*
0041009807080050 C                   ADD       1             TRATOT            7 0
0042009807080051 C                   ADD       1             FINTOT            8 0
0043009807080052 C                   ADD       1             USRTOT            7 0
0044009102150053 C*
0045009102150054 C* GET NEW CODE DESCRIPTION ON CODE CHANGE
0046009102150055 C*
0047009102150056 C   L1TRCODE        CHAIN     CODES                              H1
0048000509280055  *
0049009102150058 O******************************************************
0050009102150059 O*  OUTPUT SPECIFICATIONS                             *
0051009102150060 O******************************************************
0052009102150061 O*
0053009102150062 OREPORT    H    1P                     2 03
0054009102150063 O         OR    OF
0055009102150064 O                       CONAME              87
0056009102150065 O          H    1P                     1
0057009102150066 O         OR    OF
0058009102150067 O                       UDATE         Y     14
0059009102150068 O                                           76 'TRANSACTION SUMMARY'
0060009102150069 O                                          120 'PAGE :'
0061009102150070 O                       PAGE          Z    130
0062009102150071 O          H    1P                     1
0063009102150072 O         OR    OF
0064009102150073 O                                           17 'PROG: RPM060'
0065009102150074 O                                          120 'TIME :'
0066009102150075 O                       HMS                130 '  :  :  '
0067009102150076 O          H    1P                     1
0068009102150077 O         OR    OF
0069009102150078 O                                           53 'FROM -'
0070000509280079 O                       LFmd                61 '0  /  /'
0071000509280079 O                       LFy                 65
0072000509280080 O                                           72 'TO -'
0073000509280079 O                       Ltmd                80 '0  /  /'
0074000509280079 O                       Lty                 84
0075000509280080 O                                           +3 'USER -'
0076000509280079 O                       Luser               +1
0077009102150082 O          H    1P                     1
0078009102150083 O         OR    OF
0079009102150084 O                                           24 '------------------------'
0080009102150085 O                                           48 '------------------------'
0081009102150086 O                                           72 '------------------------'
0082009102150087 O                                           96 '------------------------'
0083009102150088 O                                          120 '------------------------'
0084009102150089 O                                          132 '------------'
0085009102150090 O          H    1P                     1
0086009102150091 O         OR    OF
0087009102150092 O                                            7 'USER ID'
0088009102150093 O                                           30 'TRANSACTIONS'
0089009102150094 O                                           53 'TRANSACTION TYPE'
0090009102150095 O          H    1P                     2
0091009102150096 O         OR    OF
0092009102150097 O                                           24 '------------------------'
0093009102150098 O                                           48 '------------------------'
0094009102150099 O                                           72 '------------------------'
0095009102150100 O                                           96 '------------------------'
0096009102150101 O                                          120 '------------------------'
0097009102150102 O                                          132 '------------'
0098009102150103 O          D    L2                  0  0
0099001310100104 O                       hoper               10
0100009102150105 O          T    L1                     1
0101009102150106 O                       TRATOT        3B    25
0102009102150107 O                       LDESCR              67
0103009102150108 O          T    L2                     1
0104009807080109 O                                           25 '---------'
0105009102150110 O          T    L2                     2
0106009807080111 O                                           14 'TOTAL :'
0107009807080112 O                       USRTOT        3B    25
0108009102150113 O          T    LR                     1
0109009807080114 O                                           14 'FINAL TOTAL :'
0110009807080115 O                       FINTOT        3     25
