000100111115/* SENIOR DENTAL HISTORY BUILD BY RRN & ATTACH UNIQUE KEY */
000200111115
000300111115/* SSK 11/14/2011  */
000400111115
000500111115             PGM
000600111114
000700111115             OVRDBF     FILE(HIST) TOFILE(QS36F/F.HIST)
000800111115             OVRDBF     FILE(SDHIST) TOFILE(QS36F/SDHIST)
000900111115
001000111115             CALL       PGM(SDR0001)
001100111114
001200111115             DLTOVR     FILE(*ALL)
001300111115
001400111115             RCLRSC
001500111115
001600111114             ENDPGM
