000100170420/*===========================================================================*/
000200170420/* TEST - Production libl                                                    */
000300170420/*===========================================================================*/
000400060313
000500170420Pgm
000600170420
000700240515/* ClrLib qtemp */
001000170420
001100240214 ChgLibL Libl(+
001200240222  qssp qtemp gbsdtat gbspgmt gbsmod gbspgm +
001300201202  qgpl y2kdds dbu11 qs36f rpgspbeta jtorres profoundui)
001400920819
001401240222ChgCurLib gbsfullt
001402240222
001500170420EndPgm:
001600170420EndPgm
001700170420
001800170420/*===========================================================================*/
